[
    {
        "title": "第一章",
        "contents": [
            {
                "source": "天命之谓性；率性之谓道；修道之谓教。",
                "target": "人的自然禀赋叫做“天性”，遵循本性就叫做“道”，修养德行使自己的行为符合“道”的原则，影响和同化民众就叫作“教”。"
            },
            {
                "source": "道也者，不可须臾离也；可离，非道也。是故君子戒慎乎其所不睹，恐惧乎其所不闻。",
                "target": "“道”片刻都不能背离，如果可以背离，那就不是“道”了。所以，品德高尚的人即使在没有人看见的地方也是谨慎小心的的，即使没有人听见的地方也是有所戒惧的。"
            },
            {
                "source": "莫见乎隐，莫显乎微。故君子慎其独也。",
                "target": "越是身处隐蔽之地越不能放松自我要求，越是在细微的小事上，越要用心尽力。所以，品德高尚的人即使在独处的时候也是谨慎、自律的。"
            },
            {
                "source": "喜、怒、哀、乐之未发，谓之中。",
                "target": "人能够在喜怒哀乐时含而不露，叫做“中”。"
            },
            {
                "source": "发而皆中节，谓之和。",
                "target": "表现出来以后符合节度，叫做“和”。"
            },
            {
                "source": "中也者，天下之大本也。",
                "target": "“中”，是人人都有的本性。"
            },
            {
                "source": "和也者，天下之达道也。",
                "target": "“和”，是大家遵循的原则。"
            },
            {
                "source": "致中和，天地位焉，万物育焉。",
                "target": "达到“中和”的境界，天地便各安其位，万物就能够在和谐的环境中自然生长发育。"
            }
        ]
    },
    {
        "title": "第七章",
        "contents": [
            {
                "source": "子曰：“人皆曰‘予知’，驱而纳诸罟擭陷阱之中，而莫之知辟也。人皆曰‘予知’，择乎中庸，而不能期月守也。”",
                "target": "孔子说：“人人都说自己聪明，可是被驱赶到罗网陷阱中去却不知躲避。人人都说自己聪明，可是选择了中庸之道却连一个月时间也不能坚持。”"
            }
        ]
    },
    {
        "title": "第三十一章",
        "contents": [
            {
                "source": "唯天下至圣，为能聪、明、睿知、足以有临也；宽、裕、温、柔、足以有容也；发、强、刚、毅、足以有执也；齐、庄、中、正、足以有敬也；文、理、密、察、足以有别也。",
                "target": "只有天下崇高的圣人，才能做到聪明智慧，能够居于上位统治天下；宽宏大量，温和柔顺，能够包容天下；奋发勇健，刚强坚毅，能够决断天下大事；威严庄重，忠诚正直，能够博得人们的尊敬；条理清晰，详辨明察，能够辨别是非邪正。"
            },
            {
                "source": "溥博，渊泉，而时出之。",
                "target": "圣人的美德，广阔博大，像深不可测的泉水，时时涌出。"
            },
            {
                "source": "溥博如天；渊泉如渊。见而民莫不敬；言而民莫不信；行而民莫不说。",
                "target": "德行广博如天，德行深厚如渊。美德表现在仪表上，人们没有谁不敬佩；表现在言谈中，人们没有谁不信服；表现在行动上，人们没有谁不喜悦。"
            },
            {
                "source": "是以声名洋溢乎中国，施及蛮貊。舟车所至，人力所通，天之所覆，地之所载，日月所照，霜露所队：凡有血气者莫不尊亲。故曰，「配天」。",
                "target": "这样，美好的名声广泛流传在中国，并且传播到边远的少数民族地区。凡是车船行驶的地方，人力通行的地方，霜露降落的地方；凡有血气的生物，没有不尊重和不亲近他们的，所以说圣人的美德能与天相匹配。"
            }
        ]
    },
    {
        "title": "第三十三章",
        "contents": [
            {
                "source": "诗曰：“衣锦尚絅”，恶其文之著也。",
                "target": "《诗经》说：“内穿锦缎，外罩麻衣。”这是为了避免锦衣花纹大显露。"
            },
            {
                "source": "故君子之道，暗然而日章；小人之道，的然而日亡。",
                "target": "所以，君子的道深藏不露而日益彰明；小人的道显露无遗而日益消亡。"
            },
            {
                "source": "君子之道，淡而不厌、简而文、温而理。知远之近，知风之自，知微之显。",
                "target": "君子的道，平淡而从不厌倦，简朴而内有文采，温和而有条理，懂得远从近开始的道理，懂得风气有源头的道理，懂得微小的事物一定会显露的道理。"
            },
            {
                "source": "可与入德矣。",
                "target": "这样，就可以进入道德的境界了。"
            },
            {
                "source": "诗云：“潜虽伏矣，亦孔之昭。”故君子内省不疚，无恶于志。君子之所不可及者，其唯人之所不见乎。",
                "target": "《诗经》说：“潜藏虽然很深，但依然清晰可见。”所以君子自我反省没有愧疚，没有恶念头存于心志之中。君子的德行之所以高于一般人，大概就是在这些不被人看见的地方吧？"
            },
            {
                "source": "诗云：“相在尔室，尚不愧于屋漏。”故君子不动而敬，不言而信。",
                "target": "《诗经》说：“看你独自在室内的时候，也能无愧于神明。”所以，君子就是在没做什么事的时候，也能表现出他的恭敬，就是在没有对人说什么的时候也是信实的。"
            },
            {
                "source": "诗曰：“奏假无言，时靡有争。”是故君子不赏而民劝，不怒而民威于鈇钺。",
                "target": "《诗经》说：“默默无声地祈祷，现在不再有纷争。”所以，君子不用赏赐，老百姓也会互相对勉；不用发怒，老百姓也会像看到刀斧刑具一样畏惧。"
            },
            {
                "source": "诗曰：“不显惟德，百辟其刑之。”是故君子笃恭而天下平。",
                "target": "《诗经》说，“大大地弘扬美好德行，诸侯百官们都来效法。”所以，君子笃实恭敬就能使天下太平。"
            },
            {
                "source": "诗云：“予怀明德，不大声以色。”子曰：“声色之于以化民，末也。”",
                "target": "《诗经》说：“我怀有光明的品德，不用厉声厉色。”孔子说：“用厉声厉色去教育老百姓，是最拙劣的行为。”"
            },
            {
                "source": "诗曰：“德輶如毛。”毛犹有伦。“上天之载，无声无臭。”至矣。",
                "target": "《诗经》说：“德行轻如毫毛。”轻如毫毛还是有物可比拟。“上天所承载的，既没有声音也没有气味。”这才是最高的境界啊！"
            }
        ]
    },
    {
        "title": "第三十二章",
        "contents": [
            {
                "source": "唯天下至诚，方能经纶天下之大经，立天下之大本，知天地之化育。夫焉有所倚？",
                "target": "只有对天下百姓的真诚，才能成为治理天下的崇高典范，树立天下的根本，掌握天地化育万物的深刻道理，这需要依凭什么呢！"
            },
            {
                "source": "肫肫其仁！渊渊其渊！浩浩其天！",
                "target": "他的仁心那样诚挚，他的思虑像潭水那样幽深，他的美德像天空那样广阔。"
            },
            {
                "source": "苟不固聪明圣知，达天德者，其孰能知之？",
                "target": "如果不真是聪明智慧，通达天赋美德的人，还有谁能知道天下最高的真诚呢？"
            }
        ]
    },
    {
        "title": "第三十章",
        "contents": [
            {
                "source": "仲尼祖述尧舜，宪章文武。上律天时，下袭水土。",
                "target": "孔子继承尧舜的传统，以文王、武王为典范，上遵循天时运行的规律，下符合水土地理的环境。"
            },
            {
                "source": "辟如天地之无不持载，无不覆帱。辟如四时之错行，如日月之代明。",
                "target": "就像天地那样没有什么不能承载，没有什么不能覆盖。又好像四季的交错运行，日月交替光明。"
            },
            {
                "source": "万物并育而不相害。道并行而不相悖。小德川流；大德敦化。此天地之所以为大也。",
                "target": "万物一起生长而互不妨害，遵循各自的规律而互不冲突。小的德行如河水一样长流不息，大的德行使万物敦厚纯朴。这就是天地的伟大之处啊！"
            }
        ]
    },
    {
        "title": "第三章",
        "contents": [
            {
                "source": "子曰：“中庸其至矣乎！民鲜能久矣。”",
                "target": "孔子说：“中庸是最高的境界啊！很少有人能够长久的保持这种品质！”"
            }
        ]
    },
    {
        "title": "第九章",
        "contents": [
            {
                "source": "子曰：“天下国家，可均也；爵禄，可辞也；白刃，可蹈也；中庸不可能也。”",
                "target": "孔子说：“天下国家是可以平定治理好的，官爵俸禄是可以放弃的，雪白的刀刃可以踩过去，中庸之道却不是能够轻易做到的。”"
            }
        ]
    },
    {
        "title": "第二十一章",
        "contents": [
            {
                "source": "“自诚明，谓之性；自明诚，谓之教。诚则明矣；明则诚矣。”",
                "target": "由内心真诚而自然明白道理，就叫做天性；由明白存在的意义而做到真诚，这就叫教化。真诚就会通晓事理，通晓事理就会真诚。"
            }
        ]
    },
    {
        "title": "第二十七章",
        "contents": [
            {
                "source": "大哉圣人之道！",
                "target": "伟大啊，圣人的道！"
            },
            {
                "source": "洋洋乎，发育万物，峻极于天。",
                "target": "浩瀚无边，生养万物，与天一样崇高。"
            },
            {
                "source": "优优大哉，礼仪三百威仪三千。",
                "target": "充足而有余啊！礼仪有三百条，威仪有三千条。"
            },
            {
                "source": "待其人而後行。",
                "target": "这些都有待于圣人来实行。"
            },
            {
                "source": "故曰：“苟不至德，至道不凝焉。”",
                "target": "所以说，如果没有极高的德行，就不能成功极高的道。"
            },
            {
                "source": "故君子尊德性，而道问学，致广大，而尽精微，极高明，而道中庸。温故，而知新，敦厚以崇礼。",
                "target": "因此，君子尊崇道德修养而又注重知识学问，达到广博境界而又钻研精细之处，极端高明而又奉行中庸之道，温习已学过的知识从而获得新的见解，为人朴实厚道而又崇奉礼节。"
            },
            {
                "source": "是故居上不骄，为下不倍。国有道，其言足以兴；国无道，其默足以容。诗曰：“既明且哲，以保其身。”其此之谓与？",
                "target": "所以身居高位不骄傲，身居低位不自弃，国家政治清明时，他的言论足以振兴国家；国家政治黑暗时，他的沉默足以保全自己。《诗经》说：“既明智又通达事理，可以保全自身。”大概就是说的这个意思吧？"
            }
        ]
    },
    {
        "title": "第二十三章",
        "contents": [
            {
                "source": "其次致曲。曲能有诚。诚则形。形则著。著则明。明则动。动则变。变则化。唯天下至诚为能化。",
                "target": "比圣人差一些的贤人，在细微处下工夫，也能达到真诚的境界。达到真诚就会表现出来，表现出来就会逐渐显著，显著了就会发扬光大，发扬光大就会感动他人，感动他人就会引起转变，引起转变就能化育万物。只有天下最真诚的人能化育万物。"
            }
        ]
    },
    {
        "title": "第二十九章",
        "contents": [
            {
                "source": "王天下有三重焉，其寡过矣乎！",
                "target": "治理天下能够做好议订礼仪，制订法度，考订文字规范这三件重要的事，就可以减少过失了吧！"
            },
            {
                "source": "上焉者虽善，无征。无征，不信。不信，民弗从。",
                "target": "居于上位的人，虽然品行很好，但如果没有验证的活，就不能使人信服，不能使人信服，老百姓就不会听从。"
            },
            {
                "source": "下焉者虽善，不尊。不尊，不信。不信，民弗从。",
                "target": "居于下位的人，虽然品行很好，但由于没有尊贵的地位，也不能使人信服，不能使人信服，老百姓就不会听从。"
            },
            {
                "source": "故君子之道，本诸身，征诸庶民。",
                "target": "所以，所以君子治理天下，先修养自身的德行，并从老百姓那里得到验证。"
            },
            {
                "source": "考诸三王而不缪，建诸天地而不悖。",
                "target": "考查夏、商、周三代先王的做法而没有背谬，立于天地之间而没有悖理的地方。"
            },
            {
                "source": "质诸鬼神而无疑，百世以俟圣人而不惑。",
                "target": "质询于鬼神而没有可以的地方，百世以后待到圣人来验证也没有什么不理解的地方。"
            },
            {
                "source": "质诸鬼神而无疑，知天也。百世以俟圣人而不惑，知人也。",
                "target": "质询于鬼神而没有疑问，这是知道天理；百世以后侍到圣人出现也没有什么不理解的地方，这是知道人意。"
            },
            {
                "source": "是故君子动而世为天下道，行而世为天下法，言而世为天下则。远之，则有望；近之，则不厌。",
                "target": "所以君子的举动能世世代代成为天下的法则，君子的行为能世世代代成为天下的法度，君子的言谈能世世代代成为天下的准则。在远处有威望，在近处也不使人厌恶。"
            },
            {
                "source": "诗曰：“在彼无恶，在此无射；庶几夙夜，以永终誉。”君子未有不如此，而蚤有誉于天下者也。",
                "target": "《诗经》说，“在那里没有人憎恶，在这里没有人厌烦，日日夜夜操劳啊，为了保持美好的名望。”君于没有不这样做而能够早早在天下获得名望的。"
            }
        ]
    },
    {
        "title": "第二十二章",
        "contents": [
            {
                "source": "唯天下至诚，为能尽其性；能尽其性，则能尽人之性；能尽人之性，则能尽物之性；能尽物之性，则可以赞天地之化育；可以赞天地之化育，则可以与天地参矣。",
                "target": "只有天下最真诚的人，才能充分发挥他的本性；能充分发挥他的本性，就能充分发挥众人的本性；能充分发挥众人的本性，就能充分发挥万物的本性；能充分发挥万物的本性，就可以帮助天地培育生命；能帮助天地养育万物，就可以与天地并列了。"
            }
        ]
    },
    {
        "title": "第二十五章",
        "contents": [
            {
                "source": "诚者自成也，而道自道也。",
                "target": "真诚是人的自我完善，道是人自己引导自己。"
            },
            {
                "source": "诚者，物之终始，不诚无物。",
                "target": "真诚是事物的发端和归宿，没有真诚就没有了事物。"
            },
            {
                "source": "是故君子诚之为贵。",
                "target": "因此君子以真诚为贵。"
            },
            {
                "source": "诚者，非自成己而已也。",
                "target": "不过，真诚并不是自我完善就够了。"
            },
            {
                "source": "所以成物也。",
                "target": "而是还要完善事物。"
            },
            {
                "source": "成己仁也。成物知也。",
                "target": "自我完善是仁，完善事物是智。"
            },
            {
                "source": "性之德也，合外内之道也。",
                "target": "仁和智是出于本性的德行，是融合自身与外物的准则。"
            },
            {
                "source": "故时措之宜也。",
                "target": "所以任何时候施行都是适宜的。"
            }
        ]
    },
    {
        "title": "第二十八章",
        "contents": [
            {
                "source": "子曰：“愚而好自用，贱而好自专。生乎今之世，反古之道。如此者灾及其身者也。”",
                "target": "孔子说：“愚昧却喜欢自以为是，卑贱但又好独断专行。生活在当下的时代，却一心想要恢复古代的做法。这样做，灾祸一定会降临到自己的身上。”"
            },
            {
                "source": "非天子不议礼，不制度，不考文。",
                "target": "不是天子，就不要议订礼仪，不要制订法度，不要考订文字规范。"
            },
            {
                "source": "今天下，车同轨，书同文，行同伦。",
                "target": "现在普天下车辙统一，文字统一，伦理观念统一。"
            },
            {
                "source": "虽有其位，苟无其德，不敢作礼乐焉。虽有其德，苟无其位，亦不敢作礼乐焉。",
                "target": "虽有天子的地位，如果没有天子的德行，是不敢制作礼乐制度的；虽然有天子的德行，如果没有天子的地位，也是不敢制作礼乐制度的。"
            },
            {
                "source": "子曰：“吾说夏礼，杞不足徵也。吾学殷礼，有宋存焉。吾学周礼，今用之。吾从周。”",
                "target": "孔子说：“我谈论夏朝的礼制，夏的后裔杞国已不足以验证它；我学习殷朝的礼制，仅仅有宋国保持着它；我学习周朝的礼制，现在还实行着它，所以我遵从周礼。”"
            }
        ]
    },
    {
        "title": "第二十六章",
        "contents": [
            {
                "source": "故至诚无息。",
                "target": "所以，极端真诚是永不停止的。"
            },
            {
                "source": "不息则久，久则征。",
                "target": "永不停止就会保持长久，保持长久就会显露出来。"
            },
            {
                "source": "征则悠远。悠远，则博厚。博厚，则高明。",
                "target": "显露出来就会悠远，悠远就会广博深厚，广博深厚就会高大光明。"
            },
            {
                "source": "博厚，所以载物也。高明，所以覆物也。悠久，所以成物也。",
                "target": "广博深厚的作用是承载万物；高大光明的作用是覆盖万物；悠远长久的作用是生成万物。"
            },
            {
                "source": "博厚，配地。高明，配天。悠久，无疆。",
                "target": "广博深厚可以与地相比，高大光明可以与天相比，悠远长久则是永无止境。"
            },
            {
                "source": "如此者，不见而章，不动而变，无为而成。",
                "target": "达到这样的境界，不显示也会明显，不活动也会改变，无所作为也会有所成就。"
            },
            {
                "source": "天地之道，可一言而尽也。其为物不贰，则其生物不测。",
                "target": "天地的法则，简直可以用一个“诚”字来囊括：诚本身专一不二，所以生育万物多得不可估量。"
            },
            {
                "source": "天地之道，博也、厚也、高也、明也、悠也、久也。",
                "target": "大地的法则，就是广博、深厚、高大、光明、悠远、长久。"
            },
            {
                "source": "今夫天斯昭昭之多，及其无穷也，日月星辰系焉，万物覆焉。",
                "target": "今天我们所说的天，原本不过是由一点一点的光明聚积起来的，可等到它无边无际时，日月星辰都靠它维系，世界万物都靠它覆盖。"
            },
            {
                "source": "今夫地一撮土之多，及其广厚载华岳而不重，振河海而不洩，万物载焉。",
                "target": "今天我们所说的地，原本不过是由一撮土一撮土聚积起来的，可等到它广博深厚时，承载像华山那样的崇山峻岭也不觉得重，容纳那众多的江河湖海也不会泄漏，世间万物都由它承载了。"
            },
            {
                "source": "今夫山一卷石之多，及其广大，草木生之，禽兽居之，宝藏兴焉。",
                "target": "今天我们所说的山，原本不过是由拳头大的石块聚积起来的，可等到它高大无比时，草木在上面生长，禽兽在上面居住，宝藏在上面储藏。"
            },
            {
                "source": "今夫水，一勺之多，及其不测，鼋、鼍、蛟、龙、鱼、鳖生焉，货财殖焉。",
                "target": "今天我们所说的水，原本不过是一勺一勺聚积起来的，可等到它浩瀚无涯时，蛟龙鱼鳖等都在里面生长，珍珠珊瑚等值价的东西都在里面繁殖。"
            },
            {
                "source": "诗云，“维天之命，于穆不已。”",
                "target": "《诗经》上说：“只有上天的定命，深远不止。”"
            },
            {
                "source": "盖曰，天之所以为天也。",
                "target": "这大概是说天之所以成为天的原因。"
            },
            {
                "source": "“于乎不显，文王之德之纯。”",
                "target": "啊，难道不光明！文王的德行这么纯洁。"
            },
            {
                "source": "盖曰，文王之所以为文也。纯亦不已。",
                "target": "这大概是说文王之所以被尊奉为文王，是因为他纯一，而且永无止境。"
            }
        ]
    },
    {
        "title": "第二十四章",
        "contents": [
            {
                "source": "至诚之道可以前知。",
                "target": "最高境界的真诚可以预知未来的事。"
            },
            {
                "source": "国家将兴，必有祯祥；国家将亡，必有妖孽。",
                "target": "国家将要兴盛，必然有吉祥的征兆；国家将要衰亡，必然有不祥的反常现象。"
            },
            {
                "source": "见乎蓍龟，动乎四体。",
                "target": "它呈现在蓍草龟甲上，体现在身体仪态上。"
            },
            {
                "source": "祸福将至，善必先知之；不善，必先知之。",
                "target": "祸福将要来临时，是福可以预先知道，是祸也可以预先知道。"
            },
            {
                "source": "故至诚如神。",
                "target": "所以极端真诚就像神灵一样微妙。"
            }
        ]
    },
    {
        "title": "第二十章",
        "contents": [
            {
                "source": "哀公问政。",
                "target": "鲁哀公询问关于治理国家的道理。"
            },
            {
                "source": "子曰：文武之政，布在方策。其人存，则其政举；其人亡，则其政息。",
                "target": "孔子说：周文王、周武王的政事都记载在典籍上。他们在世，这些政事就实施；他们去世，这些政事也就废弛了。"
            },
            {
                "source": "人道敏政，地道敏树。夫政也者，蒲卢也。",
                "target": "以人立政，政治就会迅速清明，这就像用沃土植树，树木会迅速生长。"
            },
            {
                "source": "故为政在人。取人以身。修身以道。修道以仁。",
                "target": "说起来，这政事就像芦苇一样，完全取决于任用什么人。要得到适用的人在于修养自己，修养自己在于遵循大道，遵循大道要从仁义做起。"
            },
            {
                "source": "仁者，人也，亲亲为大。",
                "target": "仁就是爱人，亲爱亲族是最大的仁。"
            },
            {
                "source": "义者，宜也，尊贤为大。",
                "target": "义就是事事做得适宜，尊重贤人是最大的义。"
            },
            {
                "source": "亲亲之杀，尊贤之等，礼所生也。",
                "target": "至于说亲爱亲族要分亲疏，尊重贤人要有等级，这都是从礼制中产生出来的。"
            },
            {
                "source": "在下位，不获乎上，民不可得而治矣。",
                "target": "处在低位的人，如果得不到高位的人的信任，就不可能治理好普通百姓。"
            },
            {
                "source": "故君子，不可以不修身。思修身，不可以不事亲。思事亲，不可以不知人。思知人，不可以不知天。",
                "target": "所以，君子不能不注意修养自己。要修养自己，就不能不侍奉亲人；要侍奉亲人，就不能不了解他人；要了解他人，就不能不知道天理。"
            },
            {
                "source": "天下之达道五，所以行之者三，曰：君臣也、父子也、夫妇也、昆弟也、朋友之交也。五者，天下之达道也。知、仁、勇三者，天下之达德也。所以行之者一也。",
                "target": "普天下的大道有五种，实践大道的美德有三种。君臣、父子、夫妇、兄弟、朋友交往，这五项是天下的大道。智慧、仁爱、英勇这三者是天下的大德行。实践大道的道理是同样的。"
            },
            {
                "source": "或生而知之；或学而知之；或困而知之：及其知之，一也。或安而行之；或利而行之；或勉强而行之：及其成功，一也。”",
                "target": "比如说，有的人生来就知道它们，有的人通过学习才知道它们，有的人要遇到困难后才知道它们，但只要他们最终都知道了，也就是一样的了。又比如说，有的人自觉自愿地去实行它们，有的人为了某种好处才去实行它们，有的人勉勉强强地去实行，但只要他们最终都实行起来了，也就是一样的了。"
            },
            {
                "source": "子曰：“好学近乎知。力行近乎仁。知耻近乎勇。",
                "target": "孔子说，喜爱学习就接近智慧了，尽力去实行就接近仁爱了，知晓羞耻就接近勇了。"
            },
            {
                "source": "知斯三者，则知所以修身。知所以修身，则知所以治人。知所以治人，则知所以治天下国家矣。",
                "target": "知道这三点，就知道怎样修养自己，知道怎样修养自己，就知道怎样管理他人，知道怎样管理他人，就知道怎样治理天下和国家了。"
            },
            {
                "source": "凡为天下国家有九经，曰：修身也、尊贤也、亲亲也、敬大臣也、体群臣也、子庶民也、来百工也、柔远人也、怀诸侯也。",
                "target": "凡是治理天下，一般有九条原则，那就是：修养自身，尊重贤人，亲爱亲族，敬重大臣，体恤群臣，爱民如子，招纳工匠，善待远客，安抚诸侯。"
            },
            {
                "source": "修身，则道立。尊贤，则不惑。亲亲，则诸父昆弟不怨。",
                "target": "修养自身就能确立正道；尊重贤人就不会思想困惑；亲爱亲族就不会惹得叔伯兄弟怨恨。"
            },
            {
                "source": "敬大臣，则不眩。体群臣，则士之报礼重。子庶民，则百姓劝。来百工，则财用足。柔远人，则四方归之。怀诸侯，则天下畏之。",
                "target": "敬重大臣就不会遇事慌张；体恤群臣，士人们就会尽力报答；爱民如子，老百姓就会努力生产；招纳工匠，财物就会充足；优待远客，四方就会来归顺；安抚诸侯，天下就会敬服。"
            },
            {
                "source": "齐明盛服，非礼不动：所以修身也。",
                "target": "像斋戒那样净心虔诚，穿着庄重整齐的服装，不符合礼仪的事坚决不做，这是为了修养自身。"
            },
            {
                "source": "去谗远色，贱货而贵德，所以劝贤也。",
                "target": "驱除小人，疏远女色，看轻财物而重视德行，这是为了尊崇贤人。"
            },
            {
                "source": "尊其位，重其禄，同其好恶，所以劝亲亲也。",
                "target": "提高亲族的地位，给他们以丰厚的俸禄，与他们爱憎相一致，这是为了亲爱亲族。"
            },
            {
                "source": "官盛任使，所以劝大臣也。",
                "target": "让众多的官员供他们使用，这是为了敬重大臣。"
            },
            {
                "source": "忠信重禄，所以劝士也。",
                "target": "真心诚意地任用他们，并给他们以较多的俸禄，这是为了体恤群臣。"
            },
            {
                "source": "时使薄敛，所以劝百姓也。",
                "target": "使用民役不误农时，少收赋税，这是为了爱民如子。"
            },
            {
                "source": "日省月试，既禀称事，所以劝百工也。",
                "target": "经常视察考核，按劳付酬，这是为了招纳工匠。"
            },
            {
                "source": "送往迎来，嘉善而矜不能所以柔远人也。",
                "target": "来时欢迎，去时欢送，嘉奖有才能的人，救济有困难的人，这是为了优待远客。"
            },
            {
                "source": "继绝世，举废国，治乱持危，朝聘以时，厚往而薄来，所以怀诸侯也。",
                "target": "延续绝后的家族，复兴灭亡的国家，治理祸乱，扶持危难，按时接受朝见，赠送丰厚，纳贡菲薄，这是为了安抚诸侯。"
            },
            {
                "source": "凡为天下国家有九经，所以行之者一也。",
                "target": "总而言之，治理天下和国家有九条原则，但实行这些原则的道理都是一样的。"
            },
            {
                "source": "凡事，豫则立，不豫则废。言前定，则不跲。事前定，则不困。行前定，则不疚。道前定，则不穷。",
                "target": "任何事情，事先有预备就会成功，没有预备就会失败。说话先有预备，就不会中断；做事先有预备，就不会受挫；行为先有预备，就不会后悔；道路预先选定，就不会走投无路。"
            },
            {
                "source": "在下位不获乎上，民不可得而治矣。",
                "target": "在下位的人，如果得不到在上位的人信任，就不可能治理好平民百姓。"
            },
            {
                "source": "获乎上有道：不信乎朋友，不获乎上矣。",
                "target": "得到在上位的人信任有办法：得不到朋友的信任就得不到在上位的人信任。"
            },
            {
                "source": "信乎朋友有道：不顺乎亲，不信乎朋友矣。",
                "target": "得到朋友的信任有办法：不孝顺父母就得不到朋友的信任。"
            },
            {
                "source": "顺乎亲有道：反诸身不诚，不顺乎亲矣。",
                "target": "孝顺父母有办法：自己不真诚就不能孝顺父母。"
            },
            {
                "source": "诚身有道：不明乎善，不诚乎身矣。",
                "target": "使自己真诚有办法：不明白什么是善就不能够使自己真诚。"
            },
            {
                "source": "诚者，天之道也。诚之者，人之道也。诚者，不勉而中不思而得：从容中道，圣人也。诚之者，择善而固执之者也。",
                "target": "真诚是上天的原则，追求真诚是做人的原则。天生真诚的人，不用勉强就能做到，不用思考就能拥有，自然而然地符合上天的原则，这样的人是圣人。努力做到真诚，就要选择美好的目标执著追求："
            },
            {
                "source": "博学之，审问之，慎思之，明辨之，笃行之。",
                "target": "广泛学习，详细询问，周密思考，明确辨别，切实实行。"
            },
            {
                "source": "有弗学，学之弗能，弗措也。",
                "target": "要么不学，学了没有学会绝不罢休。"
            },
            {
                "source": "有弗问，问之弗知，弗措也。",
                "target": "要么不问，问了没有懂得绝不罢休。"
            },
            {
                "source": "有弗思，思之弗得，弗措也。",
                "target": "要么不想，想了没有想通绝不罢休。"
            },
            {
                "source": "有弗辨，辨之弗明，弗措也。",
                "target": "要么不分辨，分辨了没有明确绝不罢休。"
            },
            {
                "source": "有弗行，行之弗笃，弗措也。",
                "target": "要么不实行，实行了没有成效绝不罢休。"
            },
            {
                "source": "人一能之，己百之。",
                "target": "别人用一分努力就能做到的，我用一百分的努力去做。"
            },
            {
                "source": "人十能之，己千之。",
                "target": "别人用十分的努力做到的，我用一千分的努力去做。"
            },
            {
                "source": "果能此道矣，虽愚必明，虽柔必强。",
                "target": "如果真能够做到这样，虽然愚笨也一定可以聪明起来，虽然柔弱也一定可以刚强起来。"
            }
        ]
    },
    {
        "title": "第二章",
        "contents": [
            {
                "source": "仲尼曰：“君子中庸；小人反中庸。”",
                "target": "仲尼说：“君子遵循中庸之道为人处世，小人对人对事往往违背中庸的准则。”"
            },
            {
                "source": "“君子之中庸也，君子而时中。小人之反中庸也，小人而无忌惮也。”",
                "target": "“君子的言行符合中庸，是因为君子能随时根据不同的情况，恰到好处地把握中正的原则，行事处世有度；小人之所以背离中庸，是因为他们不能约束自己的言行，主观武断，没有准则，无所顾忌。”"
            }
        ]
    },
    {
        "title": "第五章",
        "contents": [
            {
                "source": "子曰：“道其不行矣夫。”",
                "target": "孔子说：“中庸之道恐怕是不能施行了。”"
            }
        ]
    }
]