[
    {
        "title": "第八章",
        "contents": [
            {
                "source": "子曰：“回之为人也：择乎中庸，得一善，则拳拳服膺，而弗失之矣。”",
                "target": "孔子说：“颜回就是这样一个人，他选择了中庸之道，得到了它的好处，就牢牢地把它放在心上，再也不让它失去。”"
            }
        ]
    },
    {
        "title": "第六章",
        "contents": [
            {
                "source": "子曰：“舜其大知也与！舜好问而好察迩言。隐恶而扬善。执其两端，用其中于民。其斯以为舜乎！”",
                "target": "孔子说：“舜是真正具有大智慧的人啊！他喜欢向别人请教问题，又善于分析别人浅近话语里的含义。隐藏互相诋毁的诽谤言语，赞扬他人的善行。过与不及两端的意见他都掌握，再采纳适中的用于老百姓。这就是舜之所以为舜的地方吧！”"
            }
        ]
    },
    {
        "title": "第十一章",
        "contents": [
            {
                "source": "子曰：素隐行怪，后世有述焉：吾弗为之矣。",
                "target": "孔子说：追求生僻的道理，做些怪诞的事情来欺世盗名，后世也许会有人来记述他，为他立传，但我是绝不会这样做的。"
            },
            {
                "source": "君子遵道而行，半途而废：吾弗能已矣。",
                "target": "德行高尚的人遵循中庸之道去做事，但是半途而废，不能坚持下去，而我是绝不会停止的。"
            },
            {
                "source": "君子依乎中庸，遯世不见知，而不悔。唯圣者能之。",
                "target": "真正的君子遵循中庸之道，即使一生默默无闻不被人知道也不后悔，这只有圣人才能做得到。"
            }
        ]
    },
    {
        "title": "第十七章",
        "contents": [
            {
                "source": "子曰：舜其大孝也与！德为圣人，尊为天子，富有四海之内。宗庙飨之，子孙保之。”",
                "target": "孔子说：舜大概是最孝敬的人了。德行上是圣人，地位上是尊贵的天子，财富上拥有整个天下，宗庙里祭祀他，子子孙孙都继承他的功业。"
            },
            {
                "source": "故大德，必得其位，必得其禄，必得其名，必得其寿。",
                "target": "所以，有高尚德行的人必会得到相应的地位，必定会得到相应的财富，必定得到他应有的名望，必然长寿。"
            },
            {
                "source": "故天之生物必因其材而笃焉。故栽者培之，倾者覆之。",
                "target": "所以，上天生养万物，必定根据它们的资质而厚待它们。能成材的得到培育，不能成材的就遭到淘汰。"
            },
            {
                "source": "诗曰：‘嘉乐君子，宪宪令德，宜民宜人。受禄于天。保佑命之，自天申之。’",
                "target": "《诗经》说：‘高尚优雅的君子，有光明美好的德行，让人民安居乐业，享受上天赐予的福禄。上天保佑他、任用他，这是上天的意志啊。’"
            },
            {
                "source": "故大德者必受命。",
                "target": "所以，有高尚德行的人必定会承受天命。"
            }
        ]
    },
    {
        "title": "第十三章",
        "contents": [
            {
                "source": "子曰：道不远人。人之为道而远人，不可以为道。",
                "target": "孔子说：中庸之道并不会远离人。如果有人实行中庸之道却远离他人，那就无法实行中庸之道。"
            },
            {
                "source": "诗云：‘伐柯伐柯，其则不远。’执柯以伐柯，睨而视之。犹以为远。故君子以人治人，改而止。",
                "target": "《诗经》说：‘砍削斧柄，砍削斧柄，斧柄的式样就在眼前。’拿着斧子去砍树做斧把，准备照着旧斧把的样子做新斧把，但是斜着眼睛看上去，斧把的样子好像还是离得很远。所以，君子总是根据不同人的情况采取不同的办法治理，只要他能改正错误实行道就行。"
            },
            {
                "source": "忠恕违道不远。施诸己而不愿，亦勿施于人。",
                "target": "忠恕与道不远，不愿施于己身的，也不要施与别人。"
            },
            {
                "source": "君子之道四，丘未能一焉：所求乎子，以事父，未能也；所求乎臣，以事君，未能也；所求乎弟，以事兄，未能也；所求乎朋友，先施之，未能也。庸德之行，庸言之谨；有所不足，不敢不勉；有余，不敢尽。言顾行，行顾言。君子胡不慥慥尔。”",
                "target": "君子的道有四项，我孔丘连其中的一项也没有能够做到：子女应该孝敬父母，我没能做到；臣民应该忠于国君，我没能做到；弟弟应该尊敬哥哥，我没有能够做到；朋友应该有信用的，我没有能够做到。平常的德行努力实践，平常的言谈尽量谨慎。德行的实践有不足的地方，不敢不勉励自己努力；言谈却不敢放肆而无所顾忌。说话符合自己的行为，行为符合自己说过的话，这样的君子怎么会不忠厚诚实呢？"
            }
        ]
    },
    {
        "title": "第十九章",
        "contents": [
            {
                "source": "子曰：武王、周公，其达孝矣乎。",
                "target": "孔子说：武王，周公真是最守孝道的人了！"
            },
            {
                "source": "夫孝者，善继人之志，善述人之事者也。",
                "target": "所谓的孝者，就是善于继承先人的遗志，善于继续先人未完成的事业。"
            },
            {
                "source": "春秋，修其祖庙，陈其宗器，设其裳衣，荐其时食。",
                "target": "在春秋两季祭祀的时节，整修祖宗庙宇，陈列祭祀器具，摆设先王遗留下来的衣裳，进献祭祀的鲜美食物。"
            },
            {
                "source": "宗庙之礼，所以序昭穆也。",
                "target": "宗庙祭祀的礼制，是要排列父子、长幼的顺序。"
            },
            {
                "source": "序爵，所以辨贵贱也。",
                "target": "按官爵排列次序，就可以分辨出贵贱。"
            },
            {
                "source": "序事，所以辨贤也。",
                "target": "按职位排列次序，就能分辨出贤与不贤。"
            },
            {
                "source": "旅酬下为上，所以逮贱也。",
                "target": "敬酒时晚辈先向长辈举杯，这样祖先的恩惠就会延及到晚辈。"
            },
            {
                "source": "燕毛所以序齿也。",
                "target": "宴饮时按头发的黑白次序坐，这样就使老少有次序。"
            },
            {
                "source": "践其位，行其礼，奏其乐，敬其所尊，爱其所亲，事死如事生，事亡如事存，孝之至也。",
                "target": "站到自己的位置上，进行应有礼节，奏起那音乐，恭敬那所尊重的，敬爱那所亲爱的，事俸死者如同事俸生者一样，事俸亡者如同事俸生存的一样，这是最高的孝了。"
            },
            {
                "source": "郊社之礼，所以事上帝也。宗庙之礼，所以祀乎其先也。",
                "target": "郊祭与社祭的礼节，用以事俸先帝，宗庙的祭礼，用以祭祀祖先。"
            },
            {
                "source": "明乎郊社之礼，禘尝之义，治国其如示诸掌乎。",
                "target": "明白郊、社这两种祭礼以及禘与尝的义理，治理国家就如同展示这手掌一样容易了。"
            }
        ]
    },
    {
        "title": "第十二章",
        "contents": [
            {
                "source": "君子之道，费而隐。",
                "target": "君子所遵循的道广大而又精微。"
            },
            {
                "source": "夫妇之愚，可以与知焉，及其至也，虽圣人亦有所不知焉。",
                "target": "普通男女虽然愚昧，也可以知道君子的道，但最高境界的道，即便是圣人也有不清楚的地方。"
            },
            {
                "source": "夫妇之不肖，可以能行焉，及其至也，虽圣人亦有所不能焉。",
                "target": "普通男女虽然不贤明，也可以实行君子的道，但最高境界的道，即便是圣人也有做不到的地方。"
            },
            {
                "source": "天地之大也，人犹有所憾。",
                "target": "天地如此之大，但人们仍有不满足的地方。"
            },
            {
                "source": "故君子语大，天下莫能载焉，语小，天下莫能破焉。",
                "target": "所以，君子说到“大”，就大得连整个天下都载不下；君子说到“小”，就小得连一点儿也分不开。"
            },
            {
                "source": "诗云：“鸢飞戾天；鱼跃于渊。”言其上下察也。",
                "target": "《诗经》说：“鸢鸟飞向天空，鱼儿跳跃深水。”这是说君子的中庸之道在天地上下之间都是显豁的。"
            },
            {
                "source": "君子之道，造端乎夫妇；及其至也，察乎天地。",
                "target": "君子所遵循的道，开始于普通男女，但它的最高深境界却昭著于整个天地之间。"
            }
        ]
    },
    {
        "title": "第十五章",
        "contents": [
            {
                "source": "君子之道，辟如行远必自迩，辟如登高必自卑。",
                "target": "君子施行中庸之道，就像走远路一样，必定要从近处开始；就像登高山一样，必定要从低处起步。"
            },
            {
                "source": "诗曰：“妻子好合，如鼓瑟琴。兄弟既翕，和乐且耽。宜尔室家，乐尔妻帑。”",
                "target": "《诗经》说：“妻子儿女感情和睦，协调有如琴瑟。兄弟关系融洽，和顺又快乐。使你的家庭美满，使你的妻儿幸福。”"
            },
            {
                "source": "子曰：“父母其顺矣乎。”",
                "target": "孔子赞叹说：“这样，父母也就称心如意了啊！”"
            }
        ]
    },
    {
        "title": "第十八章",
        "contents": [
            {
                "source": "子曰：无忧者，其惟文王乎。",
                "target": "孔子说：古代帝王中无忧无虑的，大概只有周文王吧！"
            },
            {
                "source": "以王季为父，以武王为子。",
                "target": "王季是他的父亲，周武王是他的儿子。"
            },
            {
                "source": "父作之，子述之。",
                "target": "父亲王季为他开创了事业，儿子武王继承了他的遗愿。"
            },
            {
                "source": "武王缵太王、王季、文王之绪。",
                "target": "武王继续着曾祖太王、祖父王季、父亲文王未完成的大业。"
            },
            {
                "source": "壹戎衣，而有天下。身不失天下之显名。",
                "target": "灭掉了大殷，夺得了天下。他没有失去自己显赫的名声。"
            },
            {
                "source": "尊为天子。富有四海之内。",
                "target": "获得了天子的尊贵，获得了天下四海财富。"
            },
            {
                "source": "宗庙飨之。子孙保之。",
                "target": "后代在宗庙里祭祀他，子子孙孙永不断绝。"
            },
            {
                "source": "武王末受命，周公成文武之德。",
                "target": "周武王晚年受命于天平定天下，周公成就文王武王的德行。"
            },
            {
                "source": "追王太王、王季，上祀先公以天子之礼。",
                "target": "追尊太王、王季为王，用天子的祭祀祭祖先。"
            },
            {
                "source": "斯礼也，达乎诸侯大夫，及士庶人。",
                "target": "这种制度一直实行到诸侯、大夫、士以及庶人之中。"
            },
            {
                "source": "父为大夫，子为士；葬以大夫，祭以士。",
                "target": "如果父亲是大夫，儿子是士，就用大夫的礼安葬，用士的礼祭祀。"
            },
            {
                "source": "父为士，子为大夫；葬以士，祭以大夫。",
                "target": "如果父亲是士，儿子是大夫，就用士的礼节安葬，用大夫之礼祭祀。"
            },
            {
                "source": "期之丧，达乎大夫；三年之丧，达乎天子；父母之丧，无贵贱，一也。",
                "target": "为旁亲服一年齐衰丧，这种制度实行到大夫；为父母服三年斩衰丧，这种制度实行到天子；为父母服丧不分贵贱都是一样的。"
            }
        ]
    },
    {
        "title": "第十六章",
        "contents": [
            {
                "source": "子曰：“鬼神之为德，其盛矣乎。”",
                "target": "孔子说：“鬼神的德行可真是大得很啊！”"
            },
            {
                "source": "视之而弗见；听之而弗闻；体物而不可遗。",
                "target": "看它也看不见，听它听不到，但它却体现在万物之中，没有一种事物能够离开它。"
            },
            {
                "source": "使天下之人，齐明盛服，以承祭祀。洋洋乎，如在其上，如在其左右。",
                "target": "天下的人都斋戒沐浴，穿上庄重整齐的服装去敬奉祭祀它。浩浩荡荡，鬼神好像飘浮在人们的头上，又仿佛流动在人们的身旁。"
            },
            {
                "source": "诗曰：‘神之格思，不可度思，矧可射思？’",
                "target": "《诗经》说：‘鬼神的降临，不可揣测，怎么能够怠慢不敬呢？’"
            },
            {
                "source": "夫微之显。诚之不可揜，如此夫。”",
                "target": "鬼神既看不见又听不到，十分隐微，而善于赐福降祸，又非常明显，真实的东西是不可掩盖的，就像鬼神一样啊！"
            }
        ]
    },
    {
        "title": "第十四章",
        "contents": [
            {
                "source": "君子素其位而行，不愿乎其外。",
                "target": "君子安于现在所处的地位去做应做的事，不对地位以外的名利存非分之想。"
            },
            {
                "source": "素富贵，行乎富贵；素贫贱，行乎贫贱；素夷狄，行乎夷狄；素患难，行乎患难。",
                "target": "处于富贵的地位，就做富贵人应做的事；处于贫贱的状况，就做贫贱人应做的事；处于边远地区，就做在边远地区应做的事；处于患难之中，就做在患难之中应做的事。"
            },
            {
                "source": "君子无入而不自得焉。",
                "target": "君子无论处于什么情况下都是安然自得的。"
            },
            {
                "source": "在上位，不陵下；在下位，不援上；正己而不求于人则无怨。",
                "target": "处于上位，不欺侮在下位的人；处于下位，不攀援在上位的人。端正自己而不苛求别人，这样就不会有什么抱怨了。"
            },
            {
                "source": "上不怨天，下不尤人。",
                "target": "上不抱怨天，下不抱怨人。"
            },
            {
                "source": "故君子居易以俟命，小人行险以徼幸。",
                "target": "所以，君子安居现状来等待天命，小人却铤而走险妄图获得非分的东西。"
            },
            {
                "source": "子曰：“射有似乎君子。失诸正鹄，反求诸其身。”",
                "target": "孔子说：“君子为人处世就像射箭一样，射不中，不怪靶子不正，只怪自己箭术不行。”"
            }
        ]
    },
    {
        "title": "第十章",
        "contents": [
            {
                "source": "子路问强。",
                "target": "子路问什么是强。"
            },
            {
                "source": "子曰：南方之强与，北方之强与，抑而强与？",
                "target": "孔子说：“是南方的强？北方的强？还是你自己所认为的强呢？”"
            },
            {
                "source": "宽柔以教，不报无道，南方之强也。君子居之。",
                "target": "用宽容柔和的精神去教育人，人家对我蛮横无礼也不报复，这是南方的强，品德高尚的人就具备有这种强。"
            },
            {
                "source": "衽金革，死而不厌，北方之强也。而强者居之。",
                "target": "用兵器甲盾当枕席，死了也不后悔，这是北方的强，勇武好斗的人就具有这种强。"
            },
            {
                "source": "故君子和而不流；强哉矫。",
                "target": "所以，品德高尚的人和顺而不随波逐流，这才是真强啊！"
            },
            {
                "source": "中立而不倚；强哉矫。",
                "target": "保持自己中和之道而不随意偏向任何一方，这才是真强啊！"
            },
            {
                "source": "国有道，不变塞焉；强哉矫。",
                "target": "国家政治清平时不改变志向，这才是真强啊！"
            },
            {
                "source": "国无道，至死不变；强哉矫。",
                "target": "国家政治黑暗时坚持操守，宁死不变，这才是真强啊！"
            }
        ]
    },
    {
        "title": "第四章",
        "contents": [
            {
                "source": "子曰：“道之不行也，我知之矣：知者过之；愚者不及也。道之不明也，我知之矣：贤者过之；不肖者不及也。”",
                "target": "孔子说：“中庸之道不能施行的原因，我是知道的：聪明的人自以为是，认识过了头；愚蠢的人智力不及，不能理解它。中庸之道不能弘扬的原因，我也知道了：贤能的人做得太过分；没有才能的人根本做不到。”"
            },
            {
                "source": "“人莫不饮食也。鲜能知味也。”",
                "target": "“就像没有不吃饭的人，但能够真正品尝出滋味的却很少。”"
            }
        ]
    }
]