[
    {
        "title": "为政篇",
        "contents": [
            {
                "source": "子曰：“为政以德，譬如北辰，居其所而众星共之。”",
                "target": "孔子说：“用道德来统治国家的人，就会像北极星一样处在一定的位置，所有的星辰都会环绕在它的周围。”"
            },
            {
                "source": "子曰：“《诗》三百，一言以蔽之，曰：‘思无邪’。”",
                "target": "孔子说：“《诗经》三百篇，可以用一句话来概括它，就是‘思想纯正’。”"
            },
            {
                "source": "子曰：“道之以政，齐之以刑，民免而无耻。道之以德，齐之以礼，有耻且格。”",
                "target": "孔子说：“用强权手段、法制禁令来管理百姓，使用刑法来约束他们，老百姓只能免于犯罪受惩罚，却没有了廉耻之心；用道德引导百姓，用礼制去统一百姓的言行，不但懂得廉洁是非，而且从心里归服。”"
            },
            {
                "source": "子曰：“吾十有五而志于学，三十而立，四十而不惑，五十而知天命，六十而耳顺，七十而从心所欲，不逾矩。”",
                "target": "孔子说：“我十五岁立志于学习；三十岁就有了自己的德行和做人的原则；四十岁遇到事情不再感到困惑；五十岁就知道哪些是不能为人力支配的事情而乐知天命；六十岁能正确对待各种言论，不觉得不能接受；七十岁能随心所欲而不越出规矩。”"
            },
            {
                "source": "孟懿子问孝，子曰：“无违。”",
                "target": "孟懿子问什么是孝，孔子说：“孝就是不要违背礼。”"
            },
            {
                "source": "樊迟御，子告之曰：“孟孙问孝于我，我对曰‘无违’。”",
                "target": "不久，樊迟替孔子驾车，孔子告诉他说：“孟孙问我什么是孝道，我回答他说不要违背礼。”"
            },
            {
                "source": "樊迟曰：“何谓也？”",
                "target": "樊迟说：“这是什么意思呢？”"
            },
            {
                "source": "子曰：“生，事之以礼；死，葬之以礼，祭之以礼。”",
                "target": "孔子说：“父母活着的时候，要依照规定的礼节侍奉他们；父母去世后，依规定的礼节安葬他们，祭祀他们。”"
            },
            {
                "source": "孟武伯问孝。子曰：“父母唯其疾之忧。”",
                "target": "孟武伯问什么是孝。孔子说：“父母只用为儿女的身体健康担忧，而不用担忧其他方面。”"
            },
            {
                "source": "子游问孝。子曰：“今之孝者，是谓能养。至于犬马皆能有养；不敬，何以别乎？”",
                "target": "子游问什么是孝。孔子说：“当今许多人认为的孝呀，就是能够赡养父母便足够了。其实狗和马，也都有人饲养。如果对自己的父母不恭敬孝顺，那么赡养父母与饲养犬马又有什么区别呢？”"
            },
            {
                "source": "子夏问孝。子曰：“色难。有事，弟子服其劳；有酒食，先生馔，曾是以为孝乎？”",
                "target": "子夏问什么是孝。孔子说：“侍奉父母时，最不容易的就是对父母和颜悦色。有了事情，儿女替父母去做，有了可口的饭菜，让父母吃，难道能认为这样就可以算是孝了吗？”"
            },
            {
                "source": "子曰：“吾与回言终日，不违，如愚。退而省其私，亦足以发，回也不愚。”",
                "target": "孔子说：“我给颜回授课，一整天下来他都不提任何反对意见和疑问，像个愚钝的人。等他回去后，我观察他私下里同别人讨论时，却能发挥我所讲的，可见颜回他并不愚笨呀！”"
            },
            {
                "source": "子曰：“视其所以，观其所由，察其所安，人焉廋哉？人焉廋哉？”",
                "target": "孔子说：“看一个人的所作所为，应看他言行的动机，观察他所走的道路，了解他心安于什么事情。这样，这个人怎样能隐藏得了呢？这个人怎样能隐藏得了呢？”"
            },
            {
                "source": "子曰：“温故而知新，可以为师矣。”",
                "target": "孔子说：“温习学过的知识，可以从中获得新的理解与体会，那么就可以凭借这一点去做老师了。”"
            },
            {
                "source": "子曰：“君子不器。”",
                "target": "孔子说：“君子不像器具那样，只有一种用途。”"
            },
            {
                "source": "子贡问君子。子曰：“先行其言而后从之。”",
                "target": "子贡问怎样做一个君子。孔子说：“应该先行动实践自己想要说的话，做到后再把它说出来。”"
            },
            {
                "source": "子曰：“君子周而不比，小人比而不周。”",
                "target": "孔子说：“君子团结众人却不与人勾结，品格卑劣的人则是互相勾结。”"
            },
            {
                "source": "子曰：“学而不思则罔，思而不学则殆。”",
                "target": "孔子说：“只是学习却不思考就会望文生义，迷惑而无所得，只是思考却不学习就会精神疲倦而无所得。”"
            },
            {
                "source": "子曰：“攻乎异端，斯害也已！”",
                "target": "孔子说：“批判不正确的言论，祸害就可以消灭。”"
            },
            {
                "source": "子曰：“由，诲女，知之乎！知之为知之，不知为不知，是知也。”",
                "target": "孔子说：“仲由啊，让为师教导你对待知与不知的态度吧！知道就是知道，不知道就是不知道，这才是聪明的。”"
            },
            {
                "source": "子张学干禄。子曰：“多闻阙疑，慎言其余，则寡尤；多见阙殆，慎行其余，则寡悔。言寡尤，行寡悔，禄在其中矣。”",
                "target": "子张要学谋取官职的办法。孔子说：“要多听，不明白的地方先放在一旁不说，对于真正懂得的，也要谨慎地说出来，这样就能少犯错误；要多看，有疑惑的先放在一旁不做，对于真正懂的，也要谨慎地去做，这样就能减少事后懊悔。说话很少犯错，做事很少后悔，自然就有官职俸禄了。”"
            },
            {
                "source": "哀公问曰：“何为则民服？”孔子对曰：“举直错诸枉，则民服；举枉错诸直，则民不服。”",
                "target": "鲁哀公问：“用什么方法才能让老百姓服从呢？”孔子回答说：“提拔那些正直的人，让他们居于不正直的人之上，老百姓就会服从了；把不正直的人提拔上来，让他们居于正直的人之上，老百姓就不会服从统治了。”"
            },
            {
                "source": "季康子问：“使民敬、忠以劝，如之何？”",
                "target": "季康子问道：“要让老百姓恭敬、尽忠并互相勉励，应该怎么做呢？”"
            },
            {
                "source": "子曰：“临之以庄，则敬；孝慈，则忠；举善而教不能，则劝。”",
                "target": "孔子说：“如果你用庄重的态度对待他们，他们就会恭敬；如果你能孝顺父母、爱护幼小，他们就会忠诚；如果你能任用贤能之士，教育能力低下的人，他们就会互相勉励。”"
            },
            {
                "source": "或谓孔子曰：“子奚不为政？”",
                "target": "有人对孔子说：“你为什么不去从政呢？”"
            },
            {
                "source": "子曰：“《书》云：‘孝乎惟孝，友于兄弟，施于有政。’是亦为政，奚其为为政？”",
                "target": "孔子回答说：“《尚书》上说，‘孝就是孝敬父母，友爱兄弟。’把这孝悌的道理施于政事，也就是参与政事了，你以为要怎样才能算是参与政事呢？”"
            },
            {
                "source": "子曰：“人而无信，不知其可也。大车无輗，小车无軏，其何以行之哉？”",
                "target": "孔子说：“一个人如果不讲信用，不知道他还能做什么。就好像牛车没有大车辕和车辕前横木相接的关键，马车没有辕前横木两端的木销，它还怎么行驶呢？”"
            },
            {
                "source": "子张问：“十世可知也？”",
                "target": "子张问孔子：“今后十世的礼仪制度可以预知吗？”"
            },
            {
                "source": "子曰：“殷因于夏礼，所损益，可知也；周因于殷礼，所损益，可知也。其或继周者，虽百世，可知也。”",
                "target": "孔子回答说：“商朝承袭了夏朝的礼仪制度，其中减少和所增加的内容是可以知道的；周朝又承袭了商朝的礼仪制度，其中减少和所增加的内容也是可以知道的。以后如果有继承周朝的朝代，就是一百世以后的情况，也是可以预先知道的。”"
            },
            {
                "source": "子曰：“非其鬼而祭之，谄也；见义不为，无勇也。”",
                "target": "孔子说：“不是你应该祭祀的鬼神，你去祭它，就是谄媚。见到应该挺身而出的事情，却袖手旁观，就是怯懦。”"
            }
        ]
    },
    {
        "title": "乡党篇",
        "contents": [
            {
                "source": "孔子于乡党，恂恂如也，似不能言者；其在宗庙朝庭，便便言，唯谨尔。",
                "target": "孔子在家乡时，非常恭顺温和，好似不会说话的样子。但他在宗庙里、朝廷上，说话却明白畅达，只是说得很谨慎。"
            },
            {
                "source": "朝，与下大夫言，侃侃如也；与上大夫言，訚訚如也。",
                "target": "上朝的时候，国君还没有到来，孔子同下大夫说话，温和而快乐；同上大夫说话，正直而恭敬；"
            },
            {
                "source": "君在，踧踖如也，与与如也。",
                "target": "国君已经来了，恭敬而心中不安，但是仪态又安祥适度。"
            },
            {
                "source": "君召使摈，色勃如也，足躩如也。",
                "target": "国君召孔子去接待宾客，他的面色庄重矜持，步伐轻快。"
            },
            {
                "source": "揖所与立，左右手，衣前后襜如也。",
                "target": "向同他站在一起的人作揖，向左向右拱手，衣裳随之前后摆动，却显得整齐。"
            },
            {
                "source": "趋进，翼如也。",
                "target": "快步向前时，好像鸟儿舒展开了翅膀。"
            },
            {
                "source": "宾退，必复命曰：“宾不顾矣。”",
                "target": "宾客告退了，他一定向君王回报说：“客人已经不回头了。”"
            },
            {
                "source": "入公门，鞠躬如也，如不容。",
                "target": "孔子走进朝堂的大门，显出小心谨慎的样子，好像没有容身之地。"
            },
            {
                "source": "立不中门，行不履阈。",
                "target": "他不站在门的中间，进门时不踩门坎。"
            },
            {
                "source": "过位，色勃如也，足躩如也，其言似不足者。",
                "target": "经过国君的座位时，脸色变得庄重起来，脚步也快起来，说话的声音低微得像气力不足似的。"
            },
            {
                "source": "摄齐升堂，鞠躬如也，屏气似不息者。",
                "target": "他提起衣服的下摆走上堂去，显得小心谨慎，憋住气，好像不呼吸一样。"
            },
            {
                "source": "出，降一等，逞颜色，怡怡如也；没阶，趋进，翼如也；复其位，踧踖如也。",
                "target": "走出来，下了一级台阶，面色舒展，怡然和乐。走完了台阶，快步向前，姿态好像鸟儿展翅一样。回到自己的位置，又是恭敬而谨慎的样子。"
            },
            {
                "source": "执圭，鞠躬如也，如不胜。",
                "target": "孔子出使别的诸侯国，行聘问礼时拿着圭，恭敬谨慎，像是拿不动的样子。"
            },
            {
                "source": "上如揖，下如授。",
                "target": "向上举时好像在作揖，向下放圭时好像在交给别人。"
            },
            {
                "source": "勃如战色，足蹜蹜如有循。",
                "target": "神色庄重，战战兢兢；脚步紧凑，好像在沿着一条线行走。"
            },
            {
                "source": "享礼，有容色。私觌，愉愉如也。",
                "target": "在举行赠送礼物的仪式时，显得和颜悦色。和国君举行私下会见的时候，更轻松愉快了。"
            },
            {
                "source": "君子不以绀緅饰，红紫不以为亵服。",
                "target": "君子不用青中透红或黑中透红的布做镶边，红色和紫色不用来做平常家居的便服。"
            },
            {
                "source": "当暑袗絺绤，必表而出之。",
                "target": "暑天，穿细葛布或粗葛布做的单衣，一定是套在外面。"
            },
            {
                "source": "缁衣羔裘，素衣麑裘，黄衣狐裘。",
                "target": "黑色的衣配羔羊皮袍，白色的衣配小鹿皮袍，黄色的衣配狐皮袍。"
            },
            {
                "source": "亵裘长，短右袂。",
                "target": "居家穿的皮袄比较长，可是右边的袖子要短一些。"
            },
            {
                "source": "必有寝衣，长一身有半。",
                "target": "睡觉一定要有小被，长度是人身长的一倍半。"
            },
            {
                "source": "狐貉之厚以居。",
                "target": "用厚厚的狐貉皮做坐垫。"
            },
            {
                "source": "去丧，无所不佩。非帷裳，必杀之。",
                "target": "服丧期满之后，任何饰物都可以佩带。不是上朝和祭祀时穿的礼服，一定要经过裁剪。"
            },
            {
                "source": "羔裘玄冠不以吊。吉月，必朝服而朝。",
                "target": "羊羔皮袍和黑色礼帽都不能穿戴着去吊丧。每月初一，一定要穿着上朝的礼服去朝贺。"
            },
            {
                "source": "齐，必有明衣，布。齐必变食，居必迁坐。",
                "target": "斋戒沐浴的时候，一定要有浴衣，用布做的。斋戒的时候，一定要改变平常的饮食，居住也一定搬移地方，（不与妻妾同房）。"
            },
            {
                "source": "食不厌精，脍不厌细。",
                "target": "粮食不嫌舂得精，鱼和肉不嫌切得细。"
            },
            {
                "source": "食饐而餲，鱼馁而肉败，不食.",
                "target": "粮食霉烂发臭，鱼和肉腐烂，都不吃。"
            },
            {
                "source": "色恶，不食；臭恶，不食；失饪，不食；不时，不食；割不正，不食；不得其酱，不食。",
                "target": "食物颜色难看，不吃。气味难闻，不吃。烹调不当，不吃。不到该当吃食时候，不吃。不是按一定方法砍割的肉，不吃。佐料放得不适当，不吃。"
            },
            {
                "source": "肉虽多，不使胜食气。",
                "target": "席上的肉虽多，但吃的量不超过米面的量。"
            },
            {
                "source": "唯酒无量，不及乱。",
                "target": "只有酒没有限制，但不喝醉。"
            },
            {
                "source": "沽酒市脯，不食。",
                "target": "从市上买来的肉干和酒，不吃。"
            },
            {
                "source": "不撤姜食，不多食。",
                "target": "每餐必须有姜，但也不多吃。"
            },
            {
                "source": "祭于公，不宿肉。祭肉不出三日，出三日不食之矣。",
                "target": "参加国家祭祀典礼，分到的祭肉当天就食用不放过夜。一般祭肉的留存不超过三天。放超过了三天，就不吃了。"
            },
            {
                "source": "食不语，寝不言。",
                "target": "嘴里吃着东西的时候不说话，到了该睡觉的时候就不要发出声音吵到他人。"
            },
            {
                "source": "虽疏食菜羹，瓜祭，必齐如也。",
                "target": "虽然是粗米饭蔬菜汤，饭前也要取一些出来祭祖，而且祭的时候还一定恭恭敬敬，好像斋戒了的一样。"
            },
            {
                "source": "席不正，不坐。",
                "target": "铺在地面上席子放得不端正，不坐。"
            },
            {
                "source": "乡人饮酒，杖者出，斯出矣。",
                "target": "同本乡人在一块儿饮酒，等老年人都出去了，自己这才出去。"
            },
            {
                "source": "乡人傩，朝服而立于阼阶。",
                "target": "乡里人举行迎神驱疫的仪式时，孔子穿着朝服站在东边的台阶上。"
            },
            {
                "source": "问人于他邦，再拜而送之。",
                "target": "孔子托人向住在其他诸侯国的朋友问候时，便向受托者拜两次送行。"
            },
            {
                "source": "康子馈药，拜而受之。曰：“丘未达，不敢尝。”",
                "target": "季康子给孔子赠送药品，孔子拜谢之后接受了，说：“我对这种药的药性不了解，不敢尝用试服。”"
            },
            {
                "source": "厩焚，子退朝，曰：“伤人乎？”不问马。",
                "target": "马棚失火烧掉了，孔子退朝回来，说：“伤到人了吗？”不问马的情况怎么样。"
            },
            {
                "source": "君赐食，必正席先尝之；君赐腥，必熟而荐之；君赐生，必畜之。",
                "target": "国君赐给食物，孔子一定会摆正席位先尝一尝。国君赐给生肉，他一定会煮熟了，先给祖先上供。国君赐给活物，他一定会养起来。"
            },
            {
                "source": "侍食于君，君祭，先饭。",
                "target": "陪侍国君吃饭，当国君进行饭前祭祀的时候，他先取国君面前的饭菜为他尝食。"
            },
            {
                "source": "疾，君视之，东首，加朝服，拖绅。",
                "target": "孔子病了，国君来探望他，他便头朝东躺着，身上盖上朝服，拖着大带子。"
            },
            {
                "source": "君命召，不俟驾行矣。",
                "target": "国君召见孔子，他不等车马驾好就先步行走去了。"
            },
            {
                "source": "入太庙，每事问。",
                "target": "孔子到了太庙，每件事都要问一问。"
            },
            {
                "source": "朋友死，无所归，曰：“于我殡。”",
                "target": "孔子朋友去世了，没有亲属负责敛埋，孔子说：“我来负责为他办理后事吧。”"
            },
            {
                "source": "朋友之馈，虽车马，非祭肉，不拜。",
                "target": "对于朋友的馈赠，即使是车和马，只要不是祭祀用的肉，孔子在接受时，也不会行拜谢礼。"
            },
            {
                "source": "寝不尸，居不客。",
                "target": "孔子睡觉不像死尸那样直挺着，平时在家闲住不讲究那么多礼仪。"
            },
            {
                "source": "见齐衰者，虽狎，必变。",
                "target": "见穿齐衰这种丧服的人，即使关系再亲密，也必定严肃。"
            },
            {
                "source": "见冕者与瞽者，虽亵，必以貌。",
                "target": "见戴礼帽的人和盲人，虽然是一般性的会见，也一定礼貌相待。"
            },
            {
                "source": "凶服者式之，式负版者。",
                "target": "坐着车在路上遇到穿丧服的人，一定身体前倾，用手扶住车前的横木，表示同情。遇见背负着国家图籍的人也一样。"
            },
            {
                "source": "有盛馔，必变色而作。迅雷风烈，必变。",
                "target": "做客时如果有丰盛的饭菜，一定表情严肃，站起来致谢。遇到迅雷和大风，一定表情严肃以示对天的敬畏。"
            },
            {
                "source": "升车，必正立，执绥。车中不内顾，不疾言，不亲指。",
                "target": "登车时，一定先端端正正地站直，然后拉着车上的绳索上车，在车上，不回头看，不急切说话，不指指画画。"
            },
            {
                "source": "色斯举矣，翔而后集。曰：“山梁雌雉，时哉时哉！”",
                "target": "孔子在山谷中行走，看见一群野鸡在那儿飞，孔子神色动了一下，野鸡飞着盘旋了一阵后，又落在了一处。孔子说：“这些山梁上的母野鸡，得其时呀！得其时呀！”"
            },
            {
                "source": "子路共之，三嗅而作。",
                "target": "子路向它们拱拱手，野鸡振几下翅膀飞走了。"
            }
        ]
    },
    {
        "title": "先进篇",
        "contents": [
            {
                "source": "子曰：“先进于礼乐，野人也；后进于礼乐，君子也。如用之，则吾从先进。”",
                "target": "孔子说：“先学习了礼乐而后做官的，是原来没有爵禄的平民；先做了官而后学习礼乐的，是卿大夫的子弟。如果让我来选用人才，那么我赞成选用先学习礼乐的人。”"
            },
            {
                "source": "子曰：“从我于陈、蔡者，皆不及门也。”",
                "target": "孔子说：“曾跟我在陈国、蔡国之间遭受困厄的弟子们，现在都不在我的身边了。”"
            },
            {
                "source": "德行：颜渊，闵子骞，冉伯牛，仲弓。言语：宰我，子贡。政事：冉有，季路。文学：子游，子夏。",
                "target": "德行好的有：颜渊、闵子骞、冉伯牛、仲弓；能说会道的有：宰 我、子贡；精于政事的有：冉有、季路；通晓古典文献的有：子游、 子夏。"
            },
            {
                "source": "子曰：“回也非助我者也，于吾言无所不说。”",
                "target": "孔子说：“颜回这个人啊，不是对我有帮助的人，他对我说的话没有不喜欢的。”"
            },
            {
                "source": "子曰：“孝哉闵子骞！人不间于其父母昆弟之言。”",
                "target": "孔子说：“闵子骞真是孝顺呀！人们对于他的父母兄弟称赞他的话没有异议。”"
            },
            {
                "source": "南容三复白圭，孔子以其兄之子妻之。",
                "target": "南容把几句“白圭”诗读了好多遍,孔子就把自己老兄的女儿嫁给了他。"
            },
            {
                "source": "季康子问：“弟子孰为好学？”",
                "target": "季康子问孔子：“你的弟子中谁最好学呢？”"
            },
            {
                "source": "孔子对曰：“有颜回者好学，不幸短命死矣，今也则亡。”",
                "target": "孔子回答说：“有一个叫颜回的学生很好学，不幸早逝了。现在再也没有像他那样的了。”"
            },
            {
                "source": "颜渊死，颜路请子之车以为之椁。",
                "target": "颜渊死了，他的父亲颜路请求孔子把车卖了给颜渊做一个外椁。"
            },
            {
                "source": "子曰：“才不才，亦各言其子也。鲤也死，有棺而无椁，吾不徒行以为之椁。以吾从大夫之后，不可徒行也。”",
                "target": "孔子说：“不管有才能还是没才能，说来也都是各自的儿子。孔鲤死了，也只有棺，没有椁。我不能卖掉车子步行来给他置办椁。因为我曾经做过大夫，是不可以徒步出行的。”"
            },
            {
                "source": "颜渊死。子曰：“噫！天丧予！天丧予！”",
                "target": "颜渊死了，孔子说：“唉！天要亡我呀！天要亡我呀！”"
            },
            {
                "source": "颜渊死，子哭之恸，从者曰：“子恸矣！”曰：“有恸乎？非夫人之为恸而谁为？”",
                "target": "颜渊死了，孔子哭得极其悲痛。跟随孔子的人说：“您悲痛过度了！”孔子说：“是太悲伤过度了吗？我不为这个人悲伤过度，又为谁呢？”"
            },
            {
                "source": "颜渊死，门人欲厚葬之，子曰：“不可。”",
                "target": "颜渊死了，孔子的学生们想要厚葬他。孔子说：“不可以”"
            },
            {
                "source": "门人厚葬之，子曰：“回也视予犹父也，予不得视犹子也。非我也，夫二三子也！”",
                "target": "学生们还是厚葬了他。孔子说：“颜回把我当父亲一样看待，我却不能像对待儿子一样看待他。这不是我的意思呀，是那些学生们要这样办。”"
            },
            {
                "source": "季路问事鬼神，子曰：“未能事人，焉能事鬼？”曰：“敢问死。”曰：“未知生，焉知死？”",
                "target": "季路问服侍鬼神的方法。孔子说：“人还不能服侍，怎么能去服侍鬼神呢？”季路又说：“敢问死是怎么回事？”孔子说：'对生都知道得不清楚，哪里能知道死呢？”"
            },
            {
                "source": "闵子侍侧，訚訚如也；子路，行行如也；冉有、子贡，侃侃如也。子乐。“若由也，不得其死然。”",
                "target": "闵子骞侍立在孔子身边，样子正直而恭敬；子路是很刚强的样子；冉有、子贡的样子温和快乐。孔子很高兴。但他说：“像仲由这样，恐怕得不到善终。”"
            },
            {
                "source": "鲁人为长府，闵子骞曰：“仍旧贯如之何？何必改作？”子曰：“夫人不言，言必有中。”",
                "target": "鲁国的执政大臣要翻修长府。闵子骞说：“照老样子不好吗？何必一定要翻修呢？”孔子说：“闵子骞这个人平常不大说话，但一开口必定说到要害上。”"
            },
            {
                "source": "子曰：“由之瑟奚为于丘之门？”门人不敬子路，子曰：“由也升堂矣，未入于室也。”",
                "target": "孔子说：“仲由弹瑟，为什么在我这里弹呢？”孔子的其他学生因此而不尊重子路。孔子说：“仲由的学问啊，已经具备规模了，只是还不够精深罢了。”"
            },
            {
                "source": "子贡问：“师与商也孰贤？”子曰：“师也过，商也不及。”曰：“然则师愈与？”子曰：“过犹不及。”",
                "target": "子贡问孔子：“子张和子夏二人谁更优秀呢？”孔子回答说：“颛孙师有些过分，卜商有些赶不上。”子贡说：“那么是子张优秀一些吗？”孔子说：“过分和不足是一样的。”"
            },
            {
                "source": "季氏富于周公，而求也为之聚敛而附益之。子曰：“非吾徒也，小子鸣鼓而攻之可也。”",
                "target": "季氏比周天子左右的卿士还要富有，冉求还帮他搜刮来增加他的钱财。孔子说：“他不是我的学生了，你们可以大张旗鼓地去攻击他吧！”"
            },
            {
                "source": "柴也愚，参也鲁，师也辟，由也喭。",
                "target": "高柴愚笨，曾参迟钝，颛孙师偏激，仲由鲁莽。"
            },
            {
                "source": "子曰：“回也其庶乎，屡空。赐不受命而货殖焉，亿则屡中。”",
                "target": "孔子说：“颜回呀，他的道德修养已经差不多了，可是他常常很贫困。端木赐不听天由命，而去做生意，猜测市场行情往往很准。”"
            },
            {
                "source": "子张问善人之道，子曰：“不践迹，亦不入于室。”",
                "target": "子张问成为善人的方法。孔子说：“如果不沿着前人的脚印走，其学问和修养就不到家。"
            },
            {
                "source": "子曰：“论笃是与，君子者乎，色庄者乎？”",
                "target": "孔子说：“总是谈论、赞许那些言语诚实的人。这种善谈的人到底是真君子呢？还是只是伪装庄重的人呢？”"
            },
            {
                "source": "子路问：“闻斯行诸？”子曰：“有父兄在，如之何其闻斯行之？”",
                "target": "子路问：“听到了应当做的事情就要立刻去做吗？”孔子说：“有父亲兄弟在，怎么能听到就立刻去做呢。”"
            },
            {
                "source": "冉有问：“闻斯行诸？”子曰：“闻斯行之。",
                "target": "冉有问：“听到了就行动起来吗？”孔子说：“听到了就行动起来。”"
            },
            {
                "source": "公西华曰：“由也问闻斯行诸，子曰‘有父兄在’；求也问闻斯行诸，子曰‘闻斯行之’赤也惑，敢问。”",
                "target": "公西华说：“仲由问‘听到了就行动起来吗？’你回答说‘有父兄健在’，冉求问‘听到了就行动起来吗？’你回答‘听到了就行动起来’。我被弄糊涂了，敢再问个明白。”"
            },
            {
                "source": "子曰：“求也退，故进之；由也兼人，故退之。”",
                "target": "孔子说：“冉求平日做事退缩，所以我激励他；仲由好勇胜人，所以我要压压他。”"
            },
            {
                "source": "子畏于匡，颜渊后。子曰：“吾以女为死矣！”曰：“子在，回何敢死！”",
                "target": "孔子被囚禁在匡地，颜渊后来赶来。孔子说：“我还以为你死了呢。”颜渊说：“您还活着，我怎么敢先死呢？”"
            },
            {
                "source": "季子然问：“仲由、冉求可谓大臣与？”子曰：“吾以子为异之问，曾由与求之问。所谓大臣者，以道事君，不可则止。今由与求也，可谓具臣矣。”曰：“然则从之者与？”",
                "target": "季子然问：“仲由和冉求可以称作是大臣吗？”孔子说：“我以为你是问别人，原来是问仲由和冉求呀。我们所说的大臣，应该能以合于仁道的方式去侍奉君主，如果行不通，便宁可不干。现在由和求这两个人呀，只算得上是备位充数的臣罢了。”季子然又问：“那么，他们肯听话吗？”"
            },
            {
                "source": "子曰：“弑父与君，亦不从也。”",
                "target": "孔子说：“如果是杀父亲杀君主，他们也是不会听从的。”"
            },
            {
                "source": "子路使子羔为费宰，子曰：“贼夫人之子。”",
                "target": "子路叫子羔去做费地的长官。孔子说：“是祸害子弟的做法。”"
            },
            {
                "source": "子路曰：“有民人焉，有社稷焉，何必读书然后为学。”",
                "target": "子路说：“有百姓，有土地五谷，何必读书才算学习？”"
            },
            {
                "source": "子曰：“是故恶夫佞者。”",
                "target": "子说：“所以我讨厌那些能说会道的人。”"
            },
            {
                "source": "子路、曾皙、冉有、公西华侍坐，子曰：“以吾一日长乎尔，毋吾以也。居则曰‘不吾知也’如或知尔，则何以哉？”",
                "target": "子路、曾晳、冉有、公西华陪孔子坐着。孔子说：“不要因为我年纪比你们大一点，就不敢讲了。（你们）平时常说：‘没有人了解我呀！’假如有人了解你们，那么你们打算怎么做呢？”"
            },
            {
                "source": "子路率尔而对曰：“千乘之国，摄乎大国之间，加之以师旅，因之以饥馑，由也为之，比及三年，可使有勇，且知方也。”",
                "target": "子路不假思索地回答说：“一个拥有一千辆兵车的国家，夹在大国之间，加上外国军队的侵犯，接着又遇上饥荒；如果让我治理这个国家，等到三年功夫，就可以使人人勇敢善战，而且还懂得做人的道理。”"
            },
            {
                "source": "夫子哂之。“求，尔何如？”",
                "target": "孔子听了，微微一笑。“冉有，你怎么样？”"
            },
            {
                "source": "对曰：“方六七十，如五六十，求也为之，比及三年，可使足民。如其礼乐，以俟君子。”",
                "target": "冉求回答说：“一个纵横六七十里、或者五六十里的国家，如果让我去治理，等到三年，就可以使老百姓富足起来。至于修明礼乐，那就只有等待贤人君子了。”"
            },
            {
                "source": "“赤！尔何如？”",
                "target": "“公西华，你怎么样？”"
            },
            {
                "source": "对曰：“非曰能之，愿学焉。宗庙之事，如会同，端章甫，愿为小相焉。”",
                "target": "公西华回答说：“我不敢说能做什么，愿意学习罢了。宗庙祭祀的工作，或者是诸侯会盟及朝见天子的时候，我愿意穿戴好礼服礼帽做一个小小的司仪。”"
            },
            {
                "source": "“点，尔何如？”",
                "target": "“曾皙，你怎么样？”"
            },
            {
                "source": "鼓瑟希，铿尔，舍瑟而作，对曰：“异乎三子者之撰。”",
                "target": "曾皙弹瑟的声音逐渐稀疏了，接着铿的一声，放下瑟直起身子回答说：“我和他们三人的才能不一样。”"
            },
            {
                "source": "子曰：“何伤乎？亦各言其志也。”曰：“暮春者，春服既成，冠者五六人，童子六七人，浴乎沂，风乎舞雩，咏而归。”",
                "target": "孔子说：“那有什么关系呢？不过是各自谈谈自己的志向罢了。”曾皙说：“暮春时节，春天的衣服已经穿上了。和几个成年人、几个孩童到沂水里游泳，在舞雩台上吹吹风，一路唱着歌儿回来。”"
            },
            {
                "source": "夫子喟然叹曰：“吾与点也！”三子者出，曾皙后。",
                "target": "孔子长叹一声说：“我赞同曾皙的想法呀！”子路、冉有、公西华都出去了，曾皙最后走。"
            },
            {
                "source": "曾皙曰：“夫三子者之言何如？”",
                "target": "曾皙问孔子：“他们三个人的话怎么样？”"
            },
            {
                "source": "子曰：“亦各言其志也已矣。”曰：“夫子何哂由也？”曰：“为国以礼，其言不让，是故哂之。”“唯求则非邦也与？”“安见方六七十、如五六十而非邦也者？”",
                "target": "孔子说：“也不过是各自谈谈自己的志向罢了！”曾皙说：“您为什么笑仲由呢？”孔子说：“治国要用礼，可是他的话毫不谦让，所以我笑他。”曾皙又问：“难道冉有讲的不是国家大事吗？”孔子说：“怎么见得方圆六七十里或者五六十里的地方就不是国家呢？”"
            },
            {
                "source": "“唯赤则非邦也与？”",
                "target": "曾皙再问：“难道公西华讲的不是诸侯的大事吗？”"
            },
            {
                "source": "“宗庙会同，非诸侯而何？赤也为之小，孰能为之大？”",
                "target": "孔子说：“宗庙祭祀，诸侯会盟和朝见天子，不是诸侯的大事又是什么呢？公西华只能替诸侯做小相，那么，谁又能给诸侯做大相呢？”"
            }
        ]
    },
    {
        "title": "八佾篇",
        "contents": [
            {
                "source": "孔子谓季氏：“八佾舞于庭，是可忍也，孰不可忍也？”",
                "target": "孔子谈到季氏，说，“他用天子才能用的八佾在庭院中奏乐舞蹈，这样的事他都忍心去做，还有什么事情不可狠心做出来呢？”"
            },
            {
                "source": "三家者以《雍》彻，子曰：“‘相维辟公，天子穆穆’，奚取于三家之堂？”",
                "target": "孟孙氏、叔孙氏、季孙氏三家在祭祖的时候，命乐工唱着《雍》这篇诗歌来撤下祭品。孔子说：“《雍》诗中的‘诸侯都来助祭，天子恭敬地主祭’这样的意思，怎么能够用在三家大夫的庙堂里呢？”"
            },
            {
                "source": "子曰：“人而不仁，如礼何？人而不仁，如乐何？”",
                "target": "孔子说：“一个人如果没有仁德，那他怎样遵守礼仪制度呢？一个人没有仁德，那他怎么能正确运用音乐呢？”"
            },
            {
                "source": "林放问礼之本，子曰：“大哉问！礼，与其奢也，宁俭；丧，与其易也，宁戚。”",
                "target": "林放问什么是礼仪制度的根本。孔子回答说：“你问的问题意义重大。礼，与其一味的寻求奢侈，不如节俭些；办理丧事，与其在仪式上办理得妥帖，不如内心真正悲伤。”"
            },
            {
                "source": "子曰：“夷狄之有君，不如诸夏之亡也。”",
                "target": "孔子说：“那些不开化的地方有君主，还不如中原没有君主的地区讲礼节。”"
            },
            {
                "source": "季氏旅于泰山。子谓冉有曰：“女弗能救与？”对曰：“不能。”子曰：“呜呼！曾谓泰山不如林放乎？”",
                "target": "季氏准备去祭祀泰山。孔子对冉有说：“你不能阻止他吗？”冉有说：“不能。”孔子说：“唉！难道说泰山神还不如林放知礼吗？”"
            },
            {
                "source": "子曰：“君子无所争，必也射乎！揖让而升，下而饮。其争也君子。”",
                "target": "孔子说：“君子没有什么可以与人相争的事情。如果有的话，那就一定是射箭。比赛开始的时候，先相互作揖谦让，然后上场。比赛完后，又相互作揖再退下来，然后登堂喝酒。这就是君子之争。”"
            },
            {
                "source": "子夏问曰：“‘巧笑倩兮，美目盼兮，素以为绚兮’何谓也？”子曰：“绘事后素。”曰：“礼后乎？”子曰：“起予者商也，始可与言《诗》已矣。”",
                "target": "子夏问孔子：“‘笑得真好看啊，黑白分明的眼睛多妩媚呀，好像在洁白的质地上画着美丽的图案。’这几句话是什么意思呢？”孔子说：“这是说绘画先有白底，然后再用色彩绘画。”子夏又问：“这么说礼也是在有了仁德之心之后才产生的了？”孔子说：“卜商啊，你真是能够发挥我的思想，现在可以开始和你谈论《诗经》了。”"
            },
            {
                "source": "子曰：“夏礼吾能言之，杞不足征也；殷礼吾能言之，宋不足征也。文献不足故也，足则吾能征之矣。”",
                "target": "孔子说：“夏朝的礼仪制度，我可以说一说，但是它的后代杞国不足以证明我的话；殷朝的礼仪制度，我能说一说，但它的后代宋国不足以证明我的话。这是由于文字资料和熟悉夏礼和殷礼的人不足的缘故。如果有足够的历史资料和懂礼的人才，我就可以得到证明了。”"
            },
            {
                "source": "子曰：“禘自既灌而往者，吾不欲观之矣。”",
                "target": "孔子说：“对于行禘礼的仪式，从完成第一次献酒以后，我就不想再看了。”"
            },
            {
                "source": "或问禘之说。子曰：“不知也。知其说者之于天下也，其如示诸斯乎！”指其掌。",
                "target": "有人问孔子关于举行禘祭的规定。孔子说：“我不知道。知道的人对治理天下的事，可能像把东西放在这里一样容易吧！”说着指了指自己的手掌。"
            },
            {
                "source": "祭如在，祭神如神在。子曰：“吾不与祭，如不祭。”",
                "target": "祭祀祖先时，好像祖先真的就在前面；祭神的时候，好像神真的在面前。孔子说：“我如果不亲自参加祭祀，祭祀了就跟没祭祀一样。”"
            },
            {
                "source": "王孙贾问曰：“‘与其媚于奥，宁媚于灶’，何谓也？”子曰：“不然，获罪于天，无所祷也。”",
                "target": "王孙贾问道：“‘与其祈祷较尊贵的奥神的保佑，不如祈祷有实权的灶神的赐福。’这话是什么意思？”孔子说：“不是这样的。如果犯了滔天大罪，那就怎么祈祷也没用。”"
            },
            {
                "source": "子曰：“周监于二代，郁郁乎文哉！吾从周。”",
                "target": "孔子说：“周朝的礼仪制度借鉴于夏、商二朝，是多么丰富多彩啊。我主张接受周朝的制度。”"
            },
            {
                "source": "子入太庙，每事问。或曰：“孰谓鄹人之子知礼乎？入太庙，每事问。”子闻之，曰：“是礼也。”",
                "target": "孔子到了太庙，每件事都要问。有人说：“谁说这个人懂得礼呀，他到了太庙里，什么事都要问别人。”孔子听到此话后说：“这就是礼呀！”"
            },
            {
                "source": "子曰：“射不主皮，为力不同科，古之道也。”",
                "target": "孔子说：“射箭，不在于穿透靶子，因为人的力气有大有小。这是古人的道理呀。”"
            },
            {
                "source": "子贡欲去告朔之饩羊，子曰：“赐也！尔爱其羊，我爱其礼。”",
                "target": "子贡提出去掉每月初一日告祭祖庙用的活羊。孔子说：“赐，你爱惜那只羊，我却爱惜那种礼。”"
            },
            {
                "source": "子曰：“事君尽礼，人以为谄也。”",
                "target": "孔子说：“我按照周礼的规定去侍奉君主，别人却认为这是在讨好君主。”"
            },
            {
                "source": "定公问：“君使臣，臣事君，如之何？”孔子对曰：“君使臣以礼，臣事君以忠。”",
                "target": "鲁定公问孔子：“君主差使臣子，臣子侍奉君主，各自应该怎么做？”孔子回答说：“君主差使臣子以礼相待，臣子应该以忠来侍奉君主。”"
            },
            {
                "source": "子曰：“《关雎》，乐而不淫，哀而不伤。”",
                "target": "孔子说：“《关睢》这首诗，快乐却不是毫无节制，悲哀而不过于悲伤。”"
            },
            {
                "source": "哀公问社于宰我，宰我对曰：“夏后氏以松，殷人以柏，周人以栗，曰使民战栗。”子闻之，曰：“成事不说，遂事不谏，既往不咎。”",
                "target": "鲁哀公问宰我，做土地神的神位应该用什么木材，宰我回答：“夏朝时用松树，商朝时用柏树，周朝时用栗子树。用栗子树的意思是说：使老百姓战战栗栗。”孔子听到后说：“已经做过的事不用提了，已经完成的事不用再去劝谏了，已经过去的事也不必再追究了。”"
            },
            {
                "source": "子曰：“管仲之器小哉！”或曰：“管仲俭乎？”曰：“管氏有三归，官事不摄，焉得俭？”“然则管仲知礼乎？”曰：“邦君树塞门，管氏亦树塞门；邦君为两君之好，有反坫。管氏亦有反坫，管氏而知礼，孰不知礼？”",
                "target": "孔子说：“管仲的气量真小啊！”有人说：“管仲节俭吗？”孔子说：“他有三处豪华的房屋，他家里的管事也是一人一职而不兼任，怎么谈得上节俭呢？”那人又问：“那么管仲懂礼吗？”孔子回答：“国君在宫门前立了一道影壁，管仲也在自家门口立了影壁；国君设宴招待别国君主、举行友好会见时，在堂上设有放置空酒杯的土台，管仲宴客也就有这样的土台。如果说管仲知礼，那还有谁不知礼呢？”"
            },
            {
                "source": "子语鲁大师乐，曰：“乐其可知也。始作，翕如也；从之，纯如也，皦如也，绎如也，以成。”",
                "target": "孔子给鲁国乐官讲奏乐过程，说：“演奏的原理是可以知道的。开始演奏时，各种乐器合奏，声音宏亮优美；乐曲继续展开下去，悠扬悦耳，节奏分明，如流水绵绵流淌，直至演奏结束。”"
            },
            {
                "source": "仪封人请见，曰：“君子之至于斯也，吾未尝不得见也。”从者见之。出曰：“二三子何患于丧乎？天下之无道也久矣，天将以夫子为木铎。”",
                "target": "仪地的一个小官请求会见孔子，说：“凡是到这个地方的君子，我没有不求见的。”孔子的学生们领他去见孔子。出来以后，他说：“你们几位为什么担心失去官位呢？天下无道已经很久了，因此上天将以孔夫子为圣人来教化天下。”"
            },
            {
                "source": "子谓《韶》：“尽美矣，又尽善也。”谓《武》：“尽美矣，未尽善也。”",
                "target": "孔子评价《韶》，说：“乐曲很美，内容也非常好。”评价《武》，说：“乐曲很美，内容却差一些。”"
            },
            {
                "source": "子曰：“居上不宽，为礼不敬，临丧不哀，吾何以观之哉？”",
                "target": "孔子说：“居于统治地位的人，不能宽厚待人，行礼的时候不恭敬，参加丧礼时也不悲哀，这种情况我怎么能看得下去呢？”"
            }
        ]
    },
    {
        "title": "公冶长篇",
        "contents": [
            {
                "source": "子谓公冶长：“可妻也，虽在缧绁之中，非其罪也！”以其子妻之。",
                "target": "孔子谈论到公冶长时，说：“可以把女儿嫁与他为妻，他虽然有过牢狱之灾，但这并不是他的罪过。”便把自己的女儿嫁给了他。"
            },
            {
                "source": "子谓南容：“邦有道不废；邦无道免于刑戮。”以其兄之子妻之。",
                "target": "孔子评论南容时说：“国家政治清明的时候，他入仕为官不会被罢免；国家黑暗的时候，他也可以不被被刑罚。”于是把自己的侄女嫁给了他。"
            },
            {
                "source": "子谓子贱：“君子哉若人！鲁无君子者，斯焉取斯？”",
                "target": "孔子评论子贱说：“这个人真是个君子呀！如果鲁国没有君子的话，他从哪里获得这种好品德的呢？”"
            },
            {
                "source": "子贡问曰：“赐也何如？”子曰：“女器也。”曰：“何器也？”曰：“瑚琏也。”",
                "target": "子贡问孔子说：“我这个人怎么样？”孔子说：“你呀好比一个器具。”子贡又问：“是什么器具呢？”孔子说：“祭祀时盛粮食的瑚琏。”"
            },
            {
                "source": "或曰：“雍也仁而不佞。”子曰：“焉用佞？御人以口给，屡憎于人。不知其仁，焉用佞？”",
                "target": "有人说：“冉雍这个人有仁德，但是没有什么口才。”孔子说：“为什么一定要有口才呢？伶牙利齿的和他人争辩顶嘴，会被人讨厌。我不知道他是否可称得上仁，但为什么要有口才呢？”"
            },
            {
                "source": "子使漆雕开仕，对曰：“吾斯之未能信。”子说。",
                "target": "孔子让漆雕开入仕做官。漆雕开回答说：“我对做官这件事还没有信心。”孔子听了很高兴。"
            },
            {
                "source": "子曰：“道不行，乘桴浮于海，从我者其由与？”子路闻之喜，子曰：“由也好勇过我，无所取材。”",
                "target": "孔子说：“如果我的主张行不通，我就坐木筏子漂流海外。能跟从我的大概只有仲由吧！”子路听到这话很高兴。孔子说：“仲由勇武过人，他的勇猛甚至超过了我。但不善于裁夺事理。”"
            },
            {
                "source": "孟武伯问：“子路仁乎？”子曰：“不知也。”又问，子曰：“由也，千乘之国，可使治其赋也，不知其仁也。”“求也何如？”",
                "target": "孟武伯问孔子：“子路算得上有仁德吗？”孔子说：“不知道。”孟武伯又问一遍。孔子说：“仲由啊，一个具备千辆兵车的大国，可以让他去负责军事。至于他有没有仁德，我就不知道了。”又问：“冉求怎么样？”"
            },
            {
                "source": "子曰：“求也，千室之邑、百乘之家，可使为之宰也，不知其仁也。”",
                "target": "孔子说：“冉求呢，一个千户规模的大邑，一个具备兵车百辆的大夫封地，可以让他当总管。至于他的仁德，我弄不清。”"
            },
            {
                "source": "“赤也何如？”子曰：“赤也，束带立于朝，可使与宾客言也，不知其仁也。”",
                "target": "孟武伯继续问：“公西赤怎么样？”孔子说：“赤呀，穿上礼服，站在朝廷上，可以让他和宾客会谈。我也不知道他是不是做到了仁。”"
            },
            {
                "source": "子谓子贡曰：“女与回也孰愈？”对曰：“赐也何敢望回？回也闻一以知十，赐也闻一以知二。”子曰：“弗如也，吾与女弗如也！”",
                "target": "孔子对子贡说：“你和颜回两个相比，谁好些？”子贡回答说：“我怎么能和颜回相比！颜回他听到一件事就可以推知十件事；我知道一件事，只能推知两件事。”孔子说：“你是不如他，我同意你说的。”"
            },
            {
                "source": "宰予昼寝，子曰：“朽木不可雕也，粪土之墙不可杇也，于予与何诛？”子曰：“始吾于人也，听其言而信其行；今吾于人也，听其言而观其行。于予与改是。”",
                "target": "宰予白天睡觉。孔子说：“腐烂的木头不堪雕刻，烂草加泥巴垒成的墙无法粉刷。对于宰予，还能再苛求什么呢！”孔子说：“以前我对人的态度，是听了他的话便相信他的行为；现在我对人的态度，是听了他的话还要观察他的行为。我是因宰予的表现而改变了对人的态度的。”"
            },
            {
                "source": "子曰：“吾未见刚者。”或对曰：“申枨。”子曰：“枨也欲，焉得刚。”",
                "target": "孔子说：“我还没有见过刚强不屈的人。”有人回答说：“申枨就是。”孔子说：“申枨的欲望太多，怎么能刚毅不屈？”"
            },
            {
                "source": "子贡曰：“我不欲人之加诸我也，吾亦欲无加诸人。”子曰：“赐也，非尔所及也。”",
                "target": "子贡说：“我不愿别人把事情强加在我的身上，我也不愿把事情强加在别人身上。”孔子说：“赐呀，这不是你可以做得到的。”"
            },
            {
                "source": "子贡曰：“夫子之文章，可得而闻也；夫子之言性与天道，不可得而闻也。”",
                "target": "子贡说：“老师关于《诗》《书》《礼》《乐》等古代文献方面知识的讲述，我们能够听得到；老师关于天性和天道的言论，我们听不到。”"
            },
            {
                "source": "子路有闻，未之能行，唯恐有闻。",
                "target": "子路听了做人处事的道理，但没有能亲自实践的时候，便害怕又听到新的道理。"
            },
            {
                "source": "子贡问曰：“孔文子何以谓之文也？”子曰：“敏而好学，不耻下问，是以谓之文也。”",
                "target": "子贡问道：“孔文子的谥号为什么是‘文’？”孔子说：“他天资聪明而又好学的人，不以向地位比自己低、学识比自己差的人请教为耻，所以给他谥号叫‘文’。”"
            },
            {
                "source": "子谓子产：“有君子之道四焉：其行己也恭，其事上也敬，其养民也惠，其使民也义。”",
                "target": "孔子评论子产说：“他有四个方面符合君子的标准：他自己言行谨重，事奉君主恭敬，养护百姓有恩惠，征募使用百姓公正合理。”"
            },
            {
                "source": "子曰：“晏平仲善与人交，久而敬之。”",
                "target": "孔子说：“晏平仲擅长与人交朋友，时间久了，大家都很尊敬他。”"
            },
            {
                "source": "子曰：“臧文仲居蔡，山节藻棁，何如其知也？”",
                "target": "孔子说：“臧文仲为产自蔡地的大乌龟盖了一间房子，中有雕刻成山形的斗拱和画着藻草的梁柱，他这个人怎么能算是有智慧呢？”"
            },
            {
                "source": "子张问曰：“令尹子文三仕为令尹，无喜色，三已之无愠色，旧令尹之政必以告新令尹，何如？”子曰：“忠矣。”曰：“仁矣乎？”曰：“未知，焉得仁？”",
                "target": "子张问孔子说：“子文几次担任令尹的职务，没有显出高兴的样子；几次被免职，也没有显出怨恨的样了。一定把自己的一切政事全部告诉给来接任的人。你这个人怎么样？”孔子说：“可算算得上是对国家尽忠了。”子张问：“算得上又仁德了吗？”孔子说：“不知道。这怎么能算仁呢？”"
            },
            {
                "source": "“崔子弑齐君，陈文子有马十乘，弃而违之。至于他邦，则曰：‘犹吾大夫崔子也。’违之。之一邦，则又曰：‘犹吾大夫崔子也。’违之，何如？”",
                "target": "子张又问：“崔杼杀了他的君主齐庄公，陈文子有四十匹马，他都丢弃不要，就离开了。到了另一个国家，说：‘这里的执政者和我国的崔子差不多’，又离开了。再到了一国，说：‘这里的执政者和我国的崔子差不多’，还是离开了。这人怎么样？”"
            },
            {
                "source": "子曰：“清矣。”曰：“仁矣乎？”曰：“未知，焉得仁？”",
                "target": "孔子说：“很清高。”子张说：“算得上有仁德吗？”孔子说：“不知道，这怎么能算有仁德呢？”"
            },
            {
                "source": "季文子三思而后行，子闻之曰：“再斯可矣。”",
                "target": "季文子每次做事的时候都要考虑很多次才行动。孔子听到了，说：“考虑两次就可以了。”"
            },
            {
                "source": "子曰：“宁武子，邦有道则知，邦无道则愚。其知可及也，其愚不可及也。”",
                "target": "孔子说：“宁武子这个人，当国家政治清明时，他就显得聪明，当国家政治黑暗时，他就装得很愚笨。他的那种聪明别人可以做得到，他的那种装傻别人就做不到了。"
            },
            {
                "source": "子在陈，曰：“归与！归与！吾党之小子狂简，斐然成章，不知所以裁之。”",
                "target": "孔子在陈国说：“回去吧！回去吧！家乡的那帮学生志向远大而行为粗疏；文采尚可但还不知道怎样来节制自己。”"
            },
            {
                "source": "子曰：“伯夷、叔齐不念旧恶，怨是用希。”",
                "target": "孔子说：“伯夷、叔齐两个人不记往日仇怨，因此，别人对他们的怨恨也很少。”"
            },
            {
                "source": "子曰：“孰谓微生高直？或乞醯焉，乞诸其邻而与之。”",
                "target": "孔子说：“谁说微生高这个人直率？有人向他讨点醋，他不直说没有，却暗地到他邻居家里讨了点给人家。”"
            },
            {
                "source": "子曰：“巧言、令色、足恭，左丘明耻之，丘亦耻之。匿怨而友其人，左丘明耻之，丘亦耻之。”",
                "target": "孔子说：“花言巧语，表面伪善，用过分恭敬的态度接近别人，左丘明认为这种人可耻，我也这么认为。把仇恨藏在心里，表面上却装出友好的样子，左丘明认为这种人可耻，我也这样认为。”"
            },
            {
                "source": "颜渊、季路侍，子曰：“盍各言尔志？”子路曰：“愿车马、衣轻裘与朋友共，敝之而无憾。”颜渊曰：“愿无伐善，无施劳。”子路曰：“愿闻子之志。”子曰：“老者安之，朋友信之，少者怀之。”",
                "target": "颜渊、子路两人侍立在孔子身边。孔子说：“你们何不说说各自的志向？”子路说：“我愿意拿出自己的车马、衣服，同我的朋友共同使用，就算用坏了也不抱怨。”颜渊说：“我愿意不夸耀自己的长处，不宣扬自己的功劳。”子路说：“我们希望听听老师的志向。”孔子说：“我愿老年人安度晚年，朋友之间相互信任，年幼的人得到照顾。”"
            },
            {
                "source": "子曰：“已矣乎！吾未见能见其过而内自讼者也。”",
                "target": "孔子说：“算了吧，我还没有看见过能够看到自己的错误便能自我责备的人。”"
            },
            {
                "source": "子曰：“十室之邑，必有忠信如丘者焉，不如丘之好学也。”",
                "target": "孔子说：“即使只有十户人家的地方，也一定有像我这样讲忠信的人，只是赶不上我这样好学罢了。”"
            }
        ]
    },
    {
        "title": "卫灵公篇",
        "contents": [
            {
                "source": "卫灵公问陈于孔子，孔子对曰：“俎豆之事，则尝闻之矣；军旅之事，未之学也。”明日遂行。",
                "target": "卫灵公向孔子询问排兵布阵的方法。孔子回答说：“祭祀礼仪方面的事情，我听说过；用兵打仗的事，从来没有学过。”第二天就离开了卫国。"
            },
            {
                "source": "在陈绝粮，从者病莫能兴。子路愠见曰：“君子亦有穷乎？”子曰：“君子固穷，小人穷斯滥矣。”",
                "target": "孔子在陈国断绝了粮食，跟从的人都饿病了，躺着不能起来。子路生气地来见孔子说：“君子也有困窘没有办法的时候吗？”孔子说：“君子在困窘时还能固守正道，小人一困窘就会胡作非为。”"
            },
            {
                "source": "子曰：“赐也，女以予为多学而识之者与？”对曰：“然，非与？”曰：“非也，予一以贯之。”",
                "target": "孔子说：“赐啊！你以为我是多多学习并能记住所有知识的人吗？”子贡答道：“是啊，难道不是这样吗？”孔子说：“不是的。我是用一个基本的东西把它们贯彻始终的。”"
            },
            {
                "source": "子曰：“由，知德者鲜矣。”",
                "target": "孔子说：“由啊！懂得德的人太少了。”"
            },
            {
                "source": "子曰：“无为而治者其舜也与！夫何为哉？恭己正南面而已矣。”",
                "target": "孔子说：“能够不做什么就治理天下的人，大概只有舜吧？他做了些什么呢？他只是庄严端正地坐在朝廷的王位上罢了。”"
            },
            {
                "source": "子张问行，子曰：“言忠信，行笃敬，虽蛮貊之邦行矣；言不忠信，行不笃敬，虽州里行乎哉？立则见其参于前也；在舆则见其倚于衡也，夫然后行。”子张书诸绅。",
                "target": "子张问如何才能使自己到处都能行得通。孔子说：“言语忠实诚信，行为笃厚恭敬，即使到了蛮貊地区，也能行得通。言语不忠实诚信，行为不笃厚恭敬，即使是在本乡本土，能行得通吗？站立时，就好像看见‘忠实、诚信、笃厚、恭敬’的字样直立在面前；在车上时，就好像看见这几个字靠在车前横木上，这样才能处处行得通。”子张把这些话写在腰间的大带上。"
            },
            {
                "source": "子曰：“直哉史鱼！邦有道如矢，邦无道如矢。君子哉蘧伯玉！邦有道则仕，邦无道则可卷而怀之。”",
                "target": "孔子说：“史鱼真是正直啊！国家政治清明，他的言行像箭一样直；国家政治黑暗，他的言行也像箭一样直。蘧伯玉也真是一位君子啊！国家有道就出来做官，国家无道就（辞退官职）把自己的主张收藏在心里。"
            },
            {
                "source": "子曰：“可与言而不与之言，失人；不可与言而与之言，失言。知者不失人亦不失言。”",
                "target": "孔子说：“可以同他交谈却没有谈，这就是错失了人才；不可以同他交谈却要与他交谈，这就是说错了话。有智慧的人既不失去朋友，又不说错话。”"
            },
            {
                "source": "子曰：“志士仁人无求生以害仁，有杀身以成仁。”",
                "target": "孔子说：“志士仁人决不为了自己活命而做出损害仁义的事情，而是宁可牺牲自己的性命来成全仁的。”"
            },
            {
                "source": "子贡问为仁，子曰：“工欲善其事，必先利其器。居是邦也，事其大夫之贤者，友其士之仁者。”",
                "target": "子贡问怎样实行仁德。孔子说：“做工的人想把活儿做好，必须首先使他的工具锋利。住在这个国家，就要事奉大夫中的那些贤者，与士人中的仁者交朋友。”"
            },
            {
                "source": "颜渊问为邦，子曰：“行夏之时，乘殷之辂，服周之冕，乐则《韶》、《舞》；放郑声，远佞人。郑声淫，佞人殆。”",
                "target": "颜渊问怎样治理国家。孔子说：“实行夏朝的历法，乘坐殷朝的车子，戴周朝的礼帽，音乐就用《韶》和《舞》，舍弃郑国的乐曲，远离谄媚的人。郑国的乐曲很淫秽，谄媚的人很危险。”"
            },
            {
                "source": "子曰：“人无远虑，必有近忧。”",
                "target": "孔子说：“人如果一直没有长远的考虑，一定会有眼前的忧患。”"
            },
            {
                "source": "子曰：“已矣乎！吾未见好德如好色者也。”",
                "target": "孔子说：“罢了罢了！我从来没有见过喜欢美德如同喜欢美色一样的人。”"
            },
            {
                "source": "子曰：“臧文仲其窃位者与！知柳下惠之贤而不与立也。”",
                "target": "孔子说：“臧文仲是一个偷窃官位的人！他明知道柳下惠具有贤能，却不举荐他一起做官。”"
            },
            {
                "source": "子曰：“躬自厚而薄责于人，则远怨矣。”",
                "target": "孔子说：“人要能够自我反省，多责备自己而少责备别人，那就可以避免别人的怨恨了。”"
            },
            {
                "source": "子曰：“不曰‘如之何、如之何’者，吾末如之何也已矣。”",
                "target": "孔子说：“不说‘怎么办，怎么办'的人，我对他也不知道该怎么办了。”"
            },
            {
                "source": "子曰：“群居终日，言不及义，好行小慧，难矣哉！”",
                "target": "孔子说：“整天聚在一块，谈话的内容丝毫不涉及道义，专好卖弄小聪明，这种人真难教导。”"
            },
            {
                "source": "子曰：“君子义以为质，礼以行之，孙以出之，信以成之。君子哉！”",
                "target": "孔子说：“君子把义作为根本，用礼加以推行，用谦逊的语言表述，用诚信的态度来完成，这就是君子了。”"
            },
            {
                "source": "子曰：“君子病无能焉，不病人之不己知也。”",
                "target": "孔子说：“君子担心自己没有才能，不担心别人不知道自己。”"
            },
            {
                "source": "子曰：“君子疾没世而名不称焉。”",
                "target": "孔子说：“君子感到痛心的是到死而名声不被大家所称颂。”"
            },
            {
                "source": "子曰：“君子求诸己，小人求诸人。”",
                "target": "孔子说：“君子要求的是自己，小人要求的是别人。“"
            },
            {
                "source": "子曰：“君子矜而不争，群而不党。”",
                "target": "孔子说：“君子庄重而不与别人争执，合群而不结党营私。”"
            },
            {
                "source": "子曰：“君子不以言举人，不以人废言。”",
                "target": "孔子说：“君子不因为一个人的话说得好就举荐他，也不因为一个人的德行不好就不采纳他的正确意见。”"
            },
            {
                "source": "子贡问曰：“有一言而可以终身行之者乎？”子曰：“其恕乎！己所不欲，勿施于人。”",
                "target": "子贡问孔子问道：“有没有一个字可以终身奉行的呢？”孔子回答说：“那就是恕吧！自己不愿意的，不要强加给别人。”"
            },
            {
                "source": "子曰：“吾之于人也，谁毁谁誉？如有所誉者，其有所试矣。斯民也，三代之所以直道而行也。”",
                "target": "孔子说：“我对于别人，毁谤了谁？赞誉了谁？如果有所赞誉的话，一定对他有所考察。有了这样的民众，夏、商、周三代所以能直道而行。”"
            },
            {
                "source": "子曰：“吾犹及史之阙文也，有马者借人乘之，今亡矣夫！”",
                "target": "孔子说：“我还能够看到史书中存疑空阙的地方。有马的人自己不会调教先借给别人骑，现在没有这样的了。”"
            },
            {
                "source": "子曰：“巧言乱德，小不忍，则乱大谋。”",
                "target": "孔子说：“花言巧语会败坏道德，小事情不忍耐，就会扰乱了大的谋略。”"
            },
            {
                "source": "子曰：“众恶之，必察焉；众好之，必察焉。”",
                "target": "孔子说：“众人都厌恶他，不要轻易相信，要自己考察判断；大家都喜欢他，也一定要自己考察。”"
            },
            {
                "source": "子曰：“人能弘道，非道弘人。”",
                "target": "孔子说：“人能不断使道得以完善，道却不能使人得以完善。。”"
            },
            {
                "source": "子曰：“过而不改，是谓过矣。”",
                "target": "孔子说：“有了过错而不改正，这才是真的过错。”"
            },
            {
                "source": "子曰：“吾尝终日不食、终夜不寝以思，无益，不如学也。”",
                "target": "孔子说：“我曾经整日不吃饭，整夜不睡觉，去思考问题，结果没有什么好处，还不如去学习为好。”"
            },
            {
                "source": "子曰：“君子谋道不谋食。耕也馁在其中矣，学也禄在其中矣。君子忧道不忧贫。”",
                "target": "孔子说：“君子谋求的是道而不去谋求衣食。耕作，常常会有饥饿；学习，往往得到棒禄。君子担忧是否能学到道，不担忧贫穷。”"
            },
            {
                "source": "子曰：“知及之，仁不能守之，虽得之，必失之；知及之，仁能守之，不庄以莅之，则民不敬；知及之，仁能守之，庄以莅之，动之不以礼，未善也。”",
                "target": "孔子说：“靠聪明才智得到它，仁德不能守住它，即使得到了，也一定会丧失。靠聪明才智得到它，仁德能够守住它，但不以庄重的态度来行使职权，那么民众就不敬畏。靠聪明才智得到它，用仁德保持它，能以庄重的态度来行使职权，但不能按照礼来动员，也是不完善的。”"
            },
            {
                "source": "子曰：“君子不可小知而可大受也，小人不可大受而可小知也。”",
                "target": "孔子说：“君子不能让他们做那些小事，但可以让他们承担重大的使命。小人不能让他们承担重大的使命，但可以让他们做那些小事。”"
            },
            {
                "source": "子曰：“民之于仁也，甚于水火。水火，吾见蹈而死者矣，未见蹈仁而死者也。”",
                "target": "孔子说：“老百姓对于仁的需要超过了对于水与火的需要。我只见过人跳到水火中而死的，却没有见过实行仁而死的。”"
            },
            {
                "source": "子曰：“当仁不让于师。”",
                "target": "孔子说：“担当实现仁道的重任，即使和老师相比，也不逊色。”"
            },
            {
                "source": "子曰：“君子贞而不谅。”",
                "target": "孔子说：“君子固守正道，而不拘泥于小信。”"
            },
            {
                "source": "子曰：“事君，敬其事而后其食。”",
                "target": "孔子说：“为君主办事，要认真办事而把自己的吃穿住行放在后边。”"
            },
            {
                "source": "子曰：“有教无类。”",
                "target": "孔子说：“人人都可以接受教育，不分族类。”"
            },
            {
                "source": "子曰：“道不同，不相为谋。”",
                "target": "孔子说：“志向不同的人，就不能在一起谋划。”"
            },
            {
                "source": "子曰：“辞达而已矣。”",
                "target": "孔子说：“言辞只要把意思表达清楚了就行。”"
            },
            {
                "source": "师冕见，及阶，子曰：“阶也。”及席，子曰：“席也。”皆坐，子告之曰：“某在斯，某在斯。”师冕出。子张问曰：“与师言之道与？”子曰：“然，固相师之道也。”",
                "target": "乐师冕来见孔子，走到台阶边，孔子说：“这儿是台阶。”走到坐席旁，孔子说：“这是坐席。”等大家都坐下来，孔子告诉他：“某某在这里，某某在这里。”师冕走了以后，子张就问孔子：“这就是与乐师谈话的道吗？”孔子说：“这就是帮助乐师的道。”"
            }
        ]
    },
    {
        "title": "子张篇",
        "contents": [
            {
                "source": "子张曰：“士见危致命，见得思义，祭思敬，丧思哀，其可已矣。”",
                "target": "子张说：“士人遇见危险时肯献出自己的生命，看见有利可得时能考虑是否符合义的要求，祭祀时能想到是否严肃恭敬，居丧的时候想到自己是否哀伤，这样就可以了。”"
            },
            {
                "source": "子张曰：“执德不弘，信道不笃，焉能为有？焉能为亡？”",
                "target": "子张说：“实行德而不能发扬光大，信仰道而不忠实坚定，这样的人怎么能说有，又怎么说他没有？”"
            },
            {
                "source": "子夏之门人问交于子张，子张曰：“子夏云何？”对曰：“子夏曰：‘可者与之，其不可者拒之。’”子张曰：“异乎吾所闻。君子尊贤而容众，嘉善而矜不能。我之大贤与，于人何所不容？我之不贤与，人将拒我，如之何其拒人也？”",
                "target": "子夏的学生问子张应该怎么交朋友。子张说：“子夏是怎么说的？”答道：“子夏说：‘可以交往的就和他交朋友，不可以交往的就不和他交朋友。’”子张说：“这和我所听到的不一样！君子尊敬贤人，也能够容纳众人，称赞好人，怜悯无能的人。如果我是个很贤明的人，对别人有什么不能容纳的呢？如果我不贤明，别人将会拒绝我，我怎么能去拒绝别人呢？”"
            },
            {
                "source": "子夏曰：“虽小道必有可观者焉，致远恐泥，是以君子不为也。”",
                "target": "子夏说：“即使是小的技艺，也一定有可取之处，但对远大的事业恐怕就行不通了，所以君子不从事这些小技艺。”"
            },
            {
                "source": "子夏曰：“日知其所亡，月无忘其所能，可谓好学也已矣。”",
                "target": "子夏说：“每天能学到一些自己没有的知识，每月不忘自己已掌握的知识，这就可以叫做好学了。”"
            },
            {
                "source": "子夏曰：“博学而笃志，切问而近思，仁在其中矣。”",
                "target": "子夏说：“博览群书并广泛学习，能坚守自己的志向，恳切地发问求教，多考虑当前的事情，仁德就在其中了。”"
            },
            {
                "source": "子夏曰：“百工居肆以成其事，君子学以致其道。”",
                "target": "子夏说：“各行业的工匠要整天在作坊里完成自己分内的工作，君子要终身学习达到实现道的目的。”"
            },
            {
                "source": "子夏曰：“小人之过也必文。”",
                "target": "子夏说：“小人犯了过错一定会加以掩饰。”"
            },
            {
                "source": "子夏曰：“君子有三变：望之俨然，即之也温，听其言也厉。”",
                "target": "子夏说：“君子会使人感到有三种变化：远远望去庄严可畏，接近他时却温和可亲，听他说话则严厉不苟。”"
            },
            {
                "source": "子夏曰：“君子信而后劳其民，未信，则以为厉己也；信而后谏，未信，则以为谤己也。”",
                "target": "子夏说：“君子在得到民众的信任之后才去役劳他们，没有得到信任就去役劳，民众就会认为是在虐害他们。君子得到君主的信任之后才去进谏，没有得到信任就去进谏，君主就会以为是在诽谤自己。”"
            },
            {
                "source": "子夏曰：“大德不逾闲，小德出入可也。”",
                "target": "子夏说：“大节上不能超越界限，小节上有些出入是可以的。”"
            },
            {
                "source": "子游曰：“子夏之门人小子，当洒扫应对进退则可矣。抑末也，本之则无，如之何？”",
                "target": "子游说：“子夏的学生们，做洒水扫地、接待客人、趋进走退一类的事，是可以的，不过这些只是细枝末节的事。根本的学问却没有学到，这怎么行呢？”"
            },
            {
                "source": "子夏闻之，曰：“噫，言游过矣！君子之道，孰先传焉？孰后倦焉？譬诸草木，区以别矣。君子之道焉可诬也？有始有卒者，其惟圣人乎！”",
                "target": "子夏听了，说：“唉，子游错了。君子的学问，哪些先传授、哪些后传授，就好比草木一样，是区分为各种类别的。君子的学问，怎么能歪曲呢？有始有终地循序渐进，大概只有圣人吧！”"
            },
            {
                "source": "子夏曰：“仕而优则学，学而优则仕。”",
                "target": "子夏说：“做官之后还有余力的就可以去学习，学习学好了还有余力，就可以去做官以便给更好地推行仁道。”"
            },
            {
                "source": "子游曰：“丧致乎哀而止。”",
                "target": "子游说：“居丧，充分体现出悲哀之情就可以了。”"
            },
            {
                "source": "子游曰：“吾友张也为难能也，然而未仁。”",
                "target": "子游说：“我的朋友子张可以说是难得的了，然而还没有做到仁。”"
            },
            {
                "source": "曾子曰：“堂堂乎张也，难与并为仁矣。”",
                "target": "曾子说：“子张外表堂堂，难于和他一起做到仁的。”"
            },
            {
                "source": "曾子曰：“吾闻诸夫子，人未有自致者也，必也亲丧乎！”",
                "target": "曾子说：“我听老师曾经说过：人不可能自主地充分发挥感情， 如果有，一定是在父母死亡的时候。”"
            },
            {
                "source": "曾子曰：“吾闻诸夫子，孟庄子之孝也，其他可能也；其不改父之臣与父之政，是难能也。”",
                "target": "曾子说：“我听老师说过，孟庄子的孝，其他人也可以做到，但他不更换父亲的旧臣及其政治措施，这是别人难以做到的。”"
            },
            {
                "source": "孟氏使阳肤为士师，问于曾子。曾子曰：“上失其道，民散久矣。如得其情，则哀矜而勿喜！”",
                "target": "孟氏任命阳肤做典狱官，阳肤向曾子请教。曾子说：“在上位的人丧失了正道，民心离散已经很久了。如果审案时审出真情，就应该悲哀怜悯，而不要沾沾自喜！”"
            },
            {
                "source": "子贡曰：“纣之不善，不如是之甚也。是以君子恶居下流，天下之恶皆归焉。”",
                "target": "子贡说：“纣王的坏，不像传说的那样厉害。因此，君子非常憎恶居于下流，一旦居于下流，天下的一切坏事坏名都会归到他的头上来。”"
            },
            {
                "source": "子贡曰：“君子之过也，如日月之食焉。过也，人皆见之；更也，人皆仰之。”",
                "target": "子贡说：“君子的过错好像日食月食一样。有过错时，人们都看得见；改正过错的时候，人们都仰望着他。”"
            },
            {
                "source": "卫公孙朝问于子贡曰：“仲尼焉学？”子贡曰：“文武之道未坠于地，在人。贤者识其大者，不贤者识其小者，莫不有文武之道焉，夫子焉不学？而亦何常师之有？”",
                "target": "卫国的公孙朝问子贡说：“仲尼的学问是从哪里学来的？”子贡说：“周文王和武王的道，并没有失传，还留在人间。贤能的人可以了解它的根本，不贤的人只记住了细枝末节，周文王和周武王之道是无处不在的。我们老师何处不学，又何必要有固定的老师传播呢？”"
            },
            {
                "source": "叔孙武叔语大夫于朝曰：“子贡贤于仲尼。”子服景伯以告子贡，子贡曰：“譬之宫墙，赐之墙也及肩，窥见室家之好；夫子之墙数仞，不得其门而入，不见宗庙之美、百官之富。得其门者或寡矣，夫子之云不亦宜乎！”",
                "target": "叔孙武叔在朝廷上对大夫们说：“子贡比仲尼更有才能。”子服景伯把这一番话告诉了子贡。子贡说：“就用围墙作比喻吧，我家围墙只有齐肩高，从墙外可以看到里面房屋的美好。我老师的围墙有几仞高，找不到大门走进去，就看不见里面宗庙的雄美、房屋的富丽。能够找到门进去的人并不多。叔孙武叔那么讲，不也是很自然吗？”"
            },
            {
                "source": "叔孙武叔毁仲尼，子贡曰：“无以为也，仲尼不可毁也。他人之贤者，丘陵也，犹可逾也；仲尼，日月也，无得而逾焉。人虽欲自绝，其何伤于日月乎？多见其不知量也。”",
                "target": "叔孙武叔诽谤仲尼。子贡说：“这样做是没有用的！仲尼是毁谤不了的。别人的贤德好比丘陵，还可超越过去，仲尼的贤德好比太阳和月亮，是无法超越的。虽然有人要自绝于日月，对日月又有什么损害呢？只是表明他不自量力而已。”"
            },
            {
                "source": "陈子禽谓子贡曰：“子为恭也，仲尼岂贤于子乎？”子贡曰：“君子一言以为知，一言以为不知，言不可不慎也。夫子之不可及也，犹天之不可阶而升也。夫子之得邦家者，所谓立之斯立，道之斯行，绥之斯来，动之斯和。其生也荣，其死也哀，如之何其可及也？”",
                "target": "陈子禽对子贡说：“你太谦恭了，仲尼岂能比你更有才能？”子贡说：“君子的一句话就可以表现他的智识，一句话也可以表现他的不智，所以说话不可以不慎重。夫子的高不可及，正像天是不能够顺着梯子爬上去一样。假如老师得到国家去治理的话，说要立于礼，百姓就立于礼；引导百姓，百姓就跟着实行；安抚百姓，百姓就会来归服；动员百姓，百姓就会协力同心。他活着时荣耀，死了令人哀痛，别人怎么可能赶得上他呢？”"
            }
        ]
    },
    {
        "title": "子罕篇",
        "contents": [
            {
                "source": "子罕言利与命与仁。",
                "target": "孔子很少谈到利益，却相信天命、赞许仁德。"
            },
            {
                "source": "达巷党人曰：“大哉孔子！博学而无所成名。”子闻之，谓门弟子曰：“吾何执？执御乎，执射乎？吾执御矣。”",
                "target": "达巷党这个地方有人说：“孔子真是伟大啊！他学识渊博，可惜没有使他树立名声的专长。”孔子听说了，对他的学生说：“我应该要做什么好呢？是去驾车呢？还是射箭呢？我还是去驾车吧。”"
            },
            {
                "source": "子曰：“麻冕，礼也；今也纯，俭，吾从众。拜下，礼也；今拜乎上，泰也；虽违众，吾从下。”",
                "target": "孔子说：“用麻线来做礼帽，这是合乎礼的；如今用丝来制作礼帽，这样省俭些，我赞成大家的做法。臣见君，先在堂下磕头，然后升堂磕头，这是合乎礼节的；现在大家都只是升堂磕头，这是倨傲的表现。虽然违反了大家的做法，我还是主张要先在堂下磕头。”"
            },
            {
                "source": "子绝四：毋意、毋必、毋固、毋我。",
                "target": "孔子杜绝了四种弊病：不凭空猜疑，不绝对偏执，不拘泥固执，不惟我独尊。"
            },
            {
                "source": "子畏于匡，曰：“文王既没，文不在兹乎？天之将丧斯文也，后死者不得与于斯文也；天之未丧斯文也，匡人其如予何？”",
                "target": "孔子在匡地被人们围困时，他说：“周文王死了以后，周代的礼乐文化不是保存在我这里吗？上天如果想要消灭这种文化，那我就不可能掌握这种文化了；上天如果不想灭除这种文明礼乐，匡地的人能把我怎么样呢？”"
            },
            {
                "source": "太宰问于子贡曰：“夫子圣者与，何其多能也？”子贡曰：“固天纵之将圣，又多能也。”子闻之，曰：“太宰知我乎？吾少也贱，故多能鄙事。君子多乎哉？不多也。”",
                "target": "太宰问子贡说：“孔夫子是圣人吗？为什么他如此博学多才呢？”子贡说：“这本是上天想让他成为圣人，所以使他博学多才。”孔子听到后说：“太宰怎么会了解我呢？我小时候生活艰难，所以会做很多粗活。君子会有这么多的技艺吗？不会有很多的。”"
            },
            {
                "source": "牢曰：“子云：‘吾不试，故艺。’”",
                "target": "子牢说：“孔子说过，‘我年轻时没有去做官，所以会许多技艺’。”"
            },
            {
                "source": "子曰：“吾有知乎哉？无知也。有鄙夫问于我，空空如也。我叩其两端而竭焉。”",
                "target": "孔子说：“我有知识吗？也会有没有知识的时候。曾经有个乡下人向我提问，我对他的问题无以应答，只有尽可能拉近与他的距离，站在两个人共同对于事件问题的立场上而做到能够完全理解认识问题和知识为止。”"
            },
            {
                "source": "子曰：“凤鸟不至，河不出图，吾已矣夫！”",
                "target": "孔子说：“凤凰不来了，黄河中也不出现八卦图了。我这一生也就完了吧！”"
            },
            {
                "source": "子见齐衰者、冕衣裳者与瞽者，见之，虽少，必作，过之必趋。",
                "target": "孔子对于穿丧服的人、穿礼服戴礼帽的人和盲人，相见的时候，哪怕他们很年轻，也一定会站起身来；经过这些人身边时，他一定快步走过。"
            },
            {
                "source": "颜渊喟然叹曰：“仰之弥高，钻之弥坚。瞻之在前，忽焉在后。夫子循循然善诱人，博我以文，约我以礼，欲罢不能。既竭吾才，如有所立卓尔，虽欲从之，末由也已。”",
                "target": "颜渊感叹地说：“对于老师的知识与道德，愈仰望愈觉得其崇高；越钻研越觉得其艰深。看它好像在前面，忽然间又像在后面。老师善于有步骤地引导我们，用各种文献来丰富我们的知识，用礼来约束我们的行为，我们想要停止学习都不可能。我已经竭尽全力，但它仍在面前高高地耸立着，虽想攀从，却觉无路可走。”"
            },
            {
                "source": "子疾病，子路使门人为臣。病间，曰：“久矣哉，由之行诈也！无臣而为有臣，吾谁欺？欺天乎？且予与其死于臣之手也，无宁死于二三子之手乎！且予纵不得大葬，予死于道路乎？”",
                "target": "孔子生了重病，子路让孔子的门徒充当家臣准备料理丧事。后来，孔子的病好了一些，他说：“仲由很久以来就干这种弄虚作假的事情。仲由做这种欺诈的事情很久啦！我没有家臣而冒充有家臣。我骗谁呢？骗上天吧？与其在家臣的侍候下死去，我宁可在你们这些学生的侍候下死去，这样不是更好吗？而且即使我不能以大夫之礼来安葬，难道会死在路上吗？”"
            },
            {
                "source": "子贡曰：“有美玉于斯，韫椟而藏诸？求善贾而沽诸？”子曰：“沽之哉，沽之哉！我待贾者也。”",
                "target": "子贡说：“这里有一块美玉，是藏在柜子里呢？还是寻求那些识货的商人把它卖掉呢？”孔子回答说：“卖掉吧，卖掉吧！我是等待着那些识货的人来，等到那些真正认得美玉的人来买啊。”"
            },
            {
                "source": "子欲居九夷。或曰：“陋，如之何？”子曰：“君子居之，何陋之有！”",
                "target": "孔子想要搬到九夷地方去居住。有人说：“那里非常落后闭塞，怎么能住呢？”孔子说：“有君子住在那儿，怎么会鄙陋呢？”"
            },
            {
                "source": "子曰：“吾自卫反鲁，然后乐正，《雅》、《颂》各得其所。”",
                "target": "孔子说：“我从卫国回到鲁国以后，才把音乐进行了整理，《雅》和《颂》都有了适当的位置。。”"
            },
            {
                "source": "子曰：“出则事公卿，入则事父兄，丧事不敢不勉，不为酒困，何有于我哉？”",
                "target": "孔子说：“在外便侍公卿，入门便侍奉父兄，有丧事，不敢不勉力去办，不被酒所困扰，这些事我做到了哪些呢？”"
            },
            {
                "source": "子在川上曰：“逝者如斯夫！不舍昼夜。”",
                "target": "孔子在河边说：“时间就像这奔流的河水一样，不分白天黑夜不停地流逝。”"
            },
            {
                "source": "子曰：“吾未见好德如好色者也。”",
                "target": "孔子说：“我没有见过像好色那样好德的人。”"
            },
            {
                "source": "子曰：“譬如为山，未成一篑，止，吾止也；譬如平地，虽覆一篑，进，吾往也。”",
                "target": "孔子说：“比如用土堆山，只差一筐土就完成了，这时候停下来，那是我自己要停下来的；比如在平地上堆山，虽然只倒下一筐，如果决心继续，还是要自己去干的。”"
            },
            {
                "source": "子曰：“语之而不惰者，其回也与！”",
                "target": "孔子说：“听我说话而能毫不懈怠的，只有颜回一个人吧！”"
            },
            {
                "source": "子谓颜渊，曰：“惜乎！吾见其进也，未见其止也。”",
                "target": "孔子对颜渊说：“可惜呀！我只见他不断前进，从来没有看见他停止过。”"
            },
            {
                "source": "子曰：“苗而不秀者有矣夫，秀而不实者有矣夫。”",
                "target": "孔子说：“庄稼有只长苗而不开花的吧！有开了花却不结果实的吧。”"
            },
            {
                "source": "子曰：“后生可畏，焉知来者之不如今也？四十、五十而无闻焉，斯亦不足畏也已。”",
                "target": "孔子说：“年轻人是可敬畏的，怎么知道他们将来赶不上现在的人呢？一个人如果到了四五十岁的时候还没有什么名望，这样的人也就不值得敬畏了。”"
            },
            {
                "source": "子曰：“法语之言，能无从乎？改之为贵。巽与之言，能无说乎？绎之为贵。说而不绎，从而不改，吾末如之何也已矣。”",
                "target": "孔子说：“合乎礼法原则的话，能够不听从吗？但只有按它来改正错误才是可贵的。恭顺赞许的话，听了能够不高兴吗？但只有分析鉴别以后才是可贵的。只顾高兴而不加以分析，表面听从而不加以改正，我也没有什么办法来对付这种人了。”"
            },
            {
                "source": "子曰：“主忠信。毋友不如己者，过，则勿惮改。”",
                "target": "孔子说：“君子应该亲近忠诚和讲信义的人，不要和不如自己的人交朋友，有了过错不要害怕改正。”"
            },
            {
                "source": "子曰：“三军可夺帅也，匹夫不可夺志也。”",
                "target": "孔子说：“军队的首领可以被改变，但是有志气的人的志向是不能被改变的。”"
            },
            {
                "source": "子曰：“衣敝缊袍，与衣狐貉者立而不耻者，其由也与！‘不忮不求，何用不臧？’”子路终身诵之，子曰：“是道也，何足以臧？”",
                "target": "孔子说：“穿着破旧的丝棉袍子，与穿着狐貉裘皮衣服的人站在一起而不觉得羞耻，大概只有仲由吧。《诗经》上说：‘不嫉妒，不贪求，为什么说不好呢？’”子路听了，从此常常念着这句话。孔子又说：“仅仅做到这个样子，又怎么算得上好呢？”"
            },
            {
                "source": "子曰：“岁寒，然后知松柏之后凋也。”",
                "target": "孔子说：“到了一年中寒冷的季节，才知道松树和柏树是最后凋谢的。”"
            },
            {
                "source": "子曰：“知者不惑，仁者不忧，勇者不惧。”",
                "target": "孔子说：“不断求取知识的人就不会被遇到的事情所迷惑；真诚的待人如己，以至于不在为个人得失而忧愁；勇敢的实践前行以至于不在畏惧任何困难。”"
            },
            {
                "source": "子曰：“可与共学，未可与适道；可与适道，未可与立；可与立，未可与权。”",
                "target": "孔子说：“可以一起学习的人，未必能走共同的道路；能走共同的道路的人，未必可以和他事事依礼而行；可以和他事事依礼而行，未必可以和他一起变通灵活处事。”"
            },
            {
                "source": "“唐棣之华，偏其反而。岂不尔思？室是远尔。”子曰：“未之思也，夫何远之有。”",
                "target": "古代有一首诗这样写道：“唐棣树的花，翩翩地摇摆，难道不思念你吗？只是由于家住的地方太远了。”孔子说：“他还是没有真的想念，如果真的想念，有什么觉得遥远呢？”"
            }
        ]
    },
    {
        "title": "子路篇",
        "contents": [
            {
                "source": "子路问政，子曰：“先之，劳之。”请益，曰：“无倦。”",
                "target": "子路问为政之道。孔子说：“自己先要身体力行带好头，然后让老百姓辛勤劳作。”子路请求多讲一些，孔子说：“不要倦怠。”"
            },
            {
                "source": "仲弓为季氏宰，问政，子曰：“先有司，赦小过，举贤才。”曰：“焉知贤才而举之？”曰：“举尔所知。尔所不知，人其舍诸？”",
                "target": "仲弓做了季氏的家臣，询问怎么管理政事。孔子说：“先责成手下负责具体事务的官吏，让他们各负其责，赦免他们的小过错，提拔贤能的人。”仲弓又问：“怎样才能知道哪些人是贤才并把他们选拔出来呢？”孔子说：“选拔你所知道的，那些你所不知道的，别人难道会埋没他吗？”"
            },
            {
                "source": "子路曰：“卫君待子而为政，子将奚先？”",
                "target": "子路说：“卫君等待老师去治理国政,老师打算先从哪儿入手呢？”"
            },
            {
                "source": "子曰：“必也正名乎！”",
                "target": "孔子说：“必须辨正名称!”"
            },
            {
                "source": "子路曰：“有是哉，子之迂也！奚其正？”",
                "target": "子路说：“有这个必要吗？老师绕得太远了！辨正它们干什么呢？”"
            },
            {
                "source": "子曰：“野哉由也！君子于其所不知，盖阙如也。名不正，则言不顺；言不顺，则事不成；事不成，则礼乐不兴；礼乐不兴，则刑罚不中；刑罚不中，则民无所措手足。故君子名之必可言也，言之必可行也。君子于其言，无所苟而已矣。”",
                "target": "孔子说：“仲由，真是鲁莽啊。君子对于自己所不知道的，总是采取存疑的态度。名分不正，说起话来就不顺当合理，说话不顺当合理，事情就办不成。事情办不成，礼乐也就不能兴盛。礼乐不能兴盛，刑罚的执行就不会得当。刑罚不得当，百姓就不知怎么办好。所以，君子一定要定下一个名分，必须能够说得明白，说出来一定能够行得通。君子对于自己的言行，是从来不马虎对待的。”"
            },
            {
                "source": "樊迟请学稼，子曰：“吾不如老农。”",
                "target": "樊迟向孔子请教学习种庄稼。孔子说：“我不如有经验的老农。”"
            },
            {
                "source": "请学为圃，曰：“吾不如老圃。”",
                "target": "樊迟又请教学习种菜。孔子说：“我不如有经验的种菜老农。”"
            },
            {
                "source": "樊迟出，子曰：“小人哉樊须也！上好礼，则民莫敢不敬；上好义，则民莫敢不服；上好信，则民莫敢不用情。夫如是，则四方之民襁负其子而至矣，焉用稼？”",
                "target": "樊迟出去后，孔子说：“樊迟这人真是小人。居于上位的人爱好礼仪，老百姓就没有敢不恭敬的；居于上位的人爱好道义，老百姓就没有敢不服从的；居于上位的人爱好诚信，老百姓就没有敢不诚实的。如果做到了这一点，四面八方的老百姓就会背着自己的小孩来投奔，哪里还需要自己去种庄稼呢？”"
            },
            {
                "source": "子曰：“诵《诗》三百，授之以政，不达；使于四方，不能专对；虽多，亦奚以为？”",
                "target": "孔子说：“熟读了《诗经》三百篇，交给他政务，他却搞不懂；派他出使到四方各国，又不能独立应对外交。虽然读书多，又有什么用处呢？”"
            },
            {
                "source": "子曰：“其身正，不令而行；其身不正，虽令不从。”",
                "target": "孔子说：“自身端正，不用命令人们就会遵行；自身不端正，虽发命令也没有人听从。”"
            },
            {
                "source": "子曰：“鲁卫之政，兄弟也。”",
                "target": "孔子说：“鲁国的政事和卫国的政事，像兄弟一样。”"
            },
            {
                "source": "子谓卫公子荆，“善居室。始有，曰：‘苟合矣。’少有，曰：‘苟完矣。’富有，曰：‘苟美矣。’”",
                "target": "孔子谈到卫国的公子荆时说：“他善于治理家政。当他刚开始有财物时，便说：‘差不多够了。’当稍微多起来时，就说：‘将要足够了。’稍为多一点时，他说：‘差不多就算完备了。’更多一点时，他说：‘差不多算是完美了’。”"
            },
            {
                "source": "子适卫，冉有仆，子曰：“庶矣哉！”冉有曰：“既庶矣，又何加焉？”曰：“富之。”曰：“既富矣，又何加焉？”曰：“教之。”",
                "target": "孔子到卫国去，冉有给他驾车。孔子说：“真是人口众多啊！”冉有说：“人口已经很多了，还要再做什么呢？”孔子说：“让他们富裕起来。”冉有说：“富裕起来后又要做些什么？”孔子说：“对他们进行教化。”"
            },
            {
                "source": "子曰：“苟有用我者，期月而已可也，三年有成。”",
                "target": "孔子说：“假如有人用我主持国家政事，一年之内就可以见到成效了，三年便能成效显著。”"
            },
            {
                "source": "子曰：“‘善人为邦百年，亦可以胜残去杀矣。’诚哉是言也！”",
                "target": "孔子说：“善人治国百年，也就可以消除残暴，废除刑罚杀戮了。这句话说得真对呀！”"
            },
            {
                "source": "子曰：“如有王者，必世而后仁。”",
                "target": "孔子说：“建立一个新的国家，也必须经过三十年才能实现仁政，走上正规发展道路。”"
            },
            {
                "source": "子曰：“苟正其身矣，于从政乎何有？不能正其身，如正人何？”",
                "target": "孔子说：“如果端正了自身的言行，治理国家还有什么困难呢？如果不能端正自身的言行，又怎么去让别人端正呢？”"
            },
            {
                "source": "冉子退朝，子曰：“何晏也？”对曰：“有政。”子曰：“其事也。如有政，虽不吾以，吾其与闻之。”",
                "target": "冉求退朝回来，孔子说：“为什么这么晚？”冉求说：“有政事。”孔子说：“那不过是一般性的事务罢了。如果是重要的政务，即使不用我，我还是会知道的。”"
            },
            {
                "source": "定公问：“一言而可以兴邦，有诸？”",
                "target": "鲁定公问：“一句话就可以使国家兴盛，有这样的话吗？”"
            },
            {
                "source": "孔子对曰：“言不可以若是，其几也。人之言曰：‘为君难，为臣不易。’如知为君之难也，不几乎一言而兴邦乎？”",
                "target": "孔子答道：“不可能有这样的话，但有近乎于这样的话。有人说：‘做君难，做臣不易。’如果知道了做君的难，这不近乎于一句话可以使国家兴盛吗？”"
            },
            {
                "source": "曰：“一言而丧邦，有诸？”",
                "target": "鲁定公又问：“一句话可以亡国，有这样的话吗？”"
            },
            {
                "source": "孔子对曰：“言不可以若是其几也。人之言曰：‘予无乐乎为君，唯其言而莫予违也。’如其善而莫之违也，不亦善乎？如不善而莫之违也，不几乎一言而丧邦乎？”",
                "target": "孔子回答说：“不可能有这样的话，但有近乎这样的话。有人说过：‘我做君主并没有什么可高兴的，我所高兴的只在于我所说的话没有人敢于违抗。’如果说得对而没有人违抗，不也好吗？如果说得不对而没有人违抗，那不就近乎于一句话可以亡国吗？”"
            },
            {
                "source": "叶公问政，子曰：“近者说，远者来。”",
                "target": "叶公问孔子怎样管理政事。孔子说：“使近处的人快乐满意，使远方的人慕名而来。”"
            },
            {
                "source": "子夏为莒父宰，问政，子曰：“无欲速，无见小利。欲速则不达，见小利则大事不成。”",
                "target": "子夏做了莒父地方的长官，问孔子怎样处理政事。孔子说：“做事不要图快，不要只见眼前小利，如果只图快，结果反到达不到目的；只图小利，就办不成大事。”"
            },
            {
                "source": "叶公语孔子曰：“吾党有直躬者，其父攘羊，而子证之。”孔子曰：“吾党之直者异于是。父为子隐，子为父隐，直在其中矣。”",
                "target": "叶公告诉孔子说：“我的家乡有个正直的人，他的父亲偷了别人的羊，他就将他的父亲告发了。”孔子说：“我家乡的正直的人和你讲的正直人不一样：父亲为儿子隐瞒，儿子为父亲隐瞒。正直就在其中了。”"
            },
            {
                "source": "樊迟问仁，子曰：“居处恭，执事敬，与人忠。虽之夷狄，不可弃也。”",
                "target": "樊迟问怎样才是仁。孔子说：“平时的生活起居要端庄恭敬，办事情的时候严肃认真，对待他人要忠诚。就是去边远的少数民族居庄的地方，也是不能废弃这些原则的。”"
            },
            {
                "source": "子贡问曰：“何如斯可谓之士矣？”子曰：“行己有耻，使于四方不辱君命，可谓士矣。”曰：“敢问其次。”曰：“宗族称孝焉，乡党称弟焉。”曰：“敢问其次。”曰：“言必信，行必果，硁硁然小人哉！抑亦可以为次矣。”曰：“今之从政者何如？”子曰：“噫！斗筲之人，何足算也！”",
                "target": "子贡问道：“怎样才可称得上‘士’呢？”孔子说：“能用羞耻之心约束自己的行为，出使不辜负君主的委托，这就可以称作‘士’了。”子贡说：“请问次一等的‘士’是什么样的？”孔子说：宗族的人称赞他孝顺，乡里的人称赞他友爱。”子贡说：“请问再次一等的‘士’是什么样的？”孔子说：“说话一定要诚信，做事一定要坚定果断，这虽是耿直固执的小人，但也可以算是再次一等的‘士’了。”子贡说：“现在的执政者，您看怎么样？”孔子说：“唉！这些器量狭小的人，哪里能数得上呢？”"
            },
            {
                "source": "子曰：“不得中行而与之，必也狂狷乎！狂者进取，狷者有所不为也。”",
                "target": "孔子说：“找不到行为合乎中庸的人而和他们交往，一定只能和勇于向前及洁身自好的人交往！狂者敢作敢为，狷者对有些事是不肯干的。”"
            },
            {
                "source": "子曰：“南人有言曰：‘人而无恒，不可以作巫医。’善夫！”“不恒其德，或承之羞。”子曰：“不占而已矣。”",
                "target": "孔子说：“南方人有句话说：‘人如果没有恒心，就不能当巫医。’这句话说得真好啊！”！”《周易》说：“人不能长期坚持自己的德行，有时候就会遭受羞辱。”孔子说：“这句话是说，没有恒心的人用不着去占卦了。”"
            },
            {
                "source": "子曰：“君子和而不同，小人同而不和。”",
                "target": "孔子说：“君子可以与他周围保持和谐融洽的氛围，但他对待任何事情都持有自己的独立见解，而不是人云亦云，盲目附和；小人则没有自己独立的见解，虽然常和他人保持一致，但实际并不讲求真正的和谐贯通。”"
            },
            {
                "source": "子贡问曰：“乡人皆好之，何如？”子曰：“未可也。”“乡人皆恶之，何如？”子曰：“未可也。不如乡人之善者好之，其不善者恶之。”",
                "target": "子贡问孔子说：“乡里人都喜欢他，那这个人怎么样？”孔子说：“这还不能肯定。”子贡又问孔子说：“乡里人都很厌恶他，那这个人怎么样？”孔子说：“这也是不能肯定的。最好的人是全乡的好人都喜欢他，全乡的坏人都厌恶他。”"
            },
            {
                "source": "子曰：“君子易事而难说也，说之不以道不说也，及其使人也器之；小人难事而易说也，说之虽不以道说也，及其使人也求备焉。”",
                "target": "孔子说：“为君子办事很容易，但是不容易讨他欢心。如果讨他欢心不按照自己的准则，不做好自己的本分，肯定不会成功讨他欢心；但是当君子任用人才的时候，会很器重你。为小人办事很难，但要取得他的欢喜则是很容易的。即使没有按照自己的原则，没有做好自己的本分，这样去讨他欢心，他也会很高兴。但等到他真正使用人的时候，却只会求全责备。”"
            },
            {
                "source": "子曰：“君子泰而不骄，小人骄而不泰。”",
                "target": "孔子说：“君子舒泰自如而不骄矜凌人，小人傲慢无礼而不舒泰自如。”"
            },
            {
                "source": "子曰：“刚、毅、木、讷近仁。”",
                "target": "孔子说：“一个人如果具有刚强、坚毅、朴实、慎言，这四种品德就接近于仁人了。”"
            },
            {
                "source": "子路问曰：“何如斯可谓之士矣？”子曰：“切切偲偲，怡怡如也，可谓士矣。朋友切切偲偲，兄弟怡怡。”",
                "target": "子路问孔子道：“怎样才可以称为士呢？”孔子说：“互相帮助督促而又和睦相处，就可以叫作士了。朋友之间互相勉励督促，兄弟之间和睦相处。”"
            },
            {
                "source": "子曰：“善人教民七年，亦可以即戎矣。”",
                "target": "孔子说：“善人在位教化百姓七年，也能让他们去战场作战了。”"
            },
            {
                "source": "子曰：“以不教民战，是谓弃之。”",
                "target": "孔子说：“如果用没有经过军事训练的老百姓去打仗，这就是让他们去送死。”"
            }
        ]
    },
    {
        "title": "季氏篇",
        "contents": [
            {
                "source": "季氏将伐颛臾，冉有、季路见于孔子，曰：“季氏将有事于颛臾。”",
                "target": "季氏将要讨伐颛臾。冉有、子路去拜见孔子说：“季氏准备攻打颛臾了。”"
            },
            {
                "source": "孔子曰：“求，无乃尔是过与？夫颛臾，昔者先王以为东蒙主，且在邦域之中矣，是社稷之臣也。何以伐为？”",
                "target": "孔子说：“冉求，这难道不是你的过错吗？颛臾从前是周天子让它主持东蒙的祭祀的，而且已经在鲁国的疆域之内，是国家的臣属啊，为什么要讨伐它呢？”"
            },
            {
                "source": "冉有曰：“夫子欲之，吾二臣者皆不欲也。”",
                "target": "冉有说：“季孙大夫想去攻打，我们两个人都不愿意。”"
            },
            {
                "source": "孔子曰：“求，周任有言曰：‘陈力就列，不能者止。’危而不持，颠而不扶，则将焉用彼相矣？且尔言过矣，虎兕出于柙，圭玉毁于椟中，是谁之过与？”",
                "target": "孔子说：“冉求，周任有句话说：‘尽自己的力量去负担你的职务，实在做不好就辞职。’有了危险不去扶助，跌倒了不去搀扶，那还用辅助的人干什么呢？而且你说的话错了。老虎、犀牛从笼子里跑出来，龟甲、玉器在匣子里毁坏了，这是谁的过错呢？”"
            },
            {
                "source": "冉有曰：“今夫颛臾固而近于费，今不取，后世必为子孙忧。”",
                "target": "冉有说：“现在颛臾城墙坚固，而且离费邑很近。现在不把它夺取过来，将来一定会成为子孙的忧患。”"
            },
            {
                "source": "孔子曰：“求，君子疾夫舍曰欲之而必为之辞。丘也闻，有国有家者，不患寡而患不均，不患贫而患不安。",
                "target": "孔子说：“冉求！君子痛恨那些不说自己想那样做却一定要另找借口的人。我听说，对于诸侯和大夫，不怕贫穷而怕财富不均；不怕人口少而怕不安定。"
            },
            {
                "source": "盖均无贫，和无寡，安无倾。夫如是，故远人不服则修文德以来之，既来之，则安之。今由与求也相夫子，远人不服而不能来也，邦分崩离析而不能守也，而谋动干戈于邦内。吾恐季孙之忧不在颛臾，而在萧墙之内也。”",
                "target": "因为财富均衡就没有贫穷，和睦团结就不觉得人口少，境内安定就不会有倾覆的危险。像这样做，远方的人还不归服，那就再修仁义礼乐的政教来招致他们。他们来归服了，就让他们安心生活。现在，仲由和冉求你们辅佐季孙，远方的人不归服却又不能招致他们；国家分崩离析却不能保全守住；反而谋划在国内动用武力。我恐怕季孙的忧患不在颛臾，而在他自己的宫墙之内呢！”"
            },
            {
                "source": "孔子曰：“天下有道，则礼乐征伐自天子出；天下无道，则礼乐征伐自诸侯出。自诸侯出，盖十世希不失矣；自大夫出，五世希不失矣；陪臣执国命，三世希不失矣。天下有道，则政不在大夫；天下有道，则庶人不议。”",
                "target": "孔子说：“世道清明，那么制作礼乐和发令征伐的权力都出自天子。世道混乱，那么制作礼乐和发令征伐的权力都出自诸侯。由诸侯作主决定，大概经过十代很少有不垮台的；由大夫决定，经过五代很少有不垮台的。天下有道，国家政权就不会落在大夫手中。天下有道，老百姓也就不会议论国家政治了。”"
            },
            {
                "source": "孔子曰：“禄之去公室五世矣，政逮于大夫四世矣，故夫三桓之子孙微矣。”",
                "target": "孔子说：“鲁国王室失去国家政权已经有五代了，政权落在大夫之手已经四代了，所以鲁桓公的三家子孙都衰微了。”"
            },
            {
                "source": "孔子曰：“益者三友，损者三友。友直、友谅、友多闻，益矣；友便辟、友善柔、友便佞，损矣。”",
                "target": "孔子说：“有益的朋友有三种，有害的朋友有三种。与正直的人交朋友，与诚实的人交朋友，与见多识广的人交朋友，是有益处的。与走歪门邪道的人交朋友，与谗媚奉迎的人交朋友，与花言巧语的人交朋友，是有害的。”"
            },
            {
                "source": "孔子曰：“益者三乐，损者三乐。乐节礼乐、乐道人之善、乐多贤友，益矣；乐骄乐、乐佚游、乐宴乐，损矣。”",
                "target": "孔子说：“使人受益的有三种爱好，使人受损的也有三种爱好。爱好行事以礼乐为节度，爱好称道别人的优点，爱好多结交有贤德的朋友，都会受益；爱好骄矜傲慢，爱好闲散游荡，爱好沉迷酒食，都会受损。”"
            },
            {
                "source": "孔子曰：“侍于君子有三愆：言未及之而言谓之躁，言及之而不言谓之隐，未见颜色而言谓之瞽。”",
                "target": "孔子说：“侍奉在君子旁边陪他说话，要注意避免犯三种过失：话没有轮到他说却说了，这是急躁；话轮到他说却不说，这叫隐瞒；未曾察言观色就开口，这是瞎子。”"
            },
            {
                "source": "孔子曰：“君子有三戒：少之时，血气未定，戒之在色；及其壮也，血气方刚，戒之在斗；及其老也，血气既衰，戒之在得。”",
                "target": "孔子说：“君子有三种戒忌：年少时，血气不定，要戒除女色；等到到壮年了，血气方刚，需要戒除善斗的心理；等到到老年的时候，血气衰弱了，要戒贪。”"
            },
            {
                "source": "孔子曰：“君子有三畏：畏天命，畏大人，畏圣人之言。小人不知天命而不畏也，狎大人，侮圣人之言。”",
                "target": "孔子说：“君子有三种敬畏：敬畏天命，敬畏王公大人，敬畏圣人的言论。小人不知道天命不可违抗，所以不敬畏它，轻视王公大人，侮慢圣人的言论。”"
            },
            {
                "source": "孔子曰：“生而知之者上也，学而知之者次也；困而学之又其次也。困而不学，民斯为下矣。”",
                "target": "孔子说：“生来就知道的，是上等；经过学习后才知道的，是次等；遇到困惑疑难才去学习的，是又次一等了；遇到困惑疑难仍不去学习的，这种老百姓就是下等的了。”"
            },
            {
                "source": "孔子曰：“君子有九思：视思明，听思聪，色思温，貌思恭，言思忠，事思敬，疑思问，忿思难，见得思义。”",
                "target": "孔子说：“君子有九种思考：看的时候要思考看明白了没，听的时要思考听清楚了没，待人接物时，要想想脸色是否温和，样貌是否恭敬，说话时要想想是否忠实，做事时要想想是否严肃认真，有疑难时要想着询问，气愤发怒时要想想可能产生的后患，看见可得的要想想是否合于义。”"
            },
            {
                "source": "孔子曰：“见善如不及，见不善如探汤；吾见其人矣。吾闻其语矣。隐居以求其志，行义以达其道；吾闻其语矣，未见其人也。”",
                "target": "孔子说：“看到善良的行为，就担心达不到，看到不善良的行动，就好像把手伸到开水中一样赶快避开。我见到过这样的人，也听到过这样的话。以隐居避世来保全自己的志向，依照义而贯彻自己的主张。我听到过这种话，却没有见到过这样的人。”"
            },
            {
                "source": "齐景公有马千驷，死之日，民无德而称焉；伯夷、叔齐饿于首阳之下，民到于今称之。其斯之谓与？”",
                "target": "齐景公有四千匹马，他去世的时候，百姓们觉得他没有什么德行可以称颂。伯夷、叔齐饿死在首阳山下，百姓们到现在还在称颂他们。说的就是这个意思吧。"
            },
            {
                "source": "陈亢问于伯鱼曰：“子亦有异闻乎？”对曰：“未也。尝独立，鲤趋而过庭，曰：‘学《诗》乎？’对曰：‘未也。’‘不学《诗》，无以言。’鲤退而学《诗》。",
                "target": "陈亢问伯鱼：“你在老师那里有得到与众不同的教诲吗？”伯鱼回答说：没有。他曾经独自站在那里，我快步走过庭中，他说：‘学《诗》了吗？’我回答说：‘没有。’他说：不学《诗》就不会应对说话。‘我退回后就学《诗》。"
            },
            {
                "source": "他日，又独立，鲤趋而过庭，曰：‘学《礼》乎？’对曰：‘未也。’‘不学《礼》，无以立。’鲤退而学《礼》。闻斯二者。”陈亢退而喜曰：“问一得三，闻《诗》，闻《礼》，又闻君子之远其子也。”",
                "target": "另一天，他又独自一人站着，我快步走过庭中，他说：‘学《礼》了吗？’我回答说：‘没有。’他说：‘不学礼就不懂得怎样立身。’我回去就学礼。我就听到过这两件事。”陈亢回去高兴地说：“我提一个问题，得到三方面的收获，听了关于《诗》的道理，听了关于礼的道理，又听了君子不偏爱自己儿子的道理。”"
            },
            {
                "source": "邦君之妻，君称之曰夫人，夫人自称曰小童；邦人称之曰君夫人，称诸异邦曰寡小君；异邦人称之亦曰君夫人。",
                "target": "国君的妻子，国君称她为夫人，夫人自称为小童，国人称她为君夫人；对他国人则称她为寡小君，他国人也称她为君夫人。"
            }
        ]
    },
    {
        "title": "学而篇",
        "contents": [
            {
                "source": "子曰：“学而时习之，不亦说乎？有朋自远方来，不亦乐乎？人不知而不愠，不亦君子乎？”",
                "target": "孔子说：“学了知识然后按一定的时间复习它，不也是很愉快吗？有志同道合的人从远方来，不也是很快乐吗？人家不了解我，我也不生气，不也是品德上有修养的人吗？”"
            },
            {
                "source": "有子曰：“其为人也孝弟，而好犯上者，鲜矣；不好犯上而好作乱者，未之有也。君子务本，本立而道生。孝弟也者，其为仁之本与！”",
                "target": "有子说：“一个人如果能够孝顺父母，友爱兄长，还喜欢犯上作乱，这是基本不可能。不喜欢犯上作乱，而喜欢造反的人是没有的。君子应该专心于根本的事务，根本建立了，治国做人的原则也就有了。孝悌，就是人的根本！”"
            },
            {
                "source": "子曰：“巧言令色，鲜矣仁！”",
                "target": "孔子说：“花言巧语，满脸谄媚之色的人，很少会有仁爱之心。”"
            },
            {
                "source": "曾子曰：“吾日三省吾身：为人谋而不忠乎？与朋友交而不信乎？传不习乎？”",
                "target": "曾子说：“我每天多次地反省自己：替别人办事是不是尽心尽力呢 ？跟朋友交往是不是真诚，诚实呢？ 老师传授的知识是否复习过了呢？”"
            },
            {
                "source": "子曰：“道千乘之国，敬事而信，节用而爱人，使民以时。”",
                "target": "孔子说：“治理一个拥有千辆兵车的大国，就应该谨慎地处理国家大事而又恪守信用，诚实无欺，节约财政开支爱惜民力，适时征发力役，应不违农时。”"
            },
            {
                "source": "子曰：“弟子入则孝，出则弟，谨而信，泛爱众，而亲仁，行有余力，则以学文。”",
                "target": "孔子说：“弟子们在家里就要孝顺父母，出门在外，要顺从师长，言行要谨慎，要诚实可信，寡言少语，要博爱大众，亲近仁德的人。这样亲身实践之后，如果还有剩余的时间跟精力，就再去学习文献知识。”"
            },
            {
                "source": "子夏曰：“贤贤易色；事父母，能竭其力；事君，能致其身；与朋友交，言而有信。虽曰未学，吾必谓之学矣。”",
                "target": "子夏说：“一个人能够看重贤德而不以容貌为重；侍奉父母，能够竭尽全力；服侍君主，能够献出自己的生命；跟朋友来往，能够说话诚实恪守信用。这样的人，尽管他自己谦虚说没有学习，我也一定说他已经学习过了。”"
            },
            {
                "source": "子曰：“君子不重则不威，学则不固。主忠信，无友不如己者，过，则勿惮改。”",
                "target": "孔子说：“君子举止不庄重，就没有威严，即使读书，学习的知识也不会牢固。做事应该以忠和信这两种道德为主，不要和不忠不信的人交朋友；犯了错，就不要怕改正。”"
            },
            {
                "source": "曾子曰：“慎终追远，民德归厚矣。”",
                "target": "曾子说：“谨慎的思考人生于天地之间的意义，看看老祖宗们都留下了些什么，在自身与先贤之间做一个对比，应效法先古圣贤。每个人都这样的去思考，人民的道德就自然敦厚了。”"
            },
            {
                "source": "子禽问于子贡曰：“夫子至于是邦也，必闻其政，求之与，抑与之与？”子贡曰：“夫子温、良、恭、俭、让以得之。夫子之求之也，其诸异乎人之求之与？”",
                "target": "子禽问子贡说：“老师去到一个国家，就会知道这个国家的政事。这种事情是他自己求得的呢？还是各个国家的国君主动以自己国家的政事咨询，亲口告诉他的呢？”子贡说：“老师是靠温和、善良、恭敬、节俭、谦逊来取得他们的信任。他老人家参与政事的方式，大概与别人不同吧！"
            },
            {
                "source": "子曰：“父在，观其志；父没，观其行；三年无改于父之道，可谓孝矣。”",
                "target": "孔子说；“当他父亲还活着时，要观察他的志向；在他父亲去世以后，要观察他的行为；若是他能长久的坚持父亲生前正确的原则，这样的人就可以说是尽到孝了。”"
            },
            {
                "source": "有子曰：“礼之用，和为贵。先王之道，斯为美。小大由之。有所不行。知和而和，不以礼节之，亦不可行也。”",
                "target": "有子说：“礼的作用，在于使人的关系变得更加和谐。古代君王治国的方法，宝贵的地方就在这里。但是不论大小事情一味按和谐的办法去做，有的时候又行不通。这是因为为了和谐而和谐，不用礼来节制和谐，也是行不通的。”"
            },
            {
                "source": "有子曰：“信近于义，言可复也。恭近于礼，远耻辱也。因不失其亲，亦可宗也。”",
                "target": "有子说：“讲究信用而合乎事实，说过的话是可以得到实践的；恭敬而能合乎礼节，这样才能远离耻辱。所以依靠的都是可以信赖的人，这样也是值得尊敬的。”"
            },
            {
                "source": "子曰：“君子食无求饱，居无求安，敏于事而慎于言，就有道而正焉。可谓好学也已。”",
                "target": "孔子说：“君子，不追求饮食的饱足，不追求居住的舒适，做事情勤劳敏捷，说话小心谨慎，亲近有德之人来匡正自己，这样就算得上好学了。”"
            },
            {
                "source": "子贡曰：“贫而无谄，富而无骄，何如？”",
                "target": "子贡说：“贫穷却不巴结奉承，富有却不骄傲自大，怎么样？”"
            },
            {
                "source": "子曰：“可也。未若贫而乐，富而好礼者也。”",
                "target": "孔子说：“这样可以算不错了。只是还不如虽贫穷却乐于道，虽然富裕却又好礼的人。”"
            },
            {
                "source": "子贡曰：“《诗》云：‘如切如磋，如琢如磨’，其斯之谓与？”",
                "target": "子贡说：“《诗经》上说，‘要像骨、角、象牙、玉石等的加工一样，先开料，再粗锉，细刻，然后磨光’，就是讲的这个意思吧？”"
            },
            {
                "source": "子曰：“赐也，始可与言《诗》已矣，告诸往而知来者。”",
                "target": "孔子说：“赐呀，你能从我已经讲过的话中领会到我还没有说到的意思，举一反三，我现在可以同你谈论《诗经》了。”"
            },
            {
                "source": "子曰：“不患人之不己知，患不知人也。”",
                "target": "孔子说：“不要担心别人不了解自己，只需要担心自己不了解别人。”"
            }
        ]
    },
    {
        "title": "宪问篇",
        "contents": [
            {
                "source": "宪问耻，子曰：“邦有道，谷；邦无道，谷，耻也。”“克、伐、怨、欲不行焉，可以为仁矣？”子曰：“可以为难矣，仁则吾不知也。”",
                "target": "原宪问孔子什么是可耻。孔子说：“国家太平时，做官拿俸禄；国家政治黑暗时，还做官拿俸禄，这就是可耻。”原宪又问：“好胜、自夸、怨恨、贪婪，这几种毛病都没有的人,可以算仁吗？”孔子说：“可以说是难能可贵，至于是否是仁，我就不能断定了。”"
            },
            {
                "source": "子曰：“士而怀居，不足以为士矣。”",
                "target": "孔子说：“士如果留恋家庭的安逸生活，就不配做士。”"
            },
            {
                "source": "子曰：“邦有道，危言危行；邦无道，危行言孙。”",
                "target": "孔子说：“国家政局清明时，应该说 话正直，行为正直；政局混乱时，应该行 事依旧，但说话要谦逊谨慎些。”"
            },
            {
                "source": "子曰：“有德者必有言，有言者不必有德。仁者必有勇，勇者不必有仁。”",
                "target": "孔子说：“有德行的人一定有善言，有善言的人却不一定有德行。有仁德的人必然勇敢，但勇敢的人不一定有仁德。”"
            },
            {
                "source": "南宫适问于孔子曰：“羿善射，奡荡舟，俱不得其死然；禹、稷躬稼而有天下。”夫子不答。南宫适出，子曰：“君子哉若人！尚德哉若人！”",
                "target": "南宫适向孔子问道：“羿擅长射箭，奡善于水战，都没有得到善终。禹和稷亲自耕作庄稼，却得到了天下。”孔子没有回答。南宫适退出去后，孔子说：“这个人是君子啊！这个人崇尚道德啊！”"
            },
            {
                "source": "子曰：“君子而不仁者有矣夫，未有小人而仁者也。”",
                "target": "孔子说：“君子中也有没有仁德的，而小人之中是不会有有仁德的人的。”"
            },
            {
                "source": "子曰：“爱之，能勿劳乎？忠焉，能勿诲乎？”",
                "target": "孔子说：“爱他，能不以勤劳相劝勉吗？忠于他，能不以善言来教诲他吗？”"
            },
            {
                "source": "子曰：“为命，裨谌草创之，世叔讨论之，行人子羽修饰之，东里子产润色之。”",
                "target": "孔子说：“郑国发表的公文，都是由裨谌起草的，世叔提出意见，外交官子羽加以修饰，由子产作最后修改润色。”"
            },
            {
                "source": "或问子产，子曰：“惠人也。”问子西，曰：“彼哉，彼哉！”问管仲，曰：“人也。夺伯氏骈邑三百，饭疏食，没齿无怨言。”",
                "target": "有人问子产是个什么样的人。孔子说：“是个宽厚慈惠的人。”又问子西是个什么样的人。孔子说：“和子产一样，是个宽厚慈惠的人。”又问管仲是什么样的人，孔子说：“他是个有才能的，他剥夺了伯氏骈邑三百户的封地，使伯氏只能吃相粮，却至死没有怨言。”"
            },
            {
                "source": "子曰：“贫而无怨难，富而无骄易。”",
                "target": "孔子说：“贫穷没有不满抱怨，是很难做到的，富贵了而不骄纵是容易做到的。”"
            },
            {
                "source": "子曰：“孟公绰为赵、魏老则优，不可以为滕、薛大夫。”",
                "target": "孔子说：“孟公绰担任晋国的赵氏、氏的家臣是绰绰有余的，但是做不了滕国和薛国这样小国的大夫。”"
            },
            {
                "source": "子路问成人，子曰：“若臧武仲之知、公绰之不欲、卞庄子之勇、冉求之艺，文之以礼乐，亦可以为成人矣。”曰：“今之成人者何必然？见利思义，见危授命，久要不忘平生之言，亦可以为成人矣。”",
                "target": "子路问怎样做才是一个完美的人。孔子说：“像臧武仲那样有智慧，像孟公绰那样不贪求，像卞庄子那样勇敢，像冉求那样有才艺，再用礼乐来增加他的文采，就可以算个完人了。”孔子又说：“如今的完人何必要这样呢？见到利益能想到道义，遇到危险时肯献出生命，长期处在贫困之中也不忘平生的诺言，也就可以算是完人了。”"
            },
            {
                "source": "子问公叔文子于公明贾曰：“信乎，夫子不言，不笑，不取乎？”公明贾对曰：“以告者过也。夫子时然后言，人不厌其言；乐然后笑，人不厌其笑；义然后取，人不厌其取。”子曰：“其然？岂其然乎？”",
                "target": "孔子向公明贾问到公叔文子，说：“先生他不说话、不笑、不取钱财，是真的吗？”公明贾回答道：“这是告诉你话的那个人的错。先生他到该说话的时候才说，因此别人不厌恶他的话；他等到快乐时才笑，因此别人不厌恶他笑；应该取的时候才取，别人不厌恶他的取。”孔子说：“原来这样，难道真是这样吗？”"
            },
            {
                "source": "子曰：“臧武仲以防求为后于鲁，虽曰不要君，吾不信也。”",
                "target": "孔子说：“臧武仲凭借防邑请求鲁君在鲁国替臧氏立后代，即便有人说他不是要挟君主，我不相信。”"
            },
            {
                "source": "子曰：“晋文公谲而不正，齐桓公正而不谲。”",
                "target": "孔子说：“晋文公诡诈而不正派，齐桓公正派而不诡诈。”"
            },
            {
                "source": "子路曰：“桓公杀公子纠，召忽死之，管仲不死，曰未仁乎？”子曰：“桓公九合诸侯不以兵车，管仲之力也。如其仁，如其仁！”",
                "target": "子路说：“齐桓公杀了公子纠，召忽自杀以殉，但管仲却没有死。管仲不能算是仁人吧？”孔子说：“桓公多次召集各诸侯国盟会，不用武力，都是管仲出的力。这就是他的仁德！这就是他的仁德！”"
            },
            {
                "source": "子贡曰：“管仲非仁者与？桓公杀公子纠，不能死，又相之。”子曰：“管仲相桓公霸诸侯，一匡天下，民到于今受其赐。微管仲，吾其被发左衽矣。岂若匹夫匹妇之为谅也，自经于沟渎而莫之知也。”",
                "target": "子贡说：“管仲不是仁人吧？齐桓公杀了公子纠，他不能以死相殉，反又去辅佐齐桓公。”孔子说：“管仲辅佐齐桓公，称霸诸侯，匡正天下一切，人民到现在还受到他的好处。如果没有管仲，我们大概都会披散着头发，衣襟向左边开了。难道他要像普通男女那样守着小节小信，在山沟中上吊自杀而没有人知道吗？”"
            },
            {
                "source": "公叔文子之臣大夫僎与文子同升诸公，子闻之,曰：“可以为‘文’矣。”",
                "target": "公叔文子的家臣僎和文子一同做了卫国的大夫。孔子听说了这件事，说：“他死后可以给他“文”的谥号了。”"
            },
            {
                "source": "子言卫灵公之无道也，康子曰：“夫如是，奚而不丧？”孔子曰：“仲叔圉治宾客，祝鮀治宗庙，王孙贾治军旅，夫如是，奚其丧？”",
                "target": "孔子讲到卫灵公的昏庸无道，季康子说：“既然如此，为什么他没有败亡呢？”孔子说：“因为他有仲叔圉主管外交，祝鮀管理宗庙祭祀，王孙贾统率军队，这样还怎么败亡呢？”"
            },
            {
                "source": "子曰：“其言之不怍，则为之也难。”",
                "target": "孔子说：“说大话不感到惭愧的人，那么他实现这些话就是很困难的了。”"
            },
            {
                "source": "陈成子弑简公，孔子沐浴而朝，告于哀公曰：“陈恒弑其君，请讨之。”公曰：“告夫三子。”,孔子曰：“以吾从大夫之后，不敢不告也，君曰‘告夫三子’者！”之三子告，不可。孔子曰：“以吾从大夫之后，不敢不告也。”",
                "target": "成子杀了齐简公。孔子在家斋戎沐浴后去朝见鲁哀公，告诉哀公说：“陈恒杀了他的君主，请出兵讨伐他。”哀公说：“你去向季孙、仲孙、孟孙三人报告吧！” 孔子退朝后说：“因为我曾经做过大夫，不敢不来报告。可君主却对我说‘去向那三人报告’。”孔子去向那三位大夫报告，但三位大夫不愿派兵讨伐，孔子又说：“因为我曾经做过大夫，所以不敢不来报告呀！”"
            },
            {
                "source": "子路问事君，子曰：“勿欺也，而犯之。”",
                "target": "子路问怎样事奉君主。孔子说：“不能欺骗他，但是可以直言劝谏。”"
            },
            {
                "source": "子曰：“君子上达，小人下达。”",
                "target": "孔子说：“君子向上通达仁义，小人向下通达财利。”"
            },
            {
                "source": "子曰：“古之学者为己，今之学者为人。”",
                "target": "孔子说：“古时候的人学习是为了提高自身的修养，现在的人学习是为了向别人炫耀。”"
            },
            {
                "source": "蘧伯玉使人于孔子，孔子与之坐而问焉，曰：“夫子何为？”对曰：“夫子欲寡其过而未能也。”使者出，子曰：“使乎！使乎！”",
                "target": "蘧伯玉派使者去拜访孔子。孔子让使者坐下，然后问道：“先生最近在做什么？”使者回答说：“先生想要减少自己的过失但还没能做到。”使者出去之后，孔子说：“好一位使者呀！好一位使者呀！”"
            },
            {
                "source": "子曰：“不在其位，不谋其政。”曾子曰：“君子思不出其位。”",
                "target": "孔子说：“不在那个职位上，就不去考虑那个职位上的事。”曾子说：“君子考虑事情从来不超出自己的职权范围。”"
            },
            {
                "source": "子曰：“君子耻其言而过其行。”",
                "target": "孔子说：“君子以说得多，做得少为耻辱。”"
            },
            {
                "source": "子曰：“君子道者三，我无能焉：仁者不忧，知者不惑，勇者不惧。”子贡曰：“夫子自道也。”",
                "target": "孔子说：“君子所循的三个方面，我都没能做到：仁德的人不忧愁，智慧的人不迷惑，勇敢的人不惧怕。”子贡说道：“是老师对自己的描述。”"
            },
            {
                "source": "子贡方人，子曰：“赐也贤乎哉？夫我则不暇。”",
                "target": "子贡评论别人的短处。孔子说：“赐啊，你真的就那么贤良吗？我可没有闲工夫去评论别人。”"
            },
            {
                "source": "子曰：“不患人之不己知，患其不能也。”",
                "target": "孔子说：“不要担心别人不了解自己，只要担心自己不了解别人。”"
            },
            {
                "source": "子曰：“不逆诈，不亿不信，抑亦先觉者，是贤乎！”",
                "target": "孔子说：“不预先揣度别人在欺诈，也不凭空猜测别人不诚实，却又能及早发觉欺诈与不诚实，这就是贤人了。”"
            },
            {
                "source": "微生亩谓孔子曰：“丘何为是栖栖者与？无乃为佞乎？”孔子曰：“非敢为佞也，疾固也。”",
                "target": "微生亩对孔子说：“您为什么如此奔波忙碌呢？不是为了显示您的才辩吧？”孔子说：“我不敢显示我有才辩，只是讨厌那种顽固不化的人。”"
            },
            {
                "source": "曰：“骥不称其力，称其德也。”",
                "target": "孔子说：“千里马值得称赞的不是它的气力，而是它的品德。”"
            },
            {
                "source": "或曰：“以德报怨，何如？”子曰：“何以报德？以直报怨，以德报德。”",
                "target": "有人说：“用恩德来回报怨恨怎么样？”孔子说：“用什么来回报恩德呢？用正直来回报怨恨，用恩德来回报恩德。”"
            },
            {
                "source": "子曰：“莫我知也夫！”子贡曰：“何为其莫知子也？”子曰：“不怨天，不尤人，下学而上达。知我者其天乎！”",
                "target": "孔子说：“没有人了解我啊！”子贡说：“怎么能说没有人了解您呢？”孔子说：“我不埋怨天，也不责备人，下学礼乐而上达天命，了解我的只有天吧！”"
            },
            {
                "source": "公伯寮愬子路于季孙。子服景伯以告，曰：“夫子固有惑志于公伯寮，吾力犹能肆诸市朝。”子曰：“道之将行也与，命也；道之将废也与，命也。公伯寮其如命何？”",
                "target": "公伯寮向季孙氏控诉子路。子服景伯把这件事告诉了孔子，说：“季孙氏已经被公伯寮迷惑了，我的力量还能让公伯寮的尸首在街头示众。” 孔子说：“道将要实行，是天命决定的；道将要被废弃，也是天命决定的。公伯寮能把天命怎么样呢？”"
            },
            {
                "source": "子曰：“贤者辟世，其次辟地，其次辟色，其次辟言。”子曰：“作者七人矣。”",
                "target": "孔子说：“贤人逃避动荡的社会而隐居，其次避开没有教化的地方，再次避开没有教养的脸色，再次避开没有涵养的言语。”孔子又说：“这样做的已经有七个人了。”"
            },
            {
                "source": "子路宿于石门，晨门曰：“奚自？”子路曰：“自孔氏。”曰：“是知其不可而为之者与？”",
                "target": "子路在石门住宿了一夜。早上守城门的人说：“从哪儿来？”子路说：“从孔子家来。”门人说：“就是那位知道做不成却还要做的人吗？”"
            },
            {
                "source": "子击磬于卫，有荷蒉而过孔氏之门者，曰：“有心哉，击磬乎！”既而曰：“鄙哉，硁硁乎！莫己知也，斯己而已矣。深则厉，浅则揭。”子曰：“果哉！末之难矣。”",
                "target": "孔子在卫国，一次正在敲击磬，有一位挑着草筐的人从孔子的门前走过说：“这个磬击打得有深意啊！”一会儿又说：“声音硁硁的，真可鄙呀，没有人了解自己，就只为自己就是了。（好像涉水一样）水深就穿着衣服趟过去，水浅就撩起衣服趟过去。”孔子说：“说得真干脆，没有什么可以责问他了。”"
            },
            {
                "source": "子张曰：“《书》云，‘高宗谅阴，三年不言。’何谓也？”子曰：“何必高宗，古之人皆然。君薨，百官总己以听于冢宰三年。”",
                "target": "子张说：“《尚书》上说，‘殷高宗守丧，三年不谈政事。’这是什么意思？”孔子说：“不仅是高宗，古人都是这样。国君死了，朝廷百官都各管自己的职事，听命于冢宰三年。”"
            },
            {
                "source": "子曰：“上好礼，则民易使也。”",
                "target": "孔子说：“居上位的人遇事依礼而行，那么百姓就容易指使了。”"
            },
            {
                "source": "子路问君子，子曰：“修己以敬。”曰：“如斯而已乎？”曰：“修己以安人。”曰：“如斯而已乎？”曰：“修己以安百姓。修己以安百姓，尧、舜其犹病诸！”",
                "target": "子路问怎样才能成为君子。孔子说：“常常慎重的培养、训练、教育好自己。”子路说：“这样就可以了吗？”孔子说：“修养自己，使周围的人们安乐。”子路说：“这样就够了吗？”孔子说：“修养自己，使所有百姓都安乐。修养自己使所有百姓都安乐，尧舜还怕难于做到呢？”"
            },
            {
                "source": "原壤夷俟，子曰：“幼而不孙弟，长而无述焉，老而不死，是为贼！”以杖叩其胫。",
                "target": "原壤叉开双腿坐着等待孔子。孔子骂他说：“你年幼时不懂礼节，长大了也毫无成就，老了还不死，真是个害人精。”说着，用手杖敲他的小腿。"
            },
            {
                "source": "阙党童子将命，或问之曰：“益者与？”子曰：“吾见其居于位也，见其与先生并行也。非求益者也，欲速成者也。”",
                "target": "阙里的一个童子来向孔子传话。有人问孔子：“这小孩是肯求上进的人吗？”孔子说：“我看见他坐在成年人的位子上，又见他和长辈并肩而行。这不是个肯求上进的人，只是一个急于求成的人。”"
            }
        ]
    },
    {
        "title": "尧曰篇",
        "contents": [
            {
                "source": "尧曰：“咨！尔舜，天之历数在尔躬，允执其中。四海困穷，天禄永终。”",
                "target": "尧说：“啧啧！你这位舜！上天的大命已经落在你的身上了。真诚地执守中正之道吧！假如天下百姓都困苦贫穷，上天赐给你的禄位也就会永远终止。”"
            },
            {
                "source": "舜亦以命禹。曰：“予小子履，敢用玄牡，敢昭告于皇皇后帝：有罪不敢赦，帝臣不蔽，简在帝心。朕躬有罪，无以万方；万方有罪，罪在朕躬。”",
                "target": "舜也这样告诫过禹。商汤说：“我履谨用黑色的公牛来祭祀，向伟大的天帝祷告：有罪的人我不敢擅自赦免，您的臣仆的善恶我也不隐瞒掩盖，都由天帝的心来分辨、选择。假如我有罪过，做错了事，世上各处的罪过，责任在我帝王身上。”"
            },
            {
                "source": "周有大赉，善人是富。“虽有周亲，不如仁人。百姓有过，在予一人。”",
                "target": "周朝大封诸侯，使善人都富贵起来。周武王说：“我虽然有至亲，不如有仁德之人。百姓有过错，都在我一人身上。”"
            },
            {
                "source": "谨权量，审法度，修废官，四方之政行焉。",
                "target": "认真检查度量衡器，周密地制定法度，修复已废弃的机关工作，全国的政令就会通行了。"
            },
            {
                "source": "兴灭国，继绝世，举逸民，天下之民归心焉。",
                "target": "复兴灭亡了的国家，承续已断绝的宗族，提拔被遗落的人才，天下的百姓就会诚心归服了。"
            },
            {
                "source": "所重：民、食、丧、祭。宽则得众，信则民任焉，敏则有功，公则说。",
                "target": "所重视的是：民众，粮食，丧礼，祭祀。 宽厚就会得到众人的拥护，诚恳守信就会得到民众的信任，勤敏就能取得功绩，公正则大家心悦诚服。"
            },
            {
                "source": "子张问于孔子曰：“何如斯可以从政矣？”",
                "target": "子张问孔子说：“怎样才可以治理政事呢？”"
            },
            {
                "source": "子曰：“尊五美，屏四恶，斯可以从政矣。”",
                "target": "孔子说：“要尊崇五种美德，摒除四种恶政，这样就可以治理政事了。”"
            },
            {
                "source": "子张曰：“何谓五美？”",
                "target": "子张问：“五种美德是什么？”"
            },
            {
                "source": "子曰：“君子惠而不费，劳而不怨，欲而不贪，泰而不骄，威而不猛。”",
                "target": "孔子说：“君子要给百姓以恩惠而自已却无所耗费；使百姓劳作而不使他们怨恨；要追求仁德而不贪图财利；庄重而不傲慢；威严而不凶猛。”"
            },
            {
                "source": "子张曰：“何谓惠而不费？”",
                "target": "子张说：“怎样是使百姓恩惠而自己却无所耗费呢？”"
            },
            {
                "source": "子曰：“因民之所利而利之，斯不亦惠而不费乎？择可劳而劳之，又谁怨？欲仁而得仁，又焉贪？君子无众寡，无小大，无敢慢，斯不亦泰而不骄乎？君子正其衣冠，尊其瞻视，俨然人望而畏之，斯不亦威而不猛乎？”",
                "target": "孔子说：“让百姓们去做对他们有利的事，这不就是对百姓有利而不耗费自己嘛！选择可以让百姓劳作的时间和事情让百姓去做。谁又会有怨言呢？自己要追求仁德便得到了仁，还贪求什么呢？君子对人，无论人多人少，势力是大是小，都会不怠慢他们，这不就是泰然自处而不骄傲吗？君子衣冠整齐，目不斜视，使人见了就让人生敬畏之心，这不也是威严而不凶猛吗？”"
            },
            {
                "source": "子张曰：“何谓四恶？”",
                "target": "子张问：“什么叫四种恶政呢？”"
            },
            {
                "source": "子曰：“不教而杀谓之虐；不戒视成谓之暴；慢令致期谓之贼；犹之与人也，出纳之吝谓之有司。”",
                "target": "孔子说：“不进行教化就杀戮叫作虐，不加申诫便强求别人做出成绩叫作暴，起先懈怠而又突然限期完成叫作贼，好比给人财物，出手吝啬叫作小家子气的官吏。”"
            },
            {
                "source": "孔子曰：“不知命，无以为君子也；不知礼，无以立也；不知言，无以知人也。”",
                "target": "孔子说：“不懂得天命，就不能做君子；不知道礼仪，就不能立身处世；不善于分辨别人的话语，就不能真正了解他。”"
            }
        ]
    },
    {
        "title": "微子篇",
        "contents": [
            {
                "source": "微子去之，箕子为之奴，比干谏而死。孔子曰：“殷有三仁焉。”",
                "target": "微子离开了纣王，箕子做了他的奴隶，比干竭力劝谏纣王被剖心而死。孔子说：““殷朝有这三位仁人啊！”"
            },
            {
                "source": "柳下惠为士师，三黜。人曰：“子未可以去乎？”曰：“直道而事人，焉往而不三黜？枉道而事人，何必去父母之邦？”",
                "target": "柳下惠担任掌管刑罚的官，被罢免了很多次。有人说：“你不可以离开鲁国吗？”柳下惠说：“用正直之道来侍奉人，去哪里而能不被多次罢免呢？不用正直之道来侍奉人，又为什么一定要离开故国家园呢？”"
            },
            {
                "source": "齐景公待孔子曰：“若季氏，则吾不能。”以季、孟之间待之，曰：“吾老矣，不能用也。”孔子行。",
                "target": "齐景公讲到对待孔子的礼节时说：“像鲁国国君对待季氏那样对待孔子，那我做不到，只能用低于季氏而高于孟氏的规格来对待他。”又说：“我老了，不能用了。”孔子离开了齐国。"
            },
            {
                "source": "齐人归女乐，季桓子受之，三日不朝，孔子行。”",
                "target": "齐国人赠送了一些歌女给鲁国，季桓子接受了，三天不上朝。于是孔子离开了。"
            },
            {
                "source": "楚狂接舆歌而过孔子曰：“凤兮凤兮，何德之衰？往者不可谏，来者犹可追。已而已而，今之从政者殆而！”孔子下，欲与之言，趋而辟之，不得与之言。",
                "target": "楚国的狂人接舆唱着歌经过孔子的车旁，他唱道：“凤凰啊，凤凰啊，你的德运怎么这么衰弱呢？过去的已经无可挽回，未来的还可以补救。算了吧，算了吧。现在的当政的那些人太危险！”孔子下车，想同他谈谈，他却赶快避开，孔子没能和他交谈。"
            },
            {
                "source": "长沮、桀溺耦而耕，孔子过之，使子路问津焉。",
                "target": "长沮、桀溺在一起耕种，孔子路过，让子路去打听一下渡口在哪里。"
            },
            {
                "source": "长沮曰：“夫执舆者为谁？”子路曰：“为孔丘。”曰：“是鲁孔丘与？”曰：“是也。”曰：“是知津矣。”",
                "target": "长沮问子路：“那个拿着驾车的人是谁？”子路说：“是孔丘。”长沮又问；“是鲁国的孔丘吗？”子路说：“是的。”长沮说：“那他应该已经知道渡口的位置了。”"
            },
            {
                "source": "问于桀溺，桀溺曰：“子为谁？”曰：“为仲由。”曰：“是鲁孔丘之徒与？”对曰：“然。”曰：“滔滔者天下皆是也，而谁以易之？且而与其从辟人之士也，岂若从辟世之士？”",
                "target": "子路又去向打听桀溺。桀溺说：“你是谁？”子路说：“我是仲由。”桀溺说：“你是鲁国孔丘的弟子吗？”子路说：“是的。”桀溺说：“普天之下到处都像滔滔洪水一样混乱，和谁去改变这种状况呢？况且你与其跟从逃避坏人的人，还不如跟从逃避污浊尘世的人呢？”"
            },
            {
                "source": "耰而不辍。子路行以告，夫子怃然曰：“鸟兽不可与同群，吾非斯人之徒与而谁与？天下有道，丘不与易也。”",
                "target": "说完，仍旧不停地做田里的农活。子路回来后把情况报告给孔子。孔子很失望地说：“人是不能与飞禽走兽合群共处的，如果不同世上的人群打交道还与谁打交道呢？如果天下太平，我就不会与你们一道来从事改革了。”"
            },
            {
                "source": "子路从而后，遇丈人，以杖荷蓧。",
                "target": "子路跟随孔子出行，落在了后面，遇到一个老丈，用拐杖挑着除草的工具。"
            },
            {
                "source": "子路问曰：“子见夫子乎？”丈人曰：“四体不勤，五谷不分，孰为夫子？”",
                "target": "子路问道：“你看到我的老师吗？”老丈说：“四肢不劳动，五谷分不清，谁是你的老师？”"
            },
            {
                "source": "植其杖而芸，子路拱而立。",
                "target": "说完，便扶着拐杖去除草，子路拱着手恭敬地站在一旁。"
            },
            {
                "source": "止子路宿，杀鸡为黍而食之，见其二子焉。",
                "target": "老丈留子路到他家住宿，杀了鸡，做了小米饭给他吃，让自己的两个儿子出来拜见子路。"
            },
            {
                "source": "明日，子路行以告，子曰：“隐者也。”",
                "target": "第二天，子路赶上孔子，把这件事向他作了报告。孔子说：“这是个隐士啊。”"
            },
            {
                "source": "使子路反见之，至则行矣。",
                "target": "叫子路回去再看看他。子路到了那里，老丈已经走了。"
            },
            {
                "source": "子路曰：“不仕无义。长幼之节不可废也，君臣之义如之何其废之？欲洁其身而乱大伦。君子之仕也，行其义也，道之不行已知之矣。”",
                "target": "子路说：“不做官是不合义理的。长幼间的关系，是不可能废弃的；君臣间的关系，怎么能废弃呢？他想不玷污自身，却忽视了君臣间的大伦理。君子出来做官，是为了实行道义。主张不能实行，我早就知道了。”"
            },
            {
                "source": "逸民：伯夷、叔齐、虞仲、夷逸、朱张、柳下惠、少连。",
                "target": "被遗落的人有：伯夷、叔齐、虞仲、夷逸、朱张、柳下惠、少连。"
            },
            {
                "source": "子曰：“不降其志，不辱其身，伯夷、叔齐与！”谓：“柳下惠、少连降志辱身矣，言中伦，行中虑，其斯而已矣。”谓：“虞仲、夷逸隐居放言，身中清，废中权。我则异于是，无可无不可。”",
                "target": "孔子说：“不降低自己的志向，不辱没自己的身份，就是伯夷和叔齐吧！”又说：“柳下惠、少连降低了自己的志向，辱没了自己的身份，但言语合乎伦理，行为经过考虑，也就是如此罢了。”又说：“虞仲、夷逸，避世隐居，放肆直言，立身清白，弃官合乎权宜。我就和他们不一样，没有什么可以，也没有什么不可以。”"
            },
            {
                "source": "太师挚适齐，亚饭干适楚，三饭缭适蔡，四饭缺适秦，鼓方叔入于河，播鼗武入于汉，少师阳、击磬襄入于海。",
                "target": "太师挚到齐国去了，亚饭乐师干到楚国去了，三饭乐师缭到蔡国去了，四饭乐师缺到秦国去了，打鼓的乐师方叔去了黄河地区，敲小鼓的乐师武去了汉水一带，少师阳和击磬的襄到了海滨。"
            },
            {
                "source": "周公谓鲁公曰：“君子不施其亲，不使大臣怨乎不以，故旧无大故则不弃也，无求备于一人。”",
                "target": "周公对鲁公说：“一个有道的国君不疏远他的亲族；不使大臣怨恨没有被任用；故旧朋友如果没有大的过错，就不要抛弃他们；不要对一个人求全责备。”"
            },
            {
                "source": "周有八士：伯达、伯适、仲突、仲忽、叔夜、叔夏、季随、季騧。",
                "target": "周代有八个有名的士人：伯达、伯适、伯突、仲忽、叔夜、叔夏、季随、季。"
            }
        ]
    },
    {
        "title": "泰伯篇",
        "contents": [
            {
                "source": "子曰：“泰伯，其可谓至德也已矣。三以天下让，民无得而称焉。”",
                "target": "孔子说：“泰伯可以说是品德最高尚的人了，多次把王位让给季历，老百姓都找不到恰当的词句来赞美他。”"
            },
            {
                "source": "子曰：“恭而无礼则劳；慎而无礼则葸；勇而无礼则乱；直而无礼则绞。君子笃于亲，则民兴于仁；故旧不遗，则民不偷。”",
                "target": "孔子说：“恭敬却不知礼，就会徒劳无功；谨慎却不知礼，便会畏缩拘谨；勇猛却不知礼，容易莽撞闯祸；心直口快却不知礼，会显得尖利刻薄。君子能厚待自己的亲族，民众中则会兴起仁德的风气；君子不遗弃故交旧朋，那民众便不会对人冷淡漠然了。”"
            },
            {
                "source": "曾子有疾，召门弟子曰：“启予足，启予手。《诗》云：‘战战兢兢，如临深渊，如履薄冰。’而今而后，吾知免夫，小子！”",
                "target": "曾子生病了，把他的学生召集到身边来，说道：“看看我的脚！看看我的手有没有损伤。如何做到没有损伤的呢？如诗所言：‘战战兢兢，如临深渊，如履薄冰。’从今以后，我才知道自己可以免于祸害刑戮了！弟子们！”"
            },
            {
                "source": "曾子有疾，孟敬子问之。曾子言曰：“鸟之将死，其鸣也哀；人之将死，其言也善。君子所贵乎道者三：动容貌，斯远暴慢矣；正颜色，斯近信矣；出辞气，斯远鄙倍矣。笾豆之事，则有司存。”",
                "target": "曾子有病，孟敬子去探望他。曾子对他说：“鸟快要死的时候，鸣叫的声音是悲哀的；人快要死的时候，说出来的话也是善良的。君子所应当重视的道有三个方面：使自己的容貌庄重严肃，这样就可以避免别人的粗暴和怠慢；使自己面色端庄严正，这样就容易使人信服；讲究言辞和声气，这样就可以避免粗野和错误。至于祭祀和礼节仪式，自有主管这些事务的官吏来负责。”"
            },
            {
                "source": "曾子曰：“以能问于不能；以多问于寡；有若无，实若虚，犯而不校。昔者吾友尝从事于斯矣。”",
                "target": "曾子说：“有才能却向没有才能的人请教，知识渊博的人却向知识浅薄的人请教；有学问却像没学问一样；满腹知识却像空虚无所有；即使被冒犯也不去计较。从前我的一位朋友就这样做过了。”"
            },
            {
                "source": "曾子曰：“可以托六尺之孤，可以寄百里之命，临大节而不可夺也。君子人与？君子人也。”",
                "target": "曾子说：“可以把幼小的君主托付给他，可以把国家的政权寄放于他，即使在生死存亡关头也不会妥协。这样的人是君子吗？是君子啊！”"
            },
            {
                "source": "曾子曰：“士不可以不弘毅，任重而道远。仁以为己任，不亦重乎？死而后已，不亦远乎？”",
                "target": "曾子说：“有抱负的人不可以不胸怀宽广，意志坚定，因为他肩负着重大的使命（或责任），路途又很遥远。把实现‘仁’的理想看作自己的使命，不也很重大吗？直到死才停止，这不也是很遥远吗？”"
            },
            {
                "source": "子曰：“兴于《诗》，立于礼，成于乐。”",
                "target": "孔子说：“人的修养从学习《诗》开始，把礼作为立身的根基，掌握音乐使所学得以完成。”"
            },
            {
                "source": "子曰：“民可，使由之。民不可，使知之。”",
                "target": "孔子说：“对于老百姓，只能使他们按照我们的意志去做，不能让他们知道为什么要这样做。”"
            },
            {
                "source": "子曰：“好勇疾贫，乱也。人而不仁，疾之已甚，乱也。”",
                "target": "孔子说：“喜欢勇敢逞强却厌恶贫困，是一种祸害。对不仁的人憎恶太过，也是一种祸害。”"
            },
            {
                "source": "子曰：“如有周公之才之美，使骄且吝，其余不足观也已。”",
                "target": "孔子说：“即使有周公那样美好的才能，如果骄傲而吝啬的话，那其他方面也就不值得一提了。”"
            },
            {
                "source": "子曰：“三年学，不至于谷，不易得也。”",
                "target": "孔子说：“读书三年，不是为了做官谋好职业，这是难能可贵的。”"
            },
            {
                "source": "子曰：“笃信好学，守死善道。危邦不入，乱邦不居。天下有道则见，无道则隐。邦有道，贫且贱焉，耻也；邦无道，富且贵焉，耻也。”",
                "target": "孔子说：“做人要勤奋好学，要坚持真理，坚定信仰。处在危险境地的国家不进入，处在乱世的邦国不去居住。天下国家有正道就现身，荒乱无道就隐退。国家有道，而自己贫穷鄙贱，是耻辱；国家无道，而自己富有显贵，也是耻辱。”"
            },
            {
                "source": "子曰：“不在其位，不谋其政。”",
                "target": "孔子说：“不担任这个职务，就不去过问这个职务范围内的事情。”"
            },
            {
                "source": "子曰：“师挚之始，《关雎》之乱，洋洋乎盈耳哉！”",
                "target": "孔子说：“从太师挚开始演奏，到结尾演奏《关雎》乐曲的时间里，丰富而优美的音乐在我耳边回荡。”"
            },
            {
                "source": "子曰：“狂而不直，侗而不愿，悾悾而不信，吾不知之矣。”",
                "target": "孔子说：“狂妄而不正直，无知又不谨慎老实，表面上诚恳却不守信用，不知道为什么会有这样的人。”"
            },
            {
                "source": "子曰：“学如不及，犹恐失之。”",
                "target": "孔子说：“学习知识就像追赶什么似的，追赶上了又担心会丢失。”"
            },
            {
                "source": "子曰：“巍巍乎！舜、禹之有天下也而不与焉。”",
                "target": "孔子说：“多么崇高啊！舜、禹拥有天下，不是为了自己享受却是为了黎明百姓。”"
            },
            {
                "source": "子曰：“大哉尧之为君也！巍巍乎，唯天为大，唯尧则之。荡荡乎，民无能名焉。巍巍乎其有成功也，焕乎其有文章！”",
                "target": "孔子说：“真伟大啊！真崇高啊！尧这样的君主。只有天最高最大，只有尧能效法于上天。他的恩德多么广大啊，百姓们真不知道该怎么来赞美他。真是崇高啊，他创建的功绩，真是崇高呀！他制定的礼仪制度，真是灿烂美好呀！”"
            },
            {
                "source": "舜有臣五人而天下治。武王曰：“予有乱臣十人。”孔子曰：“才难，不其然乎？唐虞之际，于斯为盛；有妇人焉，九人而已。三分天下有其二，以服事殷。周之德，其可谓至德也已矣。”",
                "target": "舜拥有了五位贤臣，就治理好了天下。周武王也说过：“我有十位能帮助我治理国家的贤臣。”孔子说：“人才难得，难道不是这样吗？唐尧、虞舜时代以及周武王时，人才最盛。然而武王十位治国人才中有一位还是妇女，所以实际上只有九人而已。周文王得了天下的三分之二，仍然事奉殷朝，周朝的道德，可以说是最高的了。”"
            },
            {
                "source": "子曰：“禹，吾无间然矣。菲饮食而致孝乎鬼神，恶衣服而致美乎黼冕，卑宫室而尽力乎沟洫。禹，吾无间然矣。”",
                "target": "孔子说：“对于禹，我对他没什么意见；他的饮食很简单却尽力去孝敬鬼神；衣服简朴，祭祀时却尽量穿得华美，他自己住的宫室很低矮，却把力量完全用于沟渠水利上。禹，我对他确实没有意见了。”"
            }
        ]
    },
    {
        "title": "述而篇",
        "contents": [
            {
                "source": "子曰：“述而不作，信而好古，窃比于我老彭。”",
                "target": "孔子说：“转述先哲的思想而不创立自己的思想，相信而且喜好古代的东西，我私下把自己比做老彭。”"
            },
            {
                "source": "子曰：“默而识之，学而不厌，诲人不倦，何有于我哉？”",
                "target": "孔子说：“默默地记住我所看到的听到的知识，努力学习而从不满足，教导别人而不知疲倦，这些事我做到了多少呢？”"
            },
            {
                "source": "子曰：“德之不修，学之不讲，闻义不能徙，不善不能改，是吾忧也。”",
                "target": "孔子说：“不去修养品德，不去讲习学问，听到义却不追随，有了错误缺点不能改正，这些都是我所忧虑的事情。”"
            },
            {
                "source": "子之燕居，申申如也，夭夭如也。",
                "target": "孔子闲居在家的时候，衣着舒展齐整，仪态温和。"
            },
            {
                "source": "子曰：“甚矣吾衰也！久矣吾不复梦见周公。”",
                "target": "孔子说：“我衰老得很厉害了，我已经好久没有梦见周公了。”"
            },
            {
                "source": "子曰：“志于道，据于德，依于仁，游于艺。”",
                "target": "孔子说：“以道为志向，以德为根据，以仁为依靠，而游憩于礼、乐、射、御、书、数六艺之中。”"
            },
            {
                "source": "子曰：“自行束修以上，吾未尝无诲焉。”",
                "target": "孔子说：“只要谁愿意拿出干肉作为见面礼来拜见我，我从来没有不给他教诲的。”"
            },
            {
                "source": "子曰：“不愤不启，不悱不发，举一隅不以三隅反，则不复也。”",
                "target": "孔子说：“教导学生，不到他冥思苦想仍领会不了的时候，不去开导他；不到他想表达又找不到合适的言辞表达的时候，不去启发他。教给他一个东西，如果他不能举一反三，就不要重复教他了。”"
            },
            {
                "source": "子食于有丧者之侧，未尝饱也。",
                "target": "孔子在有丧事的人旁边吃饭，从来没有吃饱过。"
            },
            {
                "source": "子于是日哭，则不歌。",
                "target": "孔子在这一天为吊丧而哭泣过，就不再唱歌。"
            },
            {
                "source": "子谓颜渊曰：“用之则行，舍之则藏，惟我与尔有是夫！”子路曰：“子行三军，则谁与？”子曰：“暴虎冯河，死而无悔者，吾不与也。必也临事而惧，好谋而成者也。”",
                "target": "孔子对颜渊说：“如果用我，就去积极行动；如果不用我，就藏起来。只有我和你才能这样吧！”子路说：“如果让您率领三军，您愿找谁一起共事呢？”孔子说：“赤手空拳和老虎搏斗，徒步涉水过大河，即使这样死了都不后悔的人，我是不会与他共事的。我所要找的共事的人，一定是遇事谨慎小心，善于谋划而且能完成任务的人。”"
            },
            {
                "source": "子曰：“富而可求也，虽执鞭之士，吾亦为之。如不可求，从吾所好。”",
                "target": "孔子说：“如果富贵合乎于道就可以去追求，即使是手执马鞭做一个车夫，我也愿意去做。如果富贵不合于道就不必去追求，还是做自己喜欢做的事情。”"
            },
            {
                "source": "子之所慎：齐，战，疾。",
                "target": "孔子所谨慎小心对待的是斋戒、战争和疾病这三件事。"
            },
            {
                "source": "子在齐闻《韶》，三月不知肉味，曰：“不图为乐之至於斯也。”",
                "target": "孔子在齐国听了乐曲《韶》后，很长一段时间吃肉也无法尝出肉的滋味，他说：“没想到对音乐的欣赏竟能达到如此高的境界。”"
            },
            {
                "source": "冉有曰：“夫子为卫君乎？”子贡曰：“诺，吾将问之。”入，曰：“伯夷、叔齐何人也？”曰：“古之贤人也。”曰：“怨乎？”曰：“求仁而得仁，又何怨？”出，曰：“夫子不为也。”",
                "target": "冉有问子贡说：“老师会帮助卫国的国君吗？”子贡说：“嗯，我去问问他吧。”于是子贡就进去问孔子：“伯夷、叔齐是什么样的人呢？”孔子说：“古代的贤人。”子贡又问：“他们有怨恨吗？”孔子说：“他们求仁而得到了仁，为什么又怨恨呢？”子贡出来对冉有说：“老师不会帮助卫君。”"
            },
            {
                "source": "子曰：“饭疏食饮水，曲肱而枕之，乐亦在其中矣。不义而富且贵，于我如浮云。”",
                "target": "孔子说：“我整天吃粗粮，喝冷水，弯着胳膊做枕头，也自得其乐。用不正当的手段得来的富贵，我把它看作天上的浮云。”"
            },
            {
                "source": "子曰：“加我数年，五十以学《易》，可以无大过矣。”",
                "target": "孔子说：“再给我增加几年寿命，让我到五十岁时学习《易经》，我便可以没有大的过错了。”"
            },
            {
                "source": "子所雅言，《诗》、《书》、执礼，皆雅言也。",
                "target": "孔子有时讲雅言，读《诗》、念《书》和执行礼事，用的都是雅言。"
            },
            {
                "source": "叶公问孔子于子路，子路不对。子曰：“女奚不曰：其为人也，发愤忘食，乐以忘忧，不知老之将至云尔。”",
                "target": "叶公向子路问孔子是个什么样的人，子路不答。孔子对子路说：“你为什么不这样说：他这个人，发愤用功到连吃饭都忘了，快乐得忘记了忧愁，不知道衰老将要到来等等。”"
            },
            {
                "source": "子曰：“我非生而知之者，好古，敏以求之者也。”",
                "target": "孔子说：“我不是生下来就懂得知识，只是喜爱古代的文化，勤奋敏捷地去求得知识。”"
            },
            {
                "source": "子不语怪、力、乱、神。",
                "target": "孔子不谈论怪异、暴力、变乱、鬼神。"
            },
            {
                "source": "子曰：“三人行，必有我师焉。择其善者而从之，其不善者而改之。”",
                "target": "孔子说：“多个人同行，其中必定有人可以做我的老师。我选择他好的方面向他学习，看到他不善的方面就对照自己改正自己的缺点。”"
            },
            {
                "source": "子曰：“天生德于予，桓魋其如予何？”",
                "target": "孔子说：“上天赋予了我品德，桓魋能把我怎么样？”"
            },
            {
                "source": "子曰：“二三子以我为隐乎？吾无隐乎尔！吾无行而不与二三子者，是丘也。”",
                "target": "孔子说：“弟子们，你们以为我对你们有什么隐瞒没有教授的吗？我没有什么隐瞒不教你们的。我没有一点不向你们公开的，这就是我孔丘的为人。”"
            },
            {
                "source": "子以四教：文，行，忠，信。",
                "target": "孔子教学有四项内容:文献、品行、忠诚、信实。"
            },
            {
                "source": "子曰：“圣人，吾不得而见之矣；得见君子者斯可矣。”子曰：“善人，吾不得而见之矣，得见有恒者斯可矣。亡而为有，虚而为盈，约而为泰，难乎有恒矣。”",
                "target": "孔子说：“圣人我是不可能看到了，能看到君子，这就可以了。”孔子又说：“善人我不可能看到了，能见到始终如一保持好的品德的人，这也就可以了。没有却装作有，空虚却装作充实，穷困却装作富足，这样的人是难于有恒心保持好的品德的。”"
            },
            {
                "source": "子钓而不纲，弋不射宿。",
                "target": "孔子用鱼竿钓鱼而不用渔网捕鱼。用弋射的方式获取猎物，但是从来不射取归巢栖息的鸟兽。"
            },
            {
                "source": "子曰：“盖有不知而作之者，我无是也。多闻，择其善者而从之；多见而识之，知之次也。”",
                "target": "孔子说：“大概有自己不懂却凭空造作的人吧，我却没有这样做过。多听，选择其中好的来学习；多看，然后全部记在心里，这是次一等的智慧。”"
            },
            {
                "source": "互乡难与言，童子见，门人惑。子曰：“与其进也，不与其退也，唯何甚？人洁己以进，与其洁也，不保其往也。”",
                "target": "互乡这地方的人难以同他们交谈，孔子却接见了互乡的一个童子，弟子们都觉得疑惑。孔子说：“我是肯定他的上进，不是肯定他的退步。何必做得太过分呢？别人修饰容仪而来要求上进，就应该赞成他的这种做法，而不要总是抓住他的过去不放。”"
            },
            {
                "source": "子曰：“仁远乎哉？我欲仁，斯仁至矣。”",
                "target": "孔子说：“仁难道离我们很遥远吗？我想要为仁行善，那么仁德就自然而然的到了。”"
            },
            {
                "source": "陈司败问：“昭公知礼乎？”孔子曰：“知礼。”孔子退，揖巫马期而进之，曰：“吾闻君子不党，君子亦党乎？君取于吴，为同姓，谓之吴孟子。君而知礼，孰不知礼？”巫马期以告，子曰：“丘也幸，苟有过，人必知之。”",
                "target": "陈司败问：“鲁昭公懂得礼吗？”孔子说：“他懂得礼。”孔子走出去后，陈司败向巫马期作了个揖，请他走近自己，对他说：“我听说君子不因关系亲近而偏袒，难道君子还偏袒别人吗？鲁君在吴国娶了一个同姓的女子为做夫人，是国君的同姓，称她为吴孟子。如果鲁君算是知礼，还有谁不知礼呢？”巫马期把这句话告诉了孔子。孔子说：“我真是幸运。如果有错误，别人一定会指出来让我知道。”"
            },
            {
                "source": "子与人歌而善，必使反之，而后和之。",
                "target": "孔子与他人一起唱歌，如果那人唱得好，一定会请他再唱一遍， 然后应和他。"
            },
            {
                "source": "子曰：“文，莫吾犹人也。躬行君子，则吾未之有得。”",
                "target": "孔子说：“就书本知识来说，大约我和别人差不多，做一个身体力行的君子，那我还没有做到。”"
            },
            {
                "source": "子曰：“若圣与仁，则吾岂敢？抑为之不厌，诲人不倦，则可谓云尔已矣。”公西华曰：“正唯弟子不能学也。”",
                "target": "孔子说：“把我称作圣人和仁人，我怎么敢当！不过是朝着圣与仁的方向去努力做而不厌倦，教诲别人也从不感觉疲倦，则可以这样说的。”公西华说：“这正是我们这些弟子学不到的。”"
            },
            {
                "source": "子疾病，子路请祷。子曰：“有诸？”子路对曰：“有之。《诔》曰：‘祷尔于上下神祇。’”子曰：“丘之祷久矣。”",
                "target": "孔子病情严重，子路向鬼神祈祷。孔子说：“有这回事吗？”子路说：“有的。《诔》文上说：‘为你向天地神灵祈祷。’”孔子说：“我早就在祈祷了。”"
            },
            {
                "source": "子曰：“奢则不孙，俭则固。与其不孙也，宁固。”",
                "target": "孔子说：“奢侈了就会不恭顺，节俭了就会寒酸。与其不恭顺，宁可寒酸。"
            },
            {
                "source": "子曰：“君子坦荡荡，小人长戚戚。”",
                "target": "孔子说：“君子心胸开阔，神定气安；小人则斤斤计较，患得患失。”"
            },
            {
                "source": "子温而厉，威而不猛，恭而安。",
                "target": "孔子温和而又严厉，有威仪而不凶猛，谦恭而又安祥。"
            }
        ]
    },
    {
        "title": "里仁篇",
        "contents": [
            {
                "source": "子曰：“里仁为美，择不处仁，焉得知？”",
                "target": "孔子说：“居处在仁爱的邻居乡里中才是最美好的，如果你选择的住处不是一个有仁德的地方，怎么能说你是明智的呢？”"
            },
            {
                "source": "子曰：“不仁者不可以久处约，不可以长处乐。仁者安仁，知者利仁。”",
                "target": "孔子说：“没有仁德的人不能长久地处在贫困的境地，也不能长久地处在安乐中的境地。有仁德的人是安于仁道的，有智慧的人则是认识到仁对自己有长远的利益而实行仁。”"
            },
            {
                "source": "子曰：“唯仁者能好人，能恶人。”",
                "target": "孔子说：“只有那些有仁德的人，才能够正确地喜爱应当喜爱的人，厌恶应当厌恶的人。”"
            },
            {
                "source": "子曰：“苟志于仁矣，无恶也。”",
                "target": "孔子说：“如果一个人立志于仁，就不会作恶了。”"
            },
            {
                "source": "子曰：“富与贵，是人之所欲也；不以其道得之，不处也。贫与贱，是人之所恶也；不以其道得之，不去也。君子去仁，恶乎成名？君子无终食之间违仁，造次必于是，颠沛必于是。”",
                "target": "孔子说：“财富和地位，是每个人都向往的；但是，用不正当的手段得到它，就不会接受它。贫穷与低贱，是人们所厌恶的，但是用不正当的手段来摆脱它，宁可不摆脱。君子如果违背了仁德的准则，又怎么能是君子呢？君子不会有吃一顿饭的时间离开仁德，即使在匆忙紧迫的情况下也一定要遵守仁的准则，在颠沛流离的时候也和仁同在。”"
            },
            {
                "source": "子曰：“我未见好仁者，恶不仁者。好仁者，无以尚之；恶不仁者，其为仁矣，不使不仁者加乎其身。有能一日用其力于仁矣乎？我未见力不足者。盖有之矣，我未之见也。”",
                "target": "孔子说：“我没有见过喜欢仁德的人和讨厌不仁德的人。喜欢仁德的人，是再好不过了；讨厌不仁德的人，他实行仁德，只是为了不使不仁德的事物加在自己身上。有谁能一天都把自己的力量用在实行仁德上吗？我还没有看见力量不够的。这种人是有的，只是我还没见过。”"
            },
            {
                "source": "子曰：“人之过也，各于其党。观过，斯知仁矣。”",
                "target": "孔子说：“人们犯的错误，有着不同类型。所以，观察一个人所犯的错误，就可以知道他是什么样的人了。”"
            },
            {
                "source": "子曰：“朝闻道，夕死可矣。”",
                "target": "孔子说：“早晨得知了真理，就算是当晚死去，也没有遗憾了。”"
            },
            {
                "source": "子曰：“士志于道，而耻恶衣恶食者，未足与议也。”",
                "target": "孔子说：“有德行道艺而将出仕的人立志于追求真理，但又以自己穿着破烂衣服、吃着粗糙的饭食为耻辱，这种人是不值得与他谈论真理的。”"
            },
            {
                "source": "子曰：“君子之于天下也，无适也，无莫也，义之与比。”",
                "target": "孔子说：“君子对于天下的事情，没有规定一定要怎样做，只考虑怎样去做就行。”"
            },
            {
                "source": "子曰：“君子怀德，小人怀土；君子怀刑，小人怀惠。”",
                "target": "孔子说：“君子心中所想的是仁德，小人心中所想的是乡土；君子关心的是刑罚和法度，小人则关心私利。”"
            },
            {
                "source": "子曰：“放于利而行，多怨。”",
                "target": "孔子说：“做事只为追求私利，必定会招来很多怨恨。”"
            },
            {
                "source": "子曰：“能以礼让为国乎？何有？不能以礼让为国，如礼何？”",
                "target": "孔子说：“能用礼让的原则来治理国家吗？难道这有什么困难吗？如果不能用礼让的原则来治理国家，又怎么能实行礼制呢？”"
            },
            {
                "source": "子曰：“不患无位，患所以立；不患莫已知，求为可知也。”",
                "target": "孔子说：“不要老是想着官位，要担心自己有没有能力胜任这个职务。不担心没有人知道自己，而要努力使别人知道自己的本领。”"
            },
            {
                "source": "子曰：“参乎！吾道一以贯之。”曾子曰：“唯。”子出，门人问曰：“何谓也？”曾子曰：“夫子之道，忠恕而已矣。”",
                "target": "孔子说：“曾参呀！我的学说可以用一个根本的原则贯通起来。”曾参答道：“是的。”孔子走出去以后，其他学生问道：“这是什么意思？”曾子说：“老师的道，就是忠恕罢了。”"
            },
            {
                "source": "子曰：“君子喻于义，小人喻于利。”",
                "target": "孔子说：“君子通晓大义，小人只知道小利。”"
            },
            {
                "source": "子曰：“见贤思齐焉，见不贤而内自省也。”",
                "target": "孔子说：“看见有才能的人德才兼备的人就向他学习，希望能向他看齐；看见不贤的人，就反省自己有没有和他一样的缺点，有要改正。”"
            },
            {
                "source": "子曰：“事父母几谏，见志不从，又敬不违，劳而不怨。”",
                "target": "孔子说：“事奉父母，对于他们一些不对的地方要委婉地劝说。自己的意见没有被采纳，仍然要对他们恭恭敬敬不触犯他们，替他们操劳而不怨恨。”"
            },
            {
                "source": "子曰：“父母在，不远游，游必有方。”",
                "target": "孔子说：“父母还健在时，就不要远离他们；如果一定要出远门，也必须有一定的地方。”"
            },
            {
                "source": "子曰：“三年无改于父之道，可谓孝矣。”",
                "target": "孔子说：“父亲去世很久以后，他依旧还是像他父亲生前那样坚持固有的为人准则，那么这个人就算是做到了孝。”"
            },
            {
                "source": "子曰：“父母之年，不可不知也。一则以喜，一则以惧。”",
                "target": "孔子说：“父母的年纪，不可不知道并且常常记在心里。一方面为他们的长寿而高兴，一方面又为他们的衰老而恐惧。”"
            },
            {
                "source": "子曰：“古者言之不出，耻躬之不逮也。”",
                "target": "孔子说：“古代的君子从不轻易发表言论，他们以说了而做不到为耻。”"
            },
            {
                "source": "子曰：“以约失之者鲜矣。”",
                "target": "孔子说：“用礼来约束自己，犯错误的人就少了。”"
            },
            {
                "source": "子曰：“君子欲讷于言而敏于行。”",
                "target": "孔子说：“君子总是说话谨慎，做事情行动敏捷。”"
            },
            {
                "source": "子曰：“德不孤，必有邻。”",
                "target": "孔子说：“品德高尚的人是不会孤立的，一定会有志同道合的人与他相处。”"
            },
            {
                "source": "子游曰：“事君数，斯辱矣；朋友数，斯疏矣。”",
                "target": "子游说：“太频繁的出现在国君的身边，就会为自己招致羞辱；劝告朋友过于频繁，反而会被疏远。”"
            }
        ]
    },
    {
        "title": "阳货篇",
        "contents": [
            {
                "source": "阳货欲见孔子，孔子不见，归孔子豚。",
                "target": "阳货想要孔子去拜见他，孔子不去拜见，他便送给孔子一头熟了的小猪。"
            },
            {
                "source": "孔子时其亡也而往拜之，遇诸涂。",
                "target": "孔子打听到他不在家时，前往他那里去回拜表谢。却在途中遇见阳货。"
            },
            {
                "source": "谓孔子曰：“来，予与尔言。”曰：“怀其宝而迷其邦，可谓仁乎？”曰：“不可。”“好从事而亟失时，可谓知乎？”曰：“不可！”“日月逝矣，岁不我与！”孔子曰：“诺，吾将仕矣。”",
                "target": "阳货对孔子说：“来！我同你说话。”孔子走过去，阳货说：“一个人怀藏本领却听任国家迷乱，可以叫作仁吗？”孔子说：“不可以。”“喜好参与政事而屡次错失时机，可以叫作聪明吗？”孔子说：“不可以。”时光很快地流逝了，岁月是不等人的。孔子说：“好吧，我将去做官了。”"
            },
            {
                "source": "子曰：“性相近也，习相远也。”",
                "target": "孔子说：“人的原始天性是相近的，只是在后天不同的环境中受到不同的影响后才会产生区别。”"
            },
            {
                "source": "子曰：“唯上知与下愚不移。”",
                "target": "孔子说：“只有上等的智者与下等的愚者是改变不了的。”"
            },
            {
                "source": "子之武城，闻弦歌之声。夫子莞尔而笑，曰：“割鸡焉用牛刀？”子游对曰：“昔者偃也闻诸夫子曰：‘君子学道则爱人，小人学道则易使也。’”子曰：“二三子，偃之言是也！前言戏之耳。”",
                "target": "孔子到武城，听见弹琴唱歌的声音。孔子微笑着说：“杀鸡何必用宰牛的刀呢？”子游回答说：“以前我听先生说过，‘君子学习了礼乐就能爱人，普通人学习了礼乐就容易指使。’”孔子说：“弟子们，言偃说的对。我刚才说的话只是跟他开玩笑罢了。”"
            },
            {
                "source": "公山弗扰以费畔，召，子欲往。子路不说，曰：“末之也已，何必公山氏之之也？”子曰：“夫召我者而岂徒哉？如有用我者，吾其为东周乎！”",
                "target": "公山弗扰据费邑反叛，来召孔子，孔子准备去。子路不高兴地说：“没有地方去就算了，何必到公山氏那里去呢？”孔子说：“那召我去的人，岂会让我白去一趟吗？如果有任用我的人，我就会使周朝的政德在东方复兴。”"
            },
            {
                "source": "子张问仁于孔子，孔子曰：“能行五者于天下为仁矣。”请问之，曰：“恭、宽、信、敏、惠。恭则不侮，宽则得众，信则人任焉，敏则有功，惠则足以使人。”",
                "target": "子张向孔子问仁。孔子说：“能够在天下实行五种品德。就是仁了。”子张说：“请问哪五种。”孔子说：“庄重、宽厚、诚实、勤敏、慈惠。庄重就不致遭受侮辱，宽厚就会得到众人的拥护，诚信就能得到别人的任用，勤敏就会提高工作效率，慈惠就能够使唤人。”"
            },
            {
                "source": "佛肸召，子欲往。子路曰：“昔者由也闻诸夫子曰：‘亲于其身为不善者，君子不入也。’佛肸以中牟畔，子之往也，如之何？”子曰：“然，有是言也。不曰坚乎，磨而不磷；不曰白乎，涅而不缁。吾岂匏瓜也哉？焉能系而不食？”",
                "target": "佛肸召孔子去，孔子打算前去。子路说：“以前我我在老师这里听过：‘亲自行不善的人，君子是不会去的。’现在佛肸在中牟发动叛乱，你却要去，这是怎么回事呢？”孔子说：“是的，我说过这样的话。不是说坚硬的东西磨了以后不变薄？不是说洁白的东西染了以后不变黑吗？我难道是个苦味的葫芦吗？怎么能只挂在那里而不给人吃呢？”"
            },
            {
                "source": "子曰：“由也，女闻六言六蔽矣乎？”对曰：“未也。”“居！吾语女。好仁不好学，其蔽也愚；好知不好学，其蔽也荡；好信不好学，其蔽也贼；好直不好学，其蔽也绞；好勇不好学，其蔽也乱；好刚不好学，其蔽也狂。”",
                "target": "孔子说：“仲由呀，你听说过六种品德和六种弊病了吗？”子路回答说：“没有。”孔子说：“坐下，我来告诉你。爱仁德而不好学习，它的弊病是会变得愚蠢；爱智慧而不好学习，它的弊病是会放荡不羁；爱诚信而不好学习，它的弊病是容易被人利用，害己害人；爱直率却不好学习，它的弊病是说话尖刻刺人；爱好勇敢却不爱好学习，它的弊病是犯上作乱；爱好刚强却不爱好学习，它的弊病是狂妄自大。”"
            },
            {
                "source": "子曰：“小子何莫学夫《诗》？《诗》可以兴，可以观，可以群，可以怨。迩之事父，远之事君，多识于鸟兽草木之名。”",
                "target": "孔子说：“学生们为什么不学习《诗》呢？学《诗》可以激发人的情志，可以提高人的观察力，可以使人懂得集体意识的重要性，可以使人懂得怎样去讽谏上级。近可以用来事奉父母，远可以事奉君主；还可以多知道一些鸟兽草木的名字。”"
            },
            {
                "source": "子谓伯鱼曰：“女为《周南》、《召南》矣乎？人而不为《周南》、《召南》，其犹正墙面而立也与！”",
                "target": "孔子对伯鱼说：“你学习《周南》《召南》了吗？一个人如果连《周南》《召南》都不学习，那就像面对墙壁而站着吧？”"
            },
            {
                "source": "子曰：“礼云礼云，玉帛云乎哉？乐云乐云，钟鼓云乎哉？”",
                "target": "孔子说：“礼节礼节，只是说的玉帛之类的礼器迎来送往吗？音乐音乐，只是说的敲敲打打钟鼓之类的乐器吗？”"
            },
            {
                "source": "子曰：“色厉而内荏，譬诸小人，其犹穿窬之盗也与？”",
                "target": "孔子说：“外表强硬，内心虚弱，以小人作比喻，大概就像钻墙洞的盗贼吧？”"
            },
            {
                "source": "子曰：“乡愿，德之贼也。”",
                "target": "孔子说：“是非不分的老好人，是道德的败坏者。”"
            },
            {
                "source": "子曰：“道听而涂说，德之弃也。”",
                "target": "孔子说：“把听到的传闻就到处去传播，这是道德所唾弃的。”"
            },
            {
                "source": "子曰：“鄙夫可与事君也与哉？其未得之也，患得之；既得之，患失之。苟患失之，无所不至矣。”",
                "target": "孔子说：“可以跟品质低下的人一起侍奉君主吗？他还没有得到职位的时候，总担心得不到。得到职位后，又怕失去它。如果他担心失掉官职，那他就什么事都干得出来了。”"
            },
            {
                "source": "子曰：“古者民有三疾，今也或是之亡也。古之狂也肆，今之狂也荡；古之矜也廉，今之矜也忿戾；古之愚也直，今之愚也诈而已矣。”",
                "target": "孔子说：“古代人有三种毛病，现在恐怕连这三种毛病也不是原来的样子了。古代的狂人是轻率肆意，现在的狂人则是放荡不羁；古代矜持的人是棱角分明，现在矜持的人是恼羞成怒，强词夺理古代愚笨的人是憨直，现在愚笨的人是欺诈伪装罢了。”"
            },
            {
                "source": "子曰：“巧言令色，鲜矣仁。”",
                "target": "孔子说：“花言巧语，装出和颜悦色的样子，这种人的仁心就很少了。”"
            },
            {
                "source": "子曰：“恶紫之夺朱也，恶郑声之乱雅乐也，恶利口之覆邦家者。”",
                "target": "孔子说：“憎恶紫色夺去红色的光彩和地位，憎恶郑国的乐曲淆乱典雅正统的乐曲，憎恶用巧言善辩颠覆国家的人。”"
            },
            {
                "source": "子曰：“予欲无言。”子贡曰：“子如不言，则小子何述焉？”子曰：“天何言哉？四时行焉，百物生焉，天何言哉？”",
                "target": "孔子说：“我想不说话了。”子贡说：“您如果不说话，那么我们这些学生还传述什么呢？”孔子说：“天说过什么话呢？四季照常运行，万物照样生长。天说了什么话呢？”"
            },
            {
                "source": "孺悲欲见孔子，孔子辞以疾。将命者出户，取瑟而歌，使之闻之。",
                "target": "孺悲想见孔子，孔子以生病为由推辞不见。传话的人刚出门，孔子便取来瑟边弹边唱，故意让孺悲听到。"
            },
            {
                "source": "宰我问：“三年之丧，期已久矣！君子三年不为礼，礼必坏；三年不为乐，乐必崩。旧谷既没，新谷既升，钻燧改火，期可已矣。”子曰：“食夫稻，衣夫锦，于女安乎？”曰：“安！”“女安则为之！夫君子之居丧，食旨不甘，闻乐不乐，居处不安，故不为也。今女安，则为之！”宰我出，子曰：“予之不仁也！子生三年，然后免于父母之怀。夫三年之丧，天下之通丧也，予也有三年之爱于其父母乎！”",
                "target": "宰我问：“父母去世，服丧三年，时间太长了。君子三年不讲究礼仪，礼仪必然败坏；三年不演奏音乐，音乐就会荒废。旧谷已经吃完，新谷已经登场，取火用的燧木已经轮换了一遍，服丧一年就可以了。”孔子说：“丧期不满三年你就吃大米饭，穿锦缎，对你来说心安吗？”宰我说：“我心安。”孔子说：“你心安，就那样去做吧！君子服丧，吃美味不觉得香甜，听音乐不感到快乐，住在家里不觉得舒适安宁，所以不那样做。如今你既觉得心安，你就那样去做吧！”宰我出去后，孔子说：“宰予真是不仁啊！小孩生下来，到三岁时才能离开父母的怀抱。服丧三年，这是天下通行的丧礼。难道宰子对他的父母没有三年的爱吗？”"
            },
            {
                "source": "子曰：“饱食终日，无所用心，难矣哉！不有博弈者乎？为之犹贤乎已。”",
                "target": "孔子说：“整天吃饱了饭，什么心思也不用，这真的是太难了！不是有掷骰子、下围棋之类的游戏吗？做做这些，也比什么都不做的好。”"
            },
            {
                "source": "子路曰：“君子尚勇乎？”子曰：“君子义以为上。君子有勇而无义为乱，小人有勇而无义为盗。”",
                "target": "子路说：“君子崇尚勇敢吗？”孔子答道：“君子以义作为最高尚的品德，君子有勇无义就会作乱，小人有勇无义就会偷盗。”"
            },
            {
                "source": "子贡曰：“君子亦有恶乎？”子曰：“有恶。恶称人之恶者，恶居下流而讪上者，恶勇而无礼者，恶果敢而窒者。”曰：“赐也亦有恶乎？”“恶徼以为知者，恶不孙以为勇者，恶讦以为直者。”",
                "target": "子贡问：“君子也有憎恶的人或事吗？，孔子说：“是有所憎恶的。憎恶宣扬别人过错的人，憎恶身居下位而毁谤身居上位的人，憎恶勇敢而无礼的人，憎恶果敢而顽固不化的人。”孔子又说：“赐，你也有厌恶的事吗？”子贡说：“厌恶偷袭别人的成绩而作为自己的知识的人，厌恶把不谦虚当做勇敢的人，厌恶揭发别人的隐私而自以为直率的人。”"
            },
            {
                "source": "子曰：“唯女子与小人为难养也，近之则不逊，远之则怨。”",
                "target": "孔子说：“唯独女子和小人是难以相处，亲近他们，他们就不会尊重你，疏远他们，他们就会怨恨你。”"
            },
            {
                "source": "子曰：“年四十而见恶焉，其终也已。”",
                "target": "孔子说：“到了四十岁的时候还被人所厌恶，他这一生也就终结了。”"
            }
        ]
    },
    {
        "title": "雍也篇",
        "contents": [
            {
                "source": "子曰：“雍也可使南面。”",
                "target": "孔子说：“冉雍啊，可以让他去做官。”"
            },
            {
                "source": "仲弓问子桑伯子，子曰：“可也，简。”仲弓曰：“居敬而行简，以临其民，不亦可乎？居简而行简，无乃大简乎？”子曰：“雍之言然。”",
                "target": "仲弓问孔子桑伯子这个人怎么样，孔子说：“这个人还可以，他办事简要。”仲弓说：“居心恭敬严肃而行事简要，像这样来治理百姓，不是也可以吗？如果态度马虎粗疏，又以简要的方法办事，那不是太简单了吗？”孔子说：“这话你说得对。”"
            },
            {
                "source": "哀公问：“弟子孰为好学？”孔子对曰：“有颜回者好学，不迁怒，不贰过，不幸短命死矣，今也则亡，未闻好学者也。”",
                "target": "鲁哀公问孔子：“你的弟子中谁最爱学习？”孔子回答说：“有一个叫颜回的弟子最好学，他从不迁怒于别人，也不重犯同样的过错。只是很不幸他早早去世了。现在已经没有他那样的人了，再也没听到谁爱好学习的了。”"
            },
            {
                "source": "子华使于齐，冉子为其母请粟，子曰：“与之釜。”请益，曰：“与之庾。”冉子与之粟五秉。子曰：“赤之适齐也，乘肥马，衣轻裘。吾闻之也，君子周急不继富。”",
                "target": "子华出使齐国，冉有替他的母亲向孔子请求补助一些谷米。孔子说：“给她六斗四升。”冉求请求再增加一些。孔子说：“再给她二斗四升。”冉求却给他八百斗。孔子说：“公西赤到齐国去，乘坐着健壮的马匹驾的车子，穿着又暖和又轻便的皮袍。我听人说：君子只周济急需救济的人，而不是周济富人的人。”"
            },
            {
                "source": "原思为之宰，与之粟九百，辞。子曰：“毋，以与尔邻里乡党乎！”",
                "target": "原思做孔子家的总管，孔子给他的酬劳是九百斗小米，原思推辞不要。孔子说：“不要推辞。如果多了就给你的乡亲们吧。”"
            },
            {
                "source": "子谓仲弓曰：“犁牛之子骍且角，虽欲勿用，山川其舍诸？”",
                "target": "孔子在评论仲弓的时候说：“耕牛产下的牛犊长着红色的毛，角也长得整齐端正，人们虽想不用它做祭品，但山川之神难道会舍弃它吗？”"
            },
            {
                "source": "子曰：“回也，其心三月不违仁，其余则日月至焉而已矣。”",
                "target": "孔子说：“颜回这个人，他的心中长久地不离开仁德，其余的学生则只能短暂的做到这样。”"
            },
            {
                "source": "季康子问：“仲由可使从政也与？”子曰：“由也果，于从政乎何有？”曰：“赐也可使从政也与？”曰：“赐也达，于从政乎何有？”曰：“求也可使从政也与？”曰：“求也艺，于从政乎何有？”",
                "target": "季康子问孔子：“仲由可以让他参与国家政事吗？”孔子说：“仲由做事果断，参与国家政事有什么困难呢？”季康子又问：“端木赐可以让他参与国家政事吗？”孔子说：“端木赐通达事理，对于参与政事有什么困难呢？”又问：“冉求可以让他参与国家政事吗？”孔子说：“冉求有才能，对于参与国家政事有什么困难呢？”"
            },
            {
                "source": "季氏使闵子骞为费宰，闵子骞曰：“善为我辞焉。如有复我者，则吾必在汶上矣。”",
                "target": "季氏派人请闵子骞去做费邑的长官，闵子骞对着来的人说：“请好好的替我推辞吧！如果再来召我，那我一定跑到汶水那边去了。”"
            },
            {
                "source": "伯牛有疾，子问之，自牖执其手，曰：“亡之，命矣夫！斯人也而有斯疾也！斯人也而有斯疾也！”",
                "target": "伯牛生病了，孔子就去探望他，从窗户外面握着他的手说：“没有办法呀，这是命里注定的吧！这样的人竟会得这样的病啊，这样的人竟会得这样的病啊！”"
            },
            {
                "source": "子曰：“贤哉回也！一箪食，一瓢饮，在陋巷，人不堪其忧，回也不改其乐。贤哉，回也！”",
                "target": "孔子说：“颜回的品质是多么高尚啊！一竹篮饭，一瓢水，住在简陋的小巷子里，别人都忍受不了这种穷困清苦，颜回却没有改变他好学的乐趣。颜回的品质是多么高尚啊！”"
            },
            {
                "source": "冉求曰：“非不说子之道，力不足也。”子曰：“力不足者，中道而废，今女画。”",
                "target": "冉求说：“我不是不喜欢老师您所讲的学说，而是我的能力不够呀。”孔子说：“能力不够的人是到半路才停下来，而你却画地为牢，不肯前进。”"
            },
            {
                "source": "子谓子夏曰：“女为君子儒，无为小人儒。”",
                "target": "孔子对子夏说：“你要做君子儒，不要做小人儒。”"
            },
            {
                "source": "子游为武城宰，子曰：“女得人焉尔乎？”曰：“有澹台灭明者，行不由径，非公事，未尝至于偃之室也。”",
                "target": "子游做了武城的长官。孔子说：“你在那里得到了人才没有？”子游回答说：“有一个叫澹台灭明的人，从来不走邪路，没有公事从不到我屋子里来。”"
            },
            {
                "source": "子曰：“孟之反不伐，奔而殿，将入门，策其马曰：‘非敢后也，马不进也。’”",
                "target": "孔子说：“孟之反不喜欢夸耀自己。战败时，他留在最后掩护全军撤退。快进城门的时候，他鞭打着自己的马说，‘不是我敢于殿后，是我的马跑不快。’”"
            },
            {
                "source": "子曰：“不有祝鮀之佞，而有宋朝之美，难乎免于今之世矣。”",
                "target": "孔子说：“如果没有祝鮀那样的口才，只有宋国公子朝那样的美貌，在当今的社会里就难以避免祸害了。”"
            },
            {
                "source": "子曰：“谁能出不由户？何莫由斯道也？”",
                "target": "孔子说：“谁能不经过屋门而走出屋子呢？为什么没有人走这条道路呢？”"
            },
            {
                "source": "子曰：“质胜文则野，文胜质则史。文质彬彬，然后君子。”",
                "target": "孔子说：“质朴多于文采，就会显得粗野，文采多于质朴，就难免流于浮夸。只有质朴和文采配合适当，才能成为君子。”"
            },
            {
                "source": "子曰：“人之生也直，罔之生也幸而免。”",
                "target": "孔子说：“一个人因为正直，所以在人世上能够生存，不正直的人有时也能在人世上生存，那只是因为他侥幸地躲避了灾难罢了。”"
            },
            {
                "source": "子曰：“知之者不如好之者，好之者不如乐之者。”",
                "target": "孔子说：“：“知道学习的人比不上爱好学习的人；爱好学习的人比不上以学习为乐趣的人。”"
            },
            {
                "source": "子曰：“中人以上，可以语上也；中人以下，不可以语上也。”",
                "target": "孔子说：“具有中等以上资质的人，可以给他讲授高深的学问；在中等资质以下的人，不可以给他讲高深的学问。”"
            },
            {
                "source": "樊迟问知，子曰：“务民之义，敬鬼神而远之，可谓知矣。”问仁，曰：“仁者先难而后获，可谓仁矣。”",
                "target": "樊迟问孔子怎样才算聪明，孔子说：“专心致力于（提倡）老百姓应该遵从的道德，尊敬鬼神，但要远离它们，就可以称得上聪明了。”樊迟又问怎样才叫做有仁德，孔子说：“仁人对难做的事，做在人前面，有收获的结果，他得在人后，这可以说是仁了。”"
            },
            {
                "source": "子曰：“知者乐水，仁者乐山。知者动，仁者静。知者乐，仁者寿。”",
                "target": "孔子说：“聪明人喜爱水，有仁德的人喜爱山。聪明人活动，有仁德的人沉静。聪明的人活得快乐，仁德的人长寿。”"
            },
            {
                "source": "子曰：“齐一变至于鲁，鲁一变至于道。”",
                "target": "孔子说：“如果齐国的政治改变一下，可以达到鲁国的水平；鲁国的政治改变一下，就可以达到合符大道的境界了。”"
            },
            {
                "source": "子曰：“觚不觚，觚哉！觚哉！”",
                "target": "孔子说：“觚不像个觚了，这还叫觚吗！这也算是觚吗？”"
            },
            {
                "source": "宰我问曰：“仁者，虽告之曰：‘井有仁焉。’其从之也？”子曰：“何为其然也？君子可逝也，不可陷也；可欺也，不可罔也。”",
                "target": "宰我问道：“对于有仁德的人，别人告诉他井里掉下去一位仁人，他是不是也会跳下去？”孔子说：“为什么要这样做呢？君子可以到井边去救，却不能让自己陷入井中；君子可能被欺骗，但不可能被人愚弄。”"
            },
            {
                "source": "子曰：“君子博学于文，约之以礼，亦可以弗畔矣夫。”",
                "target": "孔子说：“君子广泛地学习文献典籍，再用礼来约束自己，这样就不会离经叛道了。”"
            },
            {
                "source": "子见南子，子路不说，夫子矢之曰：“予所否者，天厌之！天厌之！”",
                "target": "孔子去见卫灵公夫人南子，子路不高兴。孔子发誓说：“假如我做了什么不正当的事的话，让上天厌弃我吧！让上天厌弃我吧！”"
            },
            {
                "source": "子曰：“中庸之为德也，其至矣乎！民鲜久矣。”",
                "target": "孔子说：“中庸作为德的体现，应该是最完美的了！而人们缺少这种美德已经很久了。”"
            },
            {
                "source": "子贡曰：“如有博施于民而能济众，何如？可谓仁乎？”子曰：“何事于仁，必也圣乎！尧、舜其犹病诸！夫仁者，己欲立而立人，己欲达而达人。能近取譬，可谓仁之方也已。”",
                "target": "子贡说：“假若一个人能给老百姓带来很多好处又能够帮助众人生活得很好，那这个人怎么样？可以说他是有仁德的人吗？”孔子说：“哪里仅仅是有仁德，简直是圣人了！就连尧、舜大概都很难做到呢。至于仁人，就是要想自己站得住，也要帮助人家一同站得住；要想自己过得好，也要帮助人家一同过得好。凡事能够推己及人，可以说是实行仁道的方法了。”"
            }
        ]
    },
    {
        "title": "颜渊篇",
        "contents": [
            {
                "source": "颜渊问仁，子曰：“克己复礼为仁。一日克己复礼，天下归仁焉。为仁由己，而由人乎哉？”颜渊曰：“请问其目？”子曰：“非礼勿视，非礼勿听，非礼勿言，非礼勿动。”颜渊曰：“回虽不敏，请事斯语矣。”",
                "target": "颜渊问什么是仁。孔子说：“克制自己，一切都照着礼的要求去做，这就是仁。一旦做到了这些，天下的人都会称许你有仁德。实行仁德要靠自己，难道是靠别人吗？”颜渊说：“请问实行仁的途径是什么。”孔子说：“违反礼的事不看，违反礼的事不听，违反礼的事不说，违反礼的事不做。”颜渊说：“我虽然愚笨，请让我照这些话去做。”"
            },
            {
                "source": "仲弓问仁，子曰：“出门如见大宾，使民如承大祭。己所不欲，勿施于人。在邦无怨，在家无怨。”仲弓曰：“雍虽不敏，请事斯语矣。”",
                "target": "仲弓问怎样做才是仁。孔子说：“出门在外，对所见所有人都当是尊贵的客人一样，保持热情和尊敬。要役使百姓做事，就像要举办重大的祭祀一样，十分恭敬。自己不想要的，不要强加在他人身上；无论是在邦国中，还是在家族中，都能无所怨。”仲弓说：“我虽然不聪敏，但肯定会照着老师的话去做。”"
            },
            {
                "source": "司马牛问仁，子曰：“仁者，其言也讱。”曰：“其言也讱，斯谓之仁已乎？”子曰：“为之难，言之得无讱乎？”",
                "target": "司马牛问怎样做才是仁。孔子说：“仁人，他的言语显得谨慎。”司马牛说：“言语谨慎，这就可以称作仁了吗？”孔子说：“做起来很困难，说起来能不慎重吗？”"
            },
            {
                "source": "司马牛问君子，子曰：“君子不忧不惧。”曰：“不忧不惧，斯谓之君子已乎？”子曰：“内省不疚，夫何忧何惧？”",
                "target": "司马牛问怎样做一个君子。孔子说：“君子不忧愁，不恐惧。”司马牛说：“不忧愁，不恐惧，这样就可以叫做君子了吗？”孔子说：“自己问心无愧，那还有什么忧愁和恐惧呢？”"
            },
            {
                "source": "司马牛忧曰：“人皆有兄弟，我独亡。”子夏曰：“商闻之矣：死生有命，富贵在天。君子敬而无失，与人恭而有礼，四海之内皆兄弟也。君子何患乎无兄弟也？”",
                "target": "司马牛忧愁地说：“人人都有兄弟，只有我没有。兄弟们死的死，逃的逃，全都失散了。”子夏说：“我听说过：‘死生有命，富贵在天。’不是人能强求的，应该接受上天安排。君子做事肃敬认真，不出差错，对人恭敬，合乎礼仪，那四海之内，都是兄弟了。怎么会没有兄弟呢？”"
            },
            {
                "source": "子张问明，子曰：“浸润之谮，肤受之愬，不行焉，可谓明也已矣；浸润之谮、肤受之愬不行焉，可谓远也已矣。”",
                "target": "子张问怎样做才算是明智的。孔子说：“暗中传播的谗言，切身感受的诽谤，在你这儿都行不通，就可以称得上明智了。暗中传播的谗言，切身感受的诽谤，在你这里都行不通，就可以说是有远见了。”"
            },
            {
                "source": "子贡问政，子曰：“足食，足兵，民信之矣。”子贡曰：“必不得已而去，于斯三者何先？”曰：“去兵。”子贡曰：“必不得已而去，于斯二者何先？”曰：“去食。自古皆有死，民无信不立。”",
                "target": "子贡问怎样治理国家。孔子回答道：“粮食储备充足，军备充足及人民的信服”子贡又问道：“如果不得已要去掉其中的一项，应该去掉哪一项呢？”孔子说：“去掉军备充足这一项。”子贡接着又问：“如果不得已还要取舍，剩下的两项中应该先舍掉哪一个呢？”孔子回答：“舍掉粮食储备充足这一项，人生自古谁无死，君主失去了民众的信任也就失去了立国之本。”"
            },
            {
                "source": "棘子成曰：“君子质而已矣，何以文为？”子贡曰：“惜乎，夫子之说君子也！驷不及舌。文犹质也，质犹文也。虎豹之鞟犹犬羊之鞟。”",
                "target": "棘子成说：“君子只要具有好的品质就行了，要那些表面的仪式干什么呢？”子贡说：“真遗憾，夫子您这样谈论君子。一言既出，驷马难追。本质就像文采，文采就像本质，都是同等重要的。去掉了毛的虎、豹皮，就如同去掉了毛的犬、羊皮一样。”"
            },
            {
                "source": "哀公问于有若曰：“年饥，用不足，如之何？”有若对曰：“盍彻乎？”曰：“二，吾犹不足，如之何其彻也？”对曰：“百姓足，君孰与不足？百姓不足，君孰与足？”",
                "target": "鲁哀公问有若说：“遇上闹饥荒的时候，国家国家的备用不足，怎么办？”有若回答说：“何不实行彻法，只抽取十分之一的税呢？”哀公说：“现在抽十分之二都不够用，怎么能实行彻法呢？”有若说：“如果百姓的用度足够，您怎么会不够呢？如果百姓的用度不够，您怎么又会够呢？”"
            },
            {
                "source": "子张问崇德辨惑，子曰：“主忠信，徙义，崇德也。爱之欲其生，恶之欲其死；既欲其生又欲其死，是惑也。‘诚不以富，亦只以异。’”",
                "target": "子张问如何崇德和辨惑。孔子说：“以忠信为主，能闻义即迁而从之，这就可以算崇德了。喜爱一个人，就希望他活下去，厌恶起来就恨不得他立刻死去。既想要他活，又想要他死，这就是迷惑。正如《诗经》上所说的：‘即使不是嫌贫爱富，也是喜新厌旧。’”"
            },
            {
                "source": "齐景公问政于孔子，孔子对曰：“君君，臣臣，父父，子子。”公曰：“善哉！信如君不君、臣不臣、父不父、子不子，虽有粟，吾得而食诸？”",
                "target": "齐景公问孔子如何治理国家。孔子说：“做君主的要像君的样子，做臣子的要像臣的样子，做父亲的要像父亲的样子，做儿子的要像儿子的样子。”齐景公说：“好哇！如果真的国君不像国君，臣子不像臣子，父亲不像父亲，儿子不像儿子，即使有粮食，我能够吃得着吗？”"
            },
            {
                "source": "子曰：“片言可以折狱者，其由也与？”子路无宿诺。",
                "target": "孔子说：“根据单面的供词就可以判决诉讼案件的，大概只有仲由吧。”子路没有说话不算话的时候。"
            },
            {
                "source": "子曰：“听讼，吾犹人也。必也使无讼乎。”",
                "target": "孔子说：“审理诉讼案件，我也和别人一样。目的在于使诉讼不再发生！”"
            },
            {
                "source": "子张问政，子曰：“居之无倦，行之以忠。”",
                "target": "子张问如何治理政事。孔子说：“身居官位不懈怠，执行君令时忠实不欺瞒。”"
            },
            {
                "source": "子曰：“博学于文，约之以礼，亦可以弗畔矣夫。”",
                "target": "孔子说：“君子广泛地学习文献典籍，再用礼来加以约束，这样也就不会离经判道了。”"
            },
            {
                "source": "子曰：“君子成人之美，不成人之恶；小人反是。”",
                "target": "孔子说：“君子通常成全他人的好事，而不促成别人的坏事。小人则与此相反。”"
            },
            {
                "source": "季康子问政于孔子，孔子对曰：“政者，正也。子帅以正，孰敢不正？”",
                "target": "季康子问孔子如何治理国家。孔子回答说：“‘政’的意思就是端正，您自己先做到端正，谁还敢不端正？”"
            },
            {
                "source": "季康子患盗，问于孔子。孔子对曰：“苟子之不欲，虽赏之不窃。”",
                "target": "季康子担忧盗窃，来向孔子请教。孔子回答说：“如果您不贪求太多的财物，即使奖励他们去偷，他们也不会干。”"
            },
            {
                "source": "季康子问政于孔子曰：“如杀无道以就有道，何如？”孔子对曰：“子为政，焉用杀？子欲善而民善矣。君子之德风，小人之德草，草上之风必偃。”",
                "target": "季康子向孔子问政事，说：“假如杀掉坏人，以此来亲近好人，怎么样？”孔子说：“您治理国家，怎么想到用杀戮的方法呢？您要是好好治国，百姓也就会好起来。君子的品如风，小人的品如草。草上刮起风，草一定会倒。”"
            },
            {
                "source": "子张问：“士何如斯可谓之达矣？”子曰：“何哉尔所谓达者？”子张对曰：“在邦必闻，在家必闻。”子曰：“是闻也，非达也。夫达也者，质直而好义，察言而观色，虑以下人。在邦必达，在家必达。夫闻也者，色取仁而行违，居之不疑。在邦必闻，在家必闻。”",
                "target": "子张问：“士要怎么样才可说是通达了？”孔子说：“你所说的通达是什么呢？”子张回答说：“在诸侯的国家一定有名声，在大夫的封地一定有名声。”孔子说：“这是有名声，不是通达。通达的人，本质正直而喜爱道义，体会别人的话语，观察别人的脸色，时常想到对别人谦让。这样的人在诸侯的国家一定通达，在大夫的封地也一定通达。有名声的人，表面上要实行仁德而行动上却相反，以仁人自居而毫不迟疑。他们在诸侯的国家一定虚有其名，在大夫的封地也一定虚有其名。”"
            },
            {
                "source": "樊迟从游于舞雩之下，曰：“敢问崇德、修慝、辨惑。”子曰：“善哉问！先事后得，非崇德与？攻其恶，无攻人之恶，非修慝与？一朝之忿，忘其身，以及其亲，非惑与？”",
                "target": "樊迟陪着孔子在舞雩台下游览，说：“请问如何提高自己的品德修养，改正过失，辨别是非？”孔子说：“问得好啊！辛劳在先，享乐在后，这不就可以提高自己的品德修养吗？检查自己的错误，不去指责别人的缺点，这不就消除潜在的怨恨了吗？因为一时气愤，而不顾自身和自己的双亲，这不就是迷惑吗？”"
            },
            {
                "source": "樊迟问仁，子曰：“爱人。”问知，子曰：“知人。”樊迟未达，子曰：“举直错诸枉，能使枉者直。”樊迟退，见子夏，曰：“乡也吾见于夫子而问知，子曰：‘举直错诸枉，能使枉者直’，何谓也？”子夏曰：“富哉言乎！舜有天下，选于众，举皋陶，不仁者远矣。汤有天下，选于众，举伊尹，不仁者远矣。”",
                "target": "樊迟问什么是仁。孔子说：“爱人。”樊迟问什么是智，孔子说：“了解人。”樊迟还不明白。孔子说：“把正直的人提拔上来，使他们的位置在不正直的人上面，就能使不正直的人变正直。”樊迟退出来，见到子夏说：“刚才我见到老师，问他什么是智，他说‘把正直的人提拔上来，使他们的位置在不正直的人上面。这是什么意思？”子夏说：“这个话多么富有深意呀！舜有了天下，在众人中选拔人才，把皋陶提拔了起来，不仁的人就远远地离开了。汤有了天下，在众人中挑选人才，把伊尹选拔出来，不仁的人就被疏远了。”"
            },
            {
                "source": "子贡问友，子曰：“忠告而善道之，不可则止，毋自辱焉。”",
                "target": "子贡问应该怎样对待朋友。孔子说：“忠言相告，好话对导，他不听就算了，不要自取其辱。”"
            },
            {
                "source": "曾子曰：“君子以文会友，以友辅仁。”",
                "target": "曾子说：“高尚的人凭借文才聚会朋友，凭借朋友辅助仁爱。”"
            }
        ]
    }
]